{"pages":[{"title":"A propos du manuel","text":"La page handbook.opendata.swiss propose des modes d'emploi et des directives pour la publication de données sur opendata.swiss. Le manuel est conçu comme un Wiki - opendata.swiss et met à disposition des textes de base. Ces derniers sont ensuite complétés par les autorités publiant des données en fonction des expériences qu'elles ont faites. Le manuel OGD disponible sur handbook.opendata.swiss est un recueil de modes d'emploi à l'intention des autorités publiant des données. Les directives existantes, comme le standard des métadonnées retenu pour le catalogue du portail, y figurent également. Les textes s'articulent autour du processus de publication sur opendata.swiss, couvrant les étapes qui vont de l'identification de potentielles données ouvertes au soutien des utilisateurs durant l'exploitation. Le manuel est tributaire des expériences faites par les autorités publiant des données. Celles-ci sont donc invitées à compléter les textes figurant sur handbook.opendata.swiss sur la base de leurs expériences. Le fonctionnement détaillé de cette procédure est décrit ici . Pour plus d'informations concernant le portail opendata.swiss, cliquez ici . Le projet OGD Suisse, dans le cadre duquel opendata.swiss et le manuel ont été élaborés, est présenté sur le site d'egovernment suisse . N'hésitez pas à nous contacter si vous souhaitez collaborer au manuel ou si vous avez des questions.","tags":"pages","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/pages/about.html"},{"title":"Mode d'emploi","text":"Le manuel OGD est conçu comme un Wiki: chacun peut apporter sa pierre à l'édifice. Les contributeurs seront généralement des personnes qui publient des données sur opendata.swiss pour le compte de leur organisation. Vous pouvez saisir vos suggestions, qu'elles concernent des modifications, des nouveaux sujets ou encore des corrections directement sur les pages en question. Editer un contenu Avant de commencer à éditer, veuillez vous assurer que personne n'a encore soumis la même modification en consultant la liste des questions en suspens . Si ce n'est pas le cas, procédez comme suit: Créez un compte sur GitHub et inscrivez-vous. Prenez le temps de lire les brèves explications fournies par GitHub. Retournez dans le manuel OGD et, sur la page que vous souhaitez modifier, cliquez sur «Editer». Procédez aux adaptations avec le simple éditeur mis à votre disposition ou avec le langage de programmation Markdown. Veuillez indiquer ce que vous avez changé dans le formulaire qui se trouve au bas de la page. Pour valider vos modifications, cliquez sur «new pull request». Vos modifications seront alors sauvegardées en tant que nouvelle version de la page (nommée «fork» dans GitHub). Nous examinerons ensuite vos modifications, et vous recevrez un courriel dès que votre version sera en ligne. Aides Pour de plus amples informations concernant GitHub, consultez l'aide . Le langage de programmation Markdown est présenté ici . N'hésitez pas de nous contacter si vous avez besoin d'aide. Dernières mises à jour Ci-dessous vous pouvez voir les dernières ajouts et changements dans GitHub:","tags":"pages","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/pages/contribute.html"},{"title":"Etes-vous prêts à publier des données en libre accès?","text":"","tags":"pages","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/"},{"title":"Mention juridique","text":"Responsabilité Malgré toute l'attention portée aux informations diffusées, aucune responsabilité ne peut être endossée quant à leur exactitude, actualité, et exhaustivité. Les autorités participantes se réservent expressément le droit de modifier, de supprimer ou d'interrompre la publication de leurs données, et ce à tout moment et sans avertissement. Les autorités ne sauraient être tenues pour responsables des dommages matériels ou immatériels résultant de l'accès au portail, de l'utilisation ou de la non-utilisation des informations publiées, d'un piratage de la connexion ou d'un problème technique. Renvois et liens Les renvois et liens vers d'autres sites Internet ne sont pas de la responsabilité des autorités participantes. L'accès à ces sites et leur utilisation se font aux risques des utilisateurs. Les autorités participantes déclarent expressément qu'elles n'ont aucune influence sur la forme, le contenu et les offres des sites auxquels elles renvoient. Les informations et services offerts par ces sites relèvent entièrement de la responsabilité de leurs auteurs. Toute responsabilité pour ces sites Internet est exclue. Protection des données L'art. 13 de la Constitution fédérale et la législation suisse sur la protection des données disposent que toute personne a droit à la protection de sa sphère privée ainsi qu'à la protection contre l'emploi abusif des données qui la concernent. Les autorités participantes respectent ces dispositions. Les données personnelles sont traitées de façon strictement confidentielle sur handbook.opendata.swiss et ne sont ni vendues, ni transmises à des tiers. Nous nous efforçons, en collaboration étroite avec nos hébergeurs, de protéger au mieux les banques de données des intrusions externes et de prévenir les pertes, les abus et les falsifications. Lors de l'accès à handbook.opendata.swiss , les données suivantes sont enregistrées dans des fichiers journaux: l'adresse IP, la date, l'heure, les données saisies dans le masque de recherche ainsi que des informations générales concernant le système d'exploitation et le navigateur. Les serveurs de nos hébergeurs enregistrent uniquement des données d'utilisation impersonnelles permettant de fournir aux autorités participantes des tendances servant à améliorer l'offre (fichiers journaux). Pour de plus amples renseignements concernant les analyses des informations sur les visiteurs du site, voir la section suivante. Les données d'utilisation ne sont pas associées à des données personnelles, sauf pour ce qui est de la prise de contact volontaire. Votre adresse électronique est enregistrée dans une banque de données distincte, sans lien avec les fichiers journaux anonymes. L'enregistrement peut être annulé à tout moment. Analyse des informations sur les visiteurs du site handbook.opendata.swiss utilise le logiciel open source Piwik pour analyser les informations sur les visiteurs du site. Piwik utilise des «cookies», qui sont des fichiers texte sauvegardés sur votre ordinateur et permettent d'analyser votre utilisation du site. Les informations d'utilisation générées par le cookie (y compris une version courte de votre adresse IP) sont transmises à notre serveur en Suisse à des fins d'analyse. Ces données sont destinées à l'optimisation du site. Votre adresse IP est immédiatement anonymisée au cours de cette procédure. L'utilisateur peut refuser l'enregistrement des cookies en configurant son navigateur; il est possible que certaines fonctionnalités du site Internet ne soient pas disponibles si les cookies sont désactivés. Droit d'auteur En principe, les données publiées sur handbook.opendata.swiss ne sont pas soumises au droit d'auteur. Les informations publiées sur handbook.opendata.swiss sont mises à la disposition du public. Code source Le handbook.opendata.swiss utilise Pelican , un générateur de site statique. Pelican et toutes ses composantes sont des logiciels open source . Conformément à la licence Affero GNU GPL v3.0, les extensions développées pour la présente plateforme sont également en libre accès .","tags":"pages","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/"},{"title":"Bibliothèque","text":"Les documents et les liens de la bibliothèque sont classés en quatre étapes à des fins de publications OGD. A l'heure actuelle, tout le contenu n'est pas encore disponible dans toutes les langues.","tags":"pages","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/pages/library.html"},{"title":"Mapping ISO-19139_che to DCAT-AP Switzerland","text":"Cet article est disponible en anglais .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/iso-19139-che-dcat.html"},{"title":"Advanced Search","text":"Cet article est disponible en anglais .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/advanced-search.html"},{"title":"Guide - Open Government Data pour géodonnées","text":"Les données des institutions publiques sont de plus en plus souvent rendues accessibles sous la forme d'Open Government Data (OGD). En Suisse également, le Conseil fédéral a élaboré une stratégie OGD et le portail OGD opendata.swiss est lui aussi opérationnel. Le présent guide entend répondre aux objectifs suivants: montrer aux responsables des géodonnées des autorités fédérales, indépendamment de leur niveau, le cheminement d'une publication sur opendata.swiss et décrire tant les décisions nécessaires que leurs conséquences. Dans l'idéal, les données ouvertes (Open Data) impliquent une publication pour une utilisation, une modification et une transmission libres, et ce pour tout usage. Cela suppose des exigences obligatoires (lisibilité par des machines p. ex.) et la possibilité de définir des restrictions (indication obligatoire de la source p. ex.). Les OGD sont el es aussi soumises à des conditions d'utilisation correspondantes («licences» basées sur le droit privé). La publication en tant que Linked Open Data (LOD) pose des exigences techniques plus strictes et contribue à la production et à l'échange automatique de connaissances (Semantic Web).","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/geodaten-leitfaden.html"},{"title":"Linked Open Data","text":"Cet article est disponible en anglais .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/linked-open-data.html"},{"title":"Analysis of options for embedding datasets from opendata.swiss","text":"Cet article est disponible en anglais .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/embed.html"},{"title":"Usage of the API","text":"Cet article est disponible en anglais .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/ckan-api.html"},{"title":"Harvester","text":"Cet article est disponible en allemand .","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/publish/harvester.html"},{"title":"Contrôle juridique préliminaire","text":"Dans l'administration publique, la décision découle généralement d'une base légale, soit une loi ou son ordonnance d'exécution, qui régit la possibilité de publier des données et prévoit les éventuelles restrictions. Les conditions d'utilisation de vos données dépendent de la base légale. Pour de plus amples informations, reportez-vous à la section traitant des conditions d'utilisation . Le schéma suivant explique, étape par étape, comment déterminer si un jeu de données peut être publié comme OGD. Si vous avez besoin d'informations complémentaires concernant les différentes étapes, veuillez consulter ce document . Le document Rechtliche Rahmenbedingungen zur Publikation von Daten als Open Government Data (OGD) présente en outre une vue d'ensemble des questions juridiques pertinentes en matière d'OGD.","tags":"Prepare","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/prepare/frameworks.html"},{"title":"Choisir le mode de publication","text":"Vous avez le choix entre quatre options techniques pour publier vos données sur opendata.swiss. Le tableau suivant vous aidera à déterminer quelle option est la plus adaptée pour votre organisation. Nombre de jeux de données et rythme de mise à jour Option de publication peu de jeux de données, mise à jour peu fréquente Option 1 – saisir manuellement les métadonnées via le formulaire en ligne (allemand) plus de 10 jeux de données, mise à jour régulière Option 2 – téléverser manuellement les métadonnées via un fichier XML (allemand), voir aussi DCAT-AP for Switzerland format grand nombre de jeux de données, mise à jour fréquente Option 3 – téléverser automatiquement les métadonnées à l'aide d'un «harvester» géodonnées, publiées sur geo.admin.ch / Bundes Geodaten-Infrastruktur BGDI ou qui vont l'être sous peu. Option 4 – téléverser automatiquement les métadonnées à l'aide d'un «geocat harvester» La procédure de publication des données dépend de l'option choisie. Veuillez contacter les responsables du portail afin de déterminer avec l'aide de nos spécialistes quelle option est la plus adaptée à vos besoins. Une fois l'option choisie, vous devrez préparer les métadonnées selon le standard DCAT-AP.","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/publish/options.html"},{"title":"Qu'entend-on par Open Government Data (OGD)?","text":"Le portail OGD suisse, opendata.swiss, regroupe des informations aussi diverses que les limites territoriales des communes suisses, des statistiques démographiques, les données météorologiques du jour, des documents historiques ou encore un répertoire de la littérature suisse. Les données sont souvent mises à disposition sous forme de jeux de données complets pouvant par la suite être réutilisées ou combinées par les utilisateurs pour créer des applications ou des présentations qui mettent en lumière de nouvelles corrélations sur la base de données existantes. Aujourd'hui déjà, une grande quantité de données sont disponibles gratuitement, mais elles ne sont pas étiquetées «OGD». Ces données se prêtent particulièrement bien à la publication sur opendata.swiss, car elles peuvent être reliées assez simplement au portail. Les sites suivants comportent de précieuses informations supplémentaires sur l'OGD: La Stratégie en matière de libre accès aux données publiques en Suisse pour les années 2014 à 2018 (stratégie OGD 2014-2018) arrête les objectifs et les mesures nécessaires à une mise en œuvre au niveau de la Confédération. Elle sert en outre de base à la mise en place d'une collaboration avec les cantons et les communes. L' Open Knowledge Foundation , organisation internationalement reconnue, fournit des informations détaillées au sujet de l'OGD. La section suisse de l'Open Knowledge Foundation est l'association opendata.ch ; elle organise des manifestations pour les personnes s'intéressant à l'OGD et pour ses utilisateurs et représente la communauté OGD. Puisez dans les connaissances existantes. Bon nombre d'organisations publient déjà des données publiques en libre accès. Profitez de leur expérience et collaborez avec elles. N'hésitez pas à contacter les Archives fédérales si vous avez besoin d'assistance. Renseignez-vous en amont auprès de journalistes, de programmateurs ou de l'association opendata.ch pour savoir quels jeux de données sont particulièrement recherchés.","tags":"Identify","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/identify/opengovdata.html"},{"title":"Quelles sont les données existantes dans mon organisation?","text":"Commencez par relever les jeux de données les plus demandés, qui sont peut-être déjà publiés. Si, par la suite, vous souhaitez établir un inventaire exhaustif de vos collections de données, nous vous invitons à consulter ce lien . Sélection des OGD: catalogue de questions Les questions suivantes ont été conçues pour vous aider à déterminer les données pouvant être publiées sur opendata.swiss. Quelles données ont déjà été publiées (site Internet, autres portails, etc.)? Quelles sont les données de votre organisation qui sont le plus souvent demandées? Serait-il imaginable de les publier à titre proactif? Quelles sont les données de votre organisation qui devraient être publiées pour des raisons d'efficience (publication unique au lieu de les fournir à chaque personne qui en fait la demande)? Disposez-vous d'un inventaire de tous vos recueils de données? Des informations sur vos jeux de données ont-elles été recensées dans le cadre d'autres projets informatiques? Après avoir identifier les données adéquates, vous devez contrôler si, sur les plans technique et légal, il est possible de les publier en libre accès. Vous trouverez d'autres informations sur la préparation de la publication des données ici . Différence entre OGD et prestations spécifiques à un client En principe, les OGD qui sont publiées sont celles qui font l'objet d'une forte demande et qui peuvent être réutilisées par d'autres personnes. Les jeux de données réalisés à la demande d'un client spécifique ne sont généralement pas considérés comme des OGD. La délimitation est explicitée plus en détail ici .","tags":"Identify","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/identify/identifying.html"},{"title":"Publication du géodonnées","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/geodaten-publikation.html"},{"title":"Inventaire des données","text":"Un inventaire des données vous donne une vue d'ensemble des données existantes et facilite la sélection de celles qui sont prêtes à être publiées comme OGD. Rien ne s'oppose toutefois à ce que vous publiiez des jeux de données isolés sur opendata.swiss. Situation de la Confédération La stratégie OGD 2014-2018 confère le mandat suivant à la Confédération: M4 Recensement des données de la Confédération Il est établi progressivement et publié un registre central des données de l'administration fédérale susceptibles de constituer des OGD, sur la base duquel sera planifiée et développée l'offre future. Les Archives fédérales coordonnent ce registre central, qui doit contenir des informations sur les: données sous forme de bases de données registres, appelés entrepôts de données (data warehouses) collections similaires de jeux de données structurées Les Archives fédérales ont réalisé un premier cycle d'inventoriage, documenté ici . Le second cycle est prévu pour l'automne 2016. Plusieurs pays ont déjà une plus grande expérience de l'inventoriage des données: la Grande-Bretagne les Etats-Unis les Pays-Bas","tags":"Identify","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/identify/inventory.html"},{"title":"Publication","text":"Verser vos métadonnées sur opendata.swiss Après avoir choisi un mode de publication, vous serez prête les métadonnées sur opendata.swiss. Ce processus compte trois étapes: Préparatifs de nature organisationnelle et technique de votre côté (fournisseur de données) Versement dans le catalogue opendata.swiss Mise en ligne du catalogue mis à jour sur opendata.swiss Le fonctionnement d'opendata.swiss est décrit en détail dans le manuel de l'utilisateur . Préparatifs Attribution des rôles: Définir le propriétaire des données (data owner): qui, au sein de votre organisation, est responsable des données et de leur publication? Définir le fournisseur des données: qui assume la responsabilité sur le plan technique (tâches possibles: saisir les métadonnées, tester, faire les mises à jour)? Définir qui contrôle la qualité des descriptions et des métadonnées et qui peut répondre aux questions relevant du contenu/de la teneur des jeux de données? Définir le Single Point of Contact (SPOC) pour l'administrateur du portail. Préparation des données et des métadonnées: Vérifier la référence à la base légale régissant la publication . Contrôler le choix des conditions d'utilisation . Contrôler dans quel format ces jeux de données doivent être publiés. Recommandations relatives aux formats des données Le choix du format dans lequel vous mettrez à disposition vos données sur opendata.swiss vous appartient. Nous vous recommandons toutefois de vous en tenir aux formats figurant dans le document Recommendations de formats OGD . Contrôler, si nécessaire, la qualité des données Importation des métadonnées Avant que vous puissiez saisir les métadonnées sur opendata.swiss, l'équipe résponsable du portail doivent créer votre organisation dans le système. Contactez nous , si votre organisation n'a pas encore publié de données sur le portail. Mettez ensuite l'accent sur les points suivants: Familiarisez-vous avec l'interface utilisateur et les champs DCAT-AP. Le fonctionnement d'opendata.swiss est décrit en détail dans le manuel de l'utilisateur . Saisissez les métadonnées en complétant les champs définis selon le standard DCAT-AP (les champs à compléter dépendent du mode de publication choisi). Envoyez-nous une image et une description de votre organisation, si possible en quatre langues (DE, FR, IT, EN). Nous publierons la photo et le texte sur la page de votre organisation ( par exemple ici ). Mise en ligne L'équipe du portail et le fournisseur des données s'attachent à vérifier que toutes les données, métadonnées et descriptions soient présentées correctement dans l'environnement de test. Une fois que vous avez donné le feu vert, les Archives fédérales mettent vos données en ligne. Publication à travers geo.admin.ch Cet article est disponible dans notre librarie .","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/publish/swiss.html"},{"title":"Choix des conditions d'utilisation","text":"Pour les utilisateurs des données, les lois et ordonnances sont souvent difficiles à comprendre, sans compter que, vu le nombre de lois existant, il n'est pas simple de garder la vue d'ensemble. C'est la raison pour laquelle, sur opendata.swiss, chaque jeu de données est assorti de conditions d'utilisation expliquant l'utilisation qui peut être faite du jeu de données en question: quelques phrases et symboles traduisent la base juridique déterminante en une langue uniforme et aisément compréhensible par l'utilisateur. En tant qu'organisation publiant des données, vous devez par conséquent choisir des conditions d'utilisation qui reflètent correctement les dispositions de la base légale pertinente avant de publier les données sur opendata.swiss. Vous trouverez ici une vue d'ensemble des conditions d'utilisation autorisées pour opendata.swiss. Choisissez à présent les conditions d'utilisation applicables sur la base de la conclusion du contrôle juridique préliminaire . Conclusion du contrôle juridique préliminaire Conditions d'utilisation Le jeu de données peut être publié sans restriction d'utilisation sur opendata.swiss. Utilisation libre Le jeu de données peut être publié sur opendata.swiss, mais l'indication de la source est obligatoire. Utilisation libre. Obligation d'indiquer la source. Cas spécial: vous avez répondu «oui» à toutes les questions du schéma sauf à la question de l'utilisation commerciale ou à celle de l'indication de la source. (voir explications ci-dessous) Utilisation libre. Utilisation à des fins commerciales uniquement avec l'autorisation du fournisseur des données. ou Utilisation libre. Obligation d'indiquer la source. Utilisation à des fins commerciales uniquement avec l'autorisation du fournisseur des données. Pas d'OGD Pas de publication sur opendata.swiss Cas spécial: si la base juridique pertinente ne permet pas d'utilisation commerciale, vous ne pouvez pas publier vos données sur opendata.swiss pour le moment. Si l'utilisation commerciale est permise, mais qu'elle appelle une autorisation, il s'agit d'un cas spécial. Si vous prévoyez de publier les données sur opendata.swiss, vous devez déterminer à l'avance que vous autoriserez en principe l'utilisation commerciale. Les données auxquelles s'appliquent des conditions plus restrictives ne sont pas publiées sur opendata.swiss. Vous aurez besoin de vos conditions d'utilisation et du lien vers la base juridique à un stade ultérieur, pour compléter les métadonnées du catalogue sur opendata.swiss . Le document Rechtliche Rahmenbedingungen zur Publikation von Daten als Open Government Data (OGD) contient des informations complémentaires sur les questions juridiques pertinentes en matière d'OGD.","tags":"Prepare","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/prepare/terms.html"},{"title":"Guide utilisateur opendata.swiss","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/opendataswiss-userguide.html"},{"title":"DCAT-AP for Switzerland format","text":"Cet article est disponible en anglais .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/ch-dcat-ap.html"},{"title":"Hébergement des données","text":"L'hébergement de données est devenu assez bon marché et simple à mettre en place, même si vous n'avez pas encore de solution idoine au sein de votre organisation. Avant la publication, il faut toutefois réfléchir aux points suivants. Cet article est disponible en anglais .","tags":"Prepare","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/prepare/hosting.html"},{"title":"Home","text":"Welcome to the OGD Handbook wiki! See [README.md] for information on how to contribute.","tags":"handbook","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/handbook/home.html"},{"title":"Publier sur opendata.swiss","text":"Cet article est disponible en anglais .","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/publish/opendata-swiss.html"},{"title":"Préparer les données pour leur publication","text":"Cet article est disponible en anglais .","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/publish/prepare.html"},{"title":"Recommendations de formats OGD","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/empfehlungen-formate.html"},{"title":"DCAT Distribution","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/dcat-distribution.html"},{"title":"DCAT Application Profile","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/dcat-application.html"},{"title":"DCAT Catalog","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/dcat-catalog.html"},{"title":"DCAT Dataset","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/dcat-dataset.html"},{"title":"Report on Databases of the Confederation","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/bericht-datenbestaende-bund.html"},{"title":"Arbeitshilfe für Behörden zur Publikation von Daten als OGD","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/arbeitshilfe-publikation.html"},{"title":"Entscheidgrundlage - Weiteres Vorgehen bezüglich Rechtsgrundlagen für die Publikation von Daten als OGD","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/entscheid-rechtsgrundlagen.html"},{"title":"Entscheidgrundlage - Nutzungsbedingungen","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/entscheidgrundlage-nutzungsbedingungen.html"},{"title":"Konzept - Rechtliche Rahmenbedingungen zur Publikation von Daten als Open Government Data (OGD)","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/konzept-rechtliche-rahmen.html"},{"title":"Rechtliche Grundlagen OGD (Disclaimer)","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/rechtliche-grundlagen-disclaimer.html"},{"title":"Textbausteine für Standardformulierungen","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/textbausteine-standardformulierungen.html"},{"title":"Abgrenzung zwischen OGD und kundenspezifischen, individuellen Leistungen","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/bericht-abgrenzung-leistungen.html"},{"title":"Für die Gebührenproblematik relevante offene Fragen","text":"Cet article est disponible en allemand .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/library/fragen-gebuehrenproblematik.html"},{"title":"Mapping ISO-19139_che to DCAT-AP Switzerland","text":"Dieses Dokument ist derzeit nur in englischer Sprache verfügbar .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/iso-19139-che-dcat.html"},{"title":"Mapping ISO-19139_che to DCAT-AP Switzerland","text":"This documentation describes the mapping from ISO-19139_che to DCAT-AP Switzerland . ISO-19139_che is a standard used by Geocat , a data source from which opendata.swiss harvests datasets. In this documentation we focus on the XML serialization of ISO-19139_che and therefore describe the mapping in form of XPath (if not noted differently). Example XML serialization of an ISO-19139_che dataset Definition of dct:identifier Display name on opendata.swiss Identifier ISO-19139_che XPath //gmd:fileIdentifier/gco:CharacterString + '@' organization-slug (configuration of the harvester) Description Example of ISO-19139_che: <gmd:fileIdentifier> <gco:CharacterString> 93814e81-2466-4690-b54d-c1d958f1c3b8 </gco:CharacterString> </gmd:fileIdentifier> Definition of dct:title Display name on opendata.swiss Pagetitle ISO-19139_che XPath //gmd:identificationInfo//gmd:citation//gmd:title//gmd:textGroup/gmd:LocalisedCharacterString Description Example: <gmd:title xsi:type= \"gmd:PT_FreeText_PropertyType\" > <gco:CharacterString> Lärmbelastung durch Eisenbahnverkehr (Lr_Nacht) </gco:CharacterString> <gmd:PT_FreeText> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#FR\" > Exposition au bruit du trafic ferroviaire (Lr_nuit) </gmd:LocalisedCharacterString> </gmd:textGroup> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#DE\" > Lärmbelastung durch Eisenbahnverkehr (Lr_Nacht) </gmd:LocalisedCharacterString> </gmd:textGroup> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#EN\" > Nighttime railway noise exposure </gmd:LocalisedCharacterString> </gmd:textGroup> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#IT\" > Esposizione al rumore del traffico ferroviario (Lr_notte) </gmd:LocalisedCharacterString> </gmd:textGroup> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#RM\" > Grevezza da canera tras il traffic da viafier durant la notg </gmd:LocalisedCharacterString> </gmd:textGroup> </gmd:PT_FreeText> </gmd:title> Definition of dct:description Display name on opendata.swiss Description ISO-19139_che XPath //gmd:identificationInfo//gmd:abstract//gmd:textGroup/gmd:LocalisedCharacterString Description Example: <gmd:abstract xsi:type= \"gmd:PT_FreeText_PropertyType\" > <gco:CharacterString> swissTLM3D Wanderwege enthält die signalisierten Wanderrouten der Schweiz und des Fürstentums Liechtenstein. Der Datensatz wird in Zusammenarbeit mit dem Bundesamt für Strassen ASTRA, SchweizMobil, Schweizer Wanderwege und den Kantonen publiziert. swissTLM3D Wanderwege bildet einen Teil des Datensatzes swissTLM3D. </gco:CharacterString> <gmd:PT_FreeText> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#FR\" > swissTLM3D chemins de randonnée pédestre comprend les chemins de randonnée officiels de la Suisse et de la Principauté de Liechtenstein. Le jeu de données est publié en collaboration avec l'Office fédéral des routes OFROU, SuisseMobile, Suisse Rando et les cantons. swissTLM3D chemins de randonnée pédestre fait partie du jeu de données swissTLM3D. </gmd:LocalisedCharacterString> </gmd:textGroup> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#DE\" > swissTLM3D Wanderwege enthält die signalisierten Wanderrouten der Schweiz und des Fürstentums Liechtenstein. Der Datensatz wird in Zusammenarbeit mit dem Bundesamt für Strassen ASTRA, SchweizMobil, Schweizer Wanderwege und den Kantonen publiziert. swissTLM3D Wanderwege bildet einen Teil des Datensatzes swissTLM3D. </gmd:LocalisedCharacterString> </gmd:textGroup> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#EN\" > swissTLM3D hiking trails contains the hiking trails of Switzerland and the Principality of Liechtenstein. This dataset is published in collaboration with the Federal roads office FEDRO, SwitzerlandMobility, Suisse Rando and the cantons. swissTLM3D hiking trails forms a part of the dataset swissTLM3D. </gmd:LocalisedCharacterString> </gmd:textGroup> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#IT\" > swissTLM3D sentieri pedestri comprende i sentieri pedestri ufficiali della Svizzera e del Principato del Liechtenstein. Il set di dati viene pubblicato in collaborazione con l'Ufficio federale delle strade USTRA, SvizzeraMobile, Sentieri Svizzeri e i cantoni. swissTLM3D sentieri pedestri fa parte del set di dati swissTLM3D. </gmd:LocalisedCharacterString> </gmd:textGroup> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#RM\" > swissTLM3D Sendas da viandar cuntegna las sendas da viandar uffizialas da la Svizra e dal Principadi da Liechtenstein. L'unitad da datas vegn publitgada en collavuraziun cun l'Uffizi federal da vias UVias, cun SvizraMobila, cun Sendas svizras e cun ils chantuns. swissTLM3D Sendas da viandar è ina part da l'unitad da datas swissTLM3D. </gmd:LocalisedCharacterString> </gmd:textGroup> </gmd:PT_FreeText> </gmd:abstract> Definition of dct:issued Display name on opendata.swiss Issued date ISO-19139_che XPath ///gmd:identificationInfo//gmd:citation//gmd:CI_Date[.//gmd:CI_DateTypeCode/@codeListValue = \"publication\"]//gco:Date or gco:DateTime //gmd:identificationInfo//gmd:citation//gmd:CI_Date[.//gmd:CI_DateTypeCode/@codeListValue = \"creation\"]//gco:Date or gco:DateTime //gmd:identificationInfo//gmd:citation//gmd:CI_Date[.//gmd:CI_DateTypeCode/@codeListValue = \"revision\"]//gco:Date or gco:DateTime The first found date is taken in the order defined above. Description Example: <gmd:CI_DateTypeCode codeListValue= \"revision\" codeList= \"http://standards.iso.org/ittf/PubliclyAvailableStandards/ISO_19139_Schemas/resources/codelist/ML_gmxCodelists.xml#CI_DateTypeCode\" /> Definition of dct:modified Display name on opendata.swiss Modified date ISO-19139_che XPath //gmd:identificationInfo//gmd:citation//gmd:CI_Date[.//gmd:CI_DateTypeCode/@codeListValue = \"revision\"]//gco:Date or gco:DateTime Description Example: <gco:Date> 2011-12-31 </gco:Date> <gco:DateTime> 2009-01-01T00:00:00 </gco:DateTime> Definition of dct:publisher Display name on opendata.swiss Publishers ISO-19139_che XPath The first one in the following order: //gmd:identificationInfo//gmd:pointOfContact[.//gmd:CI_RoleCode/@codeListValue = \"publisher\"]//gmd:organisationName/gco:CharacterString //gmd:identificationInfo//gmd:pointOfContact[.//gmd:CI_RoleCode/@codeListValue = \"owner\"]//gmd:organisationName/gco:CharacterString //gmd:identificationInfo//gmd:pointOfContact[.//gmd:CI_RoleCode/@codeListValue = \"pointOfContact\"]//gmd:organisationName/gco:CharacterString //gmd:identificationInfo//gmd:pointOfContact[.//gmd:CI_RoleCode/@codeListValue = \"distributor\"]//gmd:organisationName/gco:CharacterString //gmd:identificationInfo//gmd:pointOfContact[.//gmd:CI_RoleCode/@codeListValue = \"custodian\"]//gmd:organisationName/gco:CharacterString //gmd:contact//che:CHE_CI_ResponsibleParty//gmd:organisationName/gco:CharacterString Description Example: <gmd:pointOfContact xlink:show= \"embed\" > <che:CHE_CI_ResponsibleParty xmlns:geonet= \"http://www.fao.org/geonetwork\" gco:isoType= \"gmd:CI_ResponsibleParty\" > <gmd:organisationName xsi:type= \"gmd:PT_FreeText_PropertyType\" > ... </gmd:organisationName> <gmd:positionName xsi:type= \"gmd:PT_FreeText_PropertyType\" > ... </gmd:positionName> <gmd:contactInfo> <gmd:CI_Contact> <gmd:phone> ... </gmd:phone> <gmd:address> ... </gmd:address> <gmd:onlineResource> ... </gmd:onlineResource> </gmd:CI_Contact> </gmd:contactInfo> <gmd:role> <gmd:CI_RoleCode codeList= \"http://www.isotc211.org/2005/resources/codeList.xml#CI_RoleCode\" codeListValue= \"pointOfContact\" /> </gmd:role> <che:individualLastName> ... </che:individualLastName> <che:organisationAcronym xsi:type= \"gmd:PT_FreeText_PropertyType\" > ... </che:organisationAcronym> </che:CHE_CI_ResponsibleParty> </gmd:pointOfContact> Definition of dcat:contactPoint Display name on opendata.swiss Contact points ISO-19139_che XPath The first one in the following order: //gmd:identificationInfo//gmd:pointOfContact[.//gmd:CI_RoleCode/@codeListValue = \"pointOfContact\"]//gmd:address//gmd:electronicMailAddress/gco:CharacterString //gmd:identificationInfo//gmd:pointOfContact[.//gmd:CI_RoleCode/@codeListValue = \"owner\"]//gmd:address//gmd:electronicMailAddress/gco:CharacterString //gmd:identificationInfo//gmd:pointOfContact[.//gmd:CI_RoleCode/@codeListValue = \"publisher\"]//gmd:address//gmd:electronicMailAddress/gco:CharacterString //gmd:identificationInfo//gmd:pointOfContact[.//gmd:CI_RoleCode/@codeListValue = \"distributor\"]//gmd:address//gmd:electronicMailAddress/gco:CharacterString //gmd:identificationInfo//gmd:pointOfContact[.//gmd:CI_RoleCode/@codeListValue = \"custodian\"]//gmd:address//gmd:electronicMailAddress/gco:CharacterString //gmd:contact//che:CHE_CI_ResponsibleParty//gmd:address//gmd:electronicMailAddress/gco:CharacterString Description Example: <gmd:pointOfContact xlink:show= \"embed\" > <che:CHE_CI_ResponsibleParty xmlns:geonet= \"http://www.fao.org/geonetwork\" gco:isoType= \"gmd:CI_ResponsibleParty\" > <gmd:organisationName xsi:type= \"gmd:PT_FreeText_PropertyType\" > <gco:CharacterString> Bundesamt für Umwelt </gco:CharacterString> <gmd:PT_FreeText> ... </gmd:PT_FreeText> </gmd:organisationName> <gmd:positionName xsi:type= \"gmd:PT_FreeText_PropertyType\" > <gco:CharacterString> Abteilung Lärm und NIS </gco:CharacterString> <gmd:PT_FreeText> ... </gmd:PT_FreeText> </gmd:positionName> <gmd:contactInfo> <gmd:CI_Contact> ... </gmd:CI_Contact> </gmd:contactInfo> <gmd:role> <gmd:CI_RoleCode codeList= \"http://www.isotc211.org/2005/resources/codeList.xml#CI_RoleCode\" codeListValue= \"pointOfContact\" /> </gmd:role> <che:individualLastName> <gco:CharacterString> BAFU noise </gco:CharacterString> </che:individualLastName> <che:organisationAcronym xsi:type= \"gmd:PT_FreeText_PropertyType\" > <gco:CharacterString> BAFU </gco:CharacterString> <gmd:PT_FreeText> ... </gmd:PT_FreeText> </che:organisationAcronym> </che:CHE_CI_ResponsibleParty> </gmd:pointOfContact> Definition of dcat:theme Display name on opendata.swiss Categories ISO-19139_che XPath //gmd:identificationInfo//gmd:topicCategory/gmd:MD_TopicCategoryCode biota => http://opendata.swiss/themes/agriculture society => http://opendata.swiss/themes/culture health => http://opendata.swiss/themes/health transportation => http://opendata.swiss/themes/mobility intelligenceMilitary => http://opendata.swiss/themes/public-order farming => http://opendata.swiss/themes/agriculture economy => http://opendata.swiss/themes/national-economy utilitiesCommunication_Energy => http://opendata.swiss/themes/energy Everything else is mapped to http://opendata.swiss/themes/territory . Additionally get all records in category http://opendata.swiss/themes/geography see documnetation of all categories Description Example: <gmd:topicCategory> <gmd:MD_TopicCategoryCode> environment </gmd:MD_TopicCategoryCode> </gmd:topicCategory> Definition of dct:language Display name on opendata.swiss Languages ISO-19139_che XPath //gmd:identificationInfo//gmd:language/gmd:LanguageCode Description TODO: Is this mapping still correct? could not find any CharacterString in gmd:language Example: <gmd:language> <gmd:LanguageCode codeList= \"http://www.loc.gov/standards/iso639-2/\" codeListValue= \"ger\" /> </gmd:language> Definition of dcat:distribution See distributions documentation below Display name on opendata.swiss Resources ISO-19139_che XPath //gmd:distributionInfo/gmd:MD_Distribution[//gmd:transferOptions//gmd:CI_OnlineResource//gmd:protocol/gco:CharacterString/text() = \"WWW:DOWNLOAD-1.0-http–download\" \"OGC:WMTS-http-get-capabilities\" \"OGC:WMS-http-get-map\" \"OGDC:WMS-http-get-capabilities\" \"OGC:WFS-http-get-capabilities\" \"WWW:DOWNLOAD-URL\"] //gmd:identificationInfo//srv:containsOperations/srv:SV_OperationMetadata[.//srv:operationName//gco:CharacterString/text()] see below under \"Distributions\" Description Example: <gmd:distributionInfo> <gmd:MD_Distribution> <gmd:distributionFormat xlink:show= \"embed\" > ... </gmd:distributionFormat> <gmd:transferOptions> <gmd:MD_DigitalTransferOptions> <gmd:onLine> <gmd:CI_OnlineResource> <gmd:linkage xsi:type= \"che:PT_FreeURL_PropertyType\" > ... </gmd:linkage> <gmd:protocol> <gco:CharacterString> WWW:LINK-1.0-http--link </gco:CharacterString> </gmd:protocol> <gmd:description xsi:type= \"gmd:PT_FreeText_PropertyType\" > ... </gmd:description> <gmd:function> ... </gmd:function> </gmd:CI_OnlineResource> </gmd:onLine> </gmd:MD_DigitalTransferOptions> </gmd:transferOptions> </gmd:MD_Distribution> </gmd:distributionInfo> Definition of dct:relation Display name on opendata.swiss Further information ISO-19139_che XPath (//gmd:distributionInfo/gmd:MD_Distribution//gmd:transferOptions//gmd:CI_OnlineResource[.//gmd:protocol/gco:CharacterString/text() = \"WWW:LINK-1.0-http--link\"]//che:LocalisedURL)[position()>1] Every first link of the online resources gets put as landingPage, every additional link gets put into the relations. Description Example: <gmd:distributionInfo> <gmd:MD_Distribution> <gmd:distributionFormat xlink:show= \"embed\" > ... </gmd:distributionFormat> <gmd:transferOptions> <gmd:MD_DigitalTransferOptions> <gmd:onLine> <gmd:CI_OnlineResource> <gmd:linkage xsi:type= \"che:PT_FreeURL_PropertyType\" > ... </gmd:linkage> <gmd:protocol> <gco:CharacterString> WWW:LINK-1.0-http--link </gco:CharacterString> </gmd:protocol> <gmd:description xsi:type= \"gmd:PT_FreeText_PropertyType\" > ... </gmd:description> <gmd:function> ... </gmd:function> </gmd:CI_OnlineResource> </gmd:onLine> </gmd:MD_DigitalTransferOptions> </gmd:transferOptions> </gmd:MD_Distribution> </gmd:distributionInfo> Definition of dcat:keyword Display name on opendata.swiss Keywords of the dataset ISO-19139_che XPath //gmd:identificationInfo//gmd:descriptiveKeywords//gmd:keyword//gmd:textGroup//gmd:LocalisedCharacterString Description Example: <gmd:identificationInfo> <che:CHE_MD_DataIdentification gco:isoType= \"gmd:MD_DataIdentification\" > <gmd:citation> ... </gmd:citation> <gmd:abstract xsi:type= \"gmd:PT_FreeText_PropertyType\" > ... </gmd:abstract> <gmd:purpose xsi:type= \"gmd:PT_FreeText_PropertyType\" > ... </gmd:purpose> <gmd:status> ... </gmd:status> <gmd:pointOfContact xlink:show= \"embed\" > ... </gmd:pointOfContact> <gmd:resourceMaintenance> ... </gmd:resourceMaintenance> <gmd:descriptiveKeywords> <gmd:MD_Keywords> <gmd:keyword xsi:type= \"gmd:PT_FreeText_PropertyType\" > <gmd:PT_FreeText> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#DE\" > e-geo.ch Geoportal </gmd:LocalisedCharacterString> </gmd:textGroup> </gmd:PT_FreeText> </gmd:keyword> <gmd:type> ... </gmd:type> <gmd:thesaurusName> ... </gmd:thesaurusName> </gmd:MD_Keywords> </gmd:descriptiveKeywords> <gmd:spatialRepresentationType> ... </gmd:spatialRepresentationType> <gmd:language> ... </gmd:language> <gmd:characterSet> ... </gmd:characterSet> <gmd:topicCategory> ... </gmd:topicCategory> <gmd:extent xlink:show= \"embed\" > ... </gmd:extent> <che:basicGeodataID> ... </che:basicGeodataID> <che:basicGeodataIDType> ... </che:basicGeodataIDType> </che:CHE_MD_DataIdentification> </gmd:identificationInfo> Definition of dcat:landingPage Display name on opendata.swiss Landing page ISO-19139_che XPath //gmd:distributionInfo/gmd:MD_Distribution//gmd:transferOptions//gmd:CI_OnlineResource[.//gmd:protocol/gco:CharacterString/text() = \"WWW:LINK-1.0-http--link\"]//che:LocalisedURL Description Example: <gmd:distributionInfo> <gmd:MD_Distribution> <gmd:distributionFormat xlink:show= \"embed\" > ... </gmd:distributionFormat> <gmd:transferOptions> <gmd:MD_DigitalTransferOptions> <gmd:onLine> <gmd:CI_OnlineResource> <gmd:linkage xsi:type= \"che:PT_FreeURL_PropertyType\" > ... </gmd:linkage> <gmd:protocol> <gco:CharacterString> WWW:LINK-1.0-http--link </gco:CharacterString> </gmd:protocol> <gmd:description xsi:type= \"gmd:PT_FreeText_PropertyType\" > ... </gmd:description> <gmd:function> ... </gmd:function> </gmd:CI_OnlineResource> </gmd:onLine> </gmd:MD_DigitalTransferOptions> </gmd:transferOptions> </gmd:MD_Distribution> </gmd:distributionInfo> Definition of dct:spatial Display name on opendata.swiss Currently not implemented ISO-19139_che XPath - Description Definition of dct:coverage Display name on opendata.swiss Currently not implemented ISO-19139_che XPath - Description Definition of dct:temporal Display name on opendata.swiss Temporal coverage ISO-19139_che XPath //gmd:identificationInfo//gmd:extent//gmd:temporalElement//gml:TimePeriod/gml:beginPosition //gmd:identificationInfo//gmd:extent//gmd:temporalElement//gml:TimePeriod/gml:endPosition Description TODO: Example missing Example: missing Definition of dct:accrualPeriodicity Display name on opendata.swiss Update interval ISO-19139_che XPath //gmd:identificationInfo//che:CHE_MD_MaintenanceInformation/gmd:maintenanceAndUpdateFrequency/gmd:MD_MaintenanceFrequencyCode/@codeListValue continual => http://purl.org/cld/freq/continuous daily => http://purl.org/cld/freq/daily weekly => http://purl.org/cld/freq/weekly fortnightly => http://purl.org/cld/freq/biweekly monthly => http://purl.org/cld/freq/monthly quarterly => http://purl.org/cld/freq/quarterly biannually =>http://purl.org/cld/freq/semiannual annually => http://purl.org/cld/freq/annual asNeeded => http://purl.org/cld/freq/completelyIrregular irregular => http://purl.org/cld/freq/completelyIrregular notPlanned => http://purl.org/cld/freq/completelyIrregular unknown => http://purl.org/cld/freq/completelyIrregular Description Example: <gmd:identificationInfo> <che:CHE_MD_DataIdentification gco:isoType= \"gmd:MD_DataIdentification\" > <gmd:citation> ... </gmd:citation> <gmd:abstract xsi:type= \"gmd:PT_FreeText_PropertyType\" > ... </gmd:abstract> <gmd:purpose xsi:type= \"gmd:PT_FreeText_PropertyType\" > ... </gmd:purpose> <gmd:status> ... </gmd:status> <gmd:pointOfContact xlink:show= \"embed\" > ... </gmd:pointOfContact> <gmd:resourceMaintenance> <che:CHE_MD_MaintenanceInformation gco:isoType= \"gmd:MD_MaintenanceInformation\" > <gmd:maintenanceAndUpdateFrequency> <gmd:MD_MaintenanceFrequencyCode codeList= \"http://standards.iso.org/ittf/PubliclyAvailableStandards/ISO_19139_Schemas/resources/codelist/ML_gmxCodelists.xml#MD_MaintenanceFrequencyCode\" codeListValue= \"userDefined\" /> </gmd:maintenanceAndUpdateFrequency> <gmd:userDefinedMaintenanceFrequency> ... </gmd:userDefinedMaintenanceFrequency> <che:appraisal> ... </che:appraisal> </che:CHE_MD_MaintenanceInformation> </gmd:resourceMaintenance> <gmd:descriptiveKeywords> ... </gmd:descriptiveKeywords> <gmd:spatialRepresentationType> ... </gmd:spatialRepresentationType> <gmd:language> ... </gmd:language> <gmd:characterSet> ... </gmd:characterSet> <gmd:topicCategory> ... </gmd:topicCategory> <gmd:extent xlink:show= \"embed\" > ... </gmd:extent> <che:basicGeodataID> ... </che:basicGeodataID> <che:basicGeodataIDType> ... </che:basicGeodataIDType> </che:CHE_MD_DataIdentification> </gmd:identificationInfo> Definition of rdfs:seeAlso Display name on opendata.swiss currently not implemented ISO-19139_che XPath - Description Distributions Definition of dct:title Display name on opendata.swiss Pagetitle ISO-19139_che XPath For geodata: derived from protocol(//gmd:transferOptions//gmd:CI_OnlineResource//gmd:protocol/gco:CharacterString) and name (.//gmd:distributionInfo//gmd:transferOptions/gmd:name) In geoservices: .//srv:operationName/gco:CharacterString Description Example: <gmd:transferOptions> <gmd:MD_DigitalTransferOptions> <gmd:onLine> <gmd:CI_OnlineResource> <gmd:linkage xsi:type= \"che:PT_FreeURL_PropertyType\" > ... </gmd:linkage> <gmd:protocol> <gco:CharacterString> WWW:LINK-1.0-http--link </gco:CharacterString> </gmd:protocol> <gmd:description xsi:type= \"gmd:PT_FreeText_PropertyType\" > ... </gmd:description> <gmd:function> ... </gmd:function> </gmd:CI_OnlineResource> </gmd:onLine> </gmd:MD_DigitalTransferOptions> </gmd:transferOptions> Definition of dct:description Display name on opendata.swiss Description ISO-19139_che XPath .//gmd:transferOptions//gmd:CI_OnlineResource//gmd:description//gmd:LocalisedCharacterString In geoservices: Description of dataset Description Example: <gmd:description xsi:type= \"gmd:PT_FreeText_PropertyType\" > <gco:CharacterString> Download Server von geo.admin.ch </gco:CharacterString> <gmd:PT_FreeText> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#DE\" > Download Server von geo.admin.ch </gmd:LocalisedCharacterString> </gmd:textGroup> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#FR\" > Serveur de téléchargement de geo.admin.ch </gmd:LocalisedCharacterString> </gmd:textGroup> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#EN\" > Download server from geo.admin.ch </gmd:LocalisedCharacterString> </gmd:textGroup> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#IT\" > Server di download di geo.admin.ch </gmd:LocalisedCharacterString> </gmd:textGroup> </gmd:PT_FreeText> </gmd:description> Definition of dct:language Display name on opendata.swiss Languages ISO-19139_che XPath Locales from .//gmd:transferOptions//gmd:CI_OnlineResource//che:LocalisedURL Description Example: <gmd:CI_OnlineResource> <gmd:linkage xsi:type= \"che:PT_FreeURL_PropertyType\" > <gmd:URL> ... </gmd:URL> <che:PT_FreeURL> <che:URLGroup> <che:LocalisedURL locale= \"#EN\" > https://www.bafu.admin.ch/bafu/en/home/office/divisions-sections/noise-and-nir-division.html </che:LocalisedURL> </che:URLGroup> </che:PT_FreeURL> </gmd:linkage> <gmd:protocol> ... </gmd:protocol> </gmd:CI_OnlineResource> Definition of dct:issued Display name on opendata.swiss - ISO-19139_che XPath issued from dataset Description Definition of dct:modified Display name on opendata.swiss - ISO-19139_che XPath modified from dataset Description Definition of dcat:accessURL Display name on opendata.swiss Access URL ISO-19139_che XPath .//gmd:transferOptions//gmd:CI_OnlineResource[.//gmd:protocol/gco:CharacterString/text() = \"OGC:WMTS-http-get-capabilities\"]//che:LocalisedURL .//gmd:transferOptions//gmd:CI_OnlineResource[.//gmd:protocol/gco:CharacterString/text() = \"OGC:WMS-http-get-map\"]//che:LocalisedURL .//gmd:transferOptions//gmd:CI_OnlineResource[.//gmd:protocol/gco:CharacterString/text() = \"OGC:WMS-http-get-capabilities\"]//che:LocalisedURL .//gmd:transferOptions//gmd:CI_OnlineResource[.//gmd:protocol/gco:CharacterString/text() = \"OGC:WFS-http-get-capabilities\"]//che:LocalisedURL .//gmd:transferOptions//gmd:CI_OnlineResource[.//gmd:protocol/gco:CharacterString/text() = \"CHTOPO:specialised-geoportal\"]//che:LocalisedURL .//gmd:transferOptions//gmd:CI_OnlineResource[.//gmd:protocol/gco:CharacterString/text() = \"WWW:LINK-1.0-http–link\"]//che:LocalisedURL .//gmd:transferOptions//gmd:CI_OnlineResource[.//gmd:protocol/gco:CharacterString/text() = \"WWW:DOWNLOAD-1.0-http--download\"]//che:LocalisedURL .//gmd:transferOptions//gmd:CI_OnlineResource[.//gmd:protocol/gco:CharacterString/text() = \"WWW:DOWNLOAD-URL\"]//che:LocalisedURL .//srv:connectPoint//gmd:linkage//che:LocalisedURL Description Example: <gmd:CI_OnlineResource> <gmd:linkage xsi:type= \"che:PT_FreeURL_PropertyType\" > <gmd:URL> ... </gmd:URL> <che:PT_FreeURL> <che:URLGroup> <che:LocalisedURL locale= \"#EN\" > https://www.bafu.admin.ch/bafu/en/home/office/divisions-sections/noise-and-nir-division.html </che:LocalisedURL> </che:URLGroup> </che:PT_FreeURL> </gmd:linkage> <gmd:protocol> ... </gmd:protocol> </gmd:CI_OnlineResource> Definition of dct:rights Display name on opendata.swiss Terms of use ISO-19139_che XPath The first one in the following order: //gmd:resourceConstraints//gmd:otherConstraints//gmd:LocalicedCharacterString //gmd:linkage//che:LocalisedURL This applies to texts in DE and FR: NonCommercialAllowed-CommercialAllowed-ReferenceNotRequired Freie Nutzung Utilisation libre NonCommercialAllowed-CommercialAllowed-ReferenceRequired Freie Nutzung. Quellenangabe ist Pflicht. Utilisation libre. Obligation d'indiquer la source. NonCommercialAllowed-CommercialWithPermission-ReferenceNotRequired Freie Nutzung. Kommerzielle Nutzung nur mit Bewilligung des Datenlieferanten zulässig. Utilisation libre. Utilisation à des fins commerciales uniquement avec l'autorisation du fournisseur des données. NonCommercialAllowed-CommercialWithPermission-ReferenceRequired Freie Nutzung. Quellenangabe ist Pflicht. Kommerzielle Nutzung nur mit Bewilligung des Datenlieferanten zulässig. Utilisation libre. Obligation d'indiquer la source. Utilisation commerciale uniquement avec l'autorisation du fournisseur des données. Description Example: <gmd:otherConstraints xsi:type= \"gmd:PT_FreeText_PropertyType\" > <gco:CharacterString> Freie Nutzung </gco:CharacterString> <gmd:PT_FreeText> <gmd:textGroup> <gmd:LocalisedCharacterString locale= \"#DE\" > Freie Nutzung </gmd:LocalisedCharacterString> </gmd:textGroup> </gmd:PT_FreeText> </gmd:otherConstraints> Definition of dct:license Display name on opendata.swiss Currently not implemented ISO-19139_che XPath - Description Definition of dct:identifier Display name on opendata.swiss Currently not implemented ISO-19139_che XPath - Description Definition of dcat:downloadURL Display name on opendata.swiss Download ISO-19139_che XPath .//gmd:transferOptions//gmd:CI_OnlineResource[.//gmd:protocol/gco:CharacterString/text()[contains(.,\"WWW:DOWNLOAD\")]]//che:LocalisedURL Description Example: <gmd:CI_OnlineResource> <gmd:linkage xsi:type= \"che:PT_FreeURL_PropertyType\" > <che:PT_FreeURL> <che:URLGroup> <che:LocalisedURL locale= \"#DE\" > http://data.geo.admin.ch/ch.blw.klimaeignung-kulturland/data.zip </che:LocalisedURL> </che:URLGroup> </che:PT_FreeURL> </gmd:linkage> <gmd:protocol> <gco:CharacterString> WWW:DOWNLOAD-URL </gco:CharacterString> </gmd:protocol> <gmd:description xsi:type= \"gmd:PT_FreeText_PropertyType\" > ... </gmd:description> <gmd:function> ... </gmd:function> </gmd:CI_OnlineResource> Definition of dcat:byteSize Display name on opendata.swiss Currently not implemented ISO-19139_che XPath - Description Definition of dcat:mediaType Display name on opendata.swiss Format ISO-19139_che XPath .//gmd:distributionInfo//gmd:distributionFormat//gmd:name/gco:CharacterString //gmd:identificationInfo//srv:serviceType/gco:LocalName Description Example: <gmd:distributionFormat xlink:show= \"embed\" > <gmd:MD_Format> <gmd:name> <gco:CharacterString> GeoTIFF </gco:CharacterString> </gmd:name> <gmd:version> ... </gmd:version> </gmd:MD_Format> </gmd:distributionFormat> Definition of dct:format Display name on opendata.swiss Currently not implemented ISO-19139_che XPath - Description Definition of dct:coverage Display name on opendata.swiss Currently not implemented ISO-19139_che XPath - Description","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/iso-19139-che-dcat.html"},{"title":"Mapping ISO-19139_che to DCAT-AP Switzerland","text":"Questo articolo è disponibile in inglese .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/iso-19139-che-dcat.html"},{"title":"Advanced Search","text":"Dieses Dokument ist derzeit nur in englischer Sprache verfügbar .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/advanced-search.html"},{"title":"Advanced Search","text":"Advanced search Technical background opendata.swiss has a very powerful search engine, that can help you to find exactly the datasets you want. The search is provided by the open source component Apache Lucene/Solr . Every dataset is indexed by Solr when it gets updated, and if you perform a search on the portal, this index is queried to efficiently deliver results. The search index is basically the \"database\" where all the information for the search is saved. It uses a custom schema with all the dataset fields that should be indexed. The schema is flat, i.e. nested elements like resources must be saved differently, in order for Solr to index them. The same applies to the multilingual fields, which are all stored with the language suffix, e.g. keywords_en contains the English keywords. By default, all the fields that belong to a dataset are copied in one field (called \"text\" ), so that the search process only has to check one field to find a match. So if a user submits a search with the query \"weather\", Solr runs this query against the \"text\" field of all datasets. Search Index The search index contains the following fields: URLs: url ckan_url download_url res_url Text-fields: extras_* res_extras_* urls name title title_string text license notes tags groups organization res_name res_format res_description identifier see_alsos maintainer author publishers * contact_points Translated fields: title keywords groups organization res_name res_description Find more detailed information about the Solr configuration in the official Solr documentation . The config and schema of opendata.swiss is available on GitHub: solrconfig.xml schema.xml The source of the referenced files in the solr.xml (e.g. italian_stop.txt , fr_elision.txt , etc.) can be found in the official CKAN-Repository of the current CKAN-Version on Github . All other files (e.g. stopwords.txt ) are provided by Solr. Query syntax Solr has its own query syntax to write complex queries. Depending on the query, Solr uses a different query parser to determine what to do. Search operators Use + {field} : {value} to include a search term, e.g. +title_en:power to find all datasets, whose English title contains the word \"power\" Use - {field} : {value} to exclude a search term, e.g. +title_en:power -title_en:hydraulic to find all datasets, whose English title contains the word \"power\", but not \"hydraulic\" Use AND to combine several search terms that all must match, e.g. keywords_en:(geology AND geophysics) tp find all datasets that have both tags geology and geophysics Use OR to combine several search terms, where one of them must match, e.g. organization:(kanton-thurgau OR stadt-zurich) All of these options can be further combined together, e.g. organization:(kanton-thurgau OR stadt-zurich) karte Searchterm suggestions The search-field of opendata.swiss provides searchterm-suggestions when a user types into it. For each language a self-contained Solr index is built multiple times throughout the day. That means that changes to datasets or new data won't be reflected in the suggestions immediately. The index is based on the following fields: dataset-title (translated) keywords (translated) groups (translated) organization (translated) distribution-name (translated) author maintainer contact_points publishers identifier distribution-format","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/advanced-search.html"},{"title":"Advanced Search","text":"Questo articolo è disponibile in inglese .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/advanced-search.html"},{"title":"Leitfaden - Open Government Data für Geodaten","text":"Vermehrt werden Daten öffentlicher Institutionen als Open Government Data (OGD) zugänglich gemacht. Auch in der Schweiz hat der Bundesrat eine OGD-Strategie beschlossen und das OGD-Portal opendata.swiss ist in Betrieb gegangen. Ziel dieses Leitfadens ist es, Verantwortlichen für Geodaten bei Behörden aller föderalen Stufen den Weg der Publikation auf opendata.swiss aufzuzeigen, die erforderlichen Entscheide und deren Konsequenzen zu beschreiben. Open Data bedeutet im Idealfall die Veröffentlichung zur freien Nutzung, Modifikation und Weitergabe zu jedem Zweck. Dies bedingt Muss-Anforderungen (z.B. maschinenlesbar) und die Möglichkeit, Einschränkungen zu definieren (z.B. Pflicht zur Quel enangabe). Bei OGD gelten entsprechende Nutzungsbedingungen („Lizenzen\" basieren auf Privatrecht). Höhere technische Anforderungen stellt die Publikation als Linked Open Data, dafür trägt diese zum vol automatisierten Austausch und Aufbau von Wissen bei (Semantic Web).","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/geodaten-leitfaden.html"},{"title":"Guide - Open Government Data pour géodonnées","text":"This document is available in German and in French .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/geodaten-leitfaden.html"},{"title":"Guide - Open Government Data pour géodonnées","text":"Questo articolo è disponibile in tedesco e in francese .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/geodaten-leitfaden.html"},{"title":"Linked Open Data","text":"Dieses Dokument ist derzeit nur in englischer Sprache verfügbar .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/linked-open-data.html"},{"title":"Linked Open Data","text":"Today we are surrounded by vast quantities of data playing an increasingly central role in our lives, and driving the emergence of a data economy [&#94;1] . At greater quantities, we are faced with limitations in traditional methods of organizing data. To publish machine-friendly data - i.e. in structured form, not as text documents in natural language - the usual approach is to generate raw data in standardized files (e.g. spreadsheets as CSV and other data formats ), or to provide access to this data through programming interfaces ( APIs ). While these go a long way to help make data available and accessible for knowledge sharing, there is space for improvement in facilitating data reuse, such as: Comprehensibility : provide better descriptions of data and underlying models or schema Accessibility and share-ability : simplify access, therefore also facilitate distribution of up-to-date data Integration : facilitate the combination of data from different sources into a common point of access This document describes an approach known as Linked Data , which responds to these needs. Linking the Web of Data The World Wide Web has radically altered the way we share knowledge, by lowering barriers to publishing and accessing linked documents inside of a global information space [&#94;2] . Linked Data provides a publishing paradigm in which not only documents, but data itself is a \"first class citizen\" of the Web (Scott, 2006), extending the Web with a global data space based on open standards - also known as the Web of Data . In summary, Linked Data is about publishing data on top of the Web, and promoting links between data from different sources, through production of human- and machine-readable documents. Linked Data is a term used to describe a set of recommended best practices for exposing, sharing, and connecting pieces of data, information, and knowledge on the Web's HyperText Transfer Protocol (HTTP), using Universal Resource Identifier (URIs) to identify things and describe them using a data model called the Resource Description Framework (RDF). Tim Berners-Lee, inventor of the Web, laid down four design principles of Linked Data , providing a recipe for publishing and connecting data using Web infrastructure, while adhering to its fundamental architecture and standards: Use URIs to name (identify) things. For instance http://dbpedia.org/resource/Switzerland was chosen to identify the country Switzerland in a data source called DBPedia . The well established Domain Names System (DNS) ensures that this key is unique worldwide. Use HTTP URIs so that things can be looked up (interpreted, \"dereferenced\"). Retrieving a representation of a resource identified by a URI is known as dereferencing that URI. By choosing an URL as the key for the resource (a URL is an HTTP URI), we can follow the link to get information about that resource. For a user, it means that by clicking on a URL - e.g. http://dbpedia.org/resource/Switzerland - she will directly access the information rendered by a Web browser. Using the same underlying technology, a computer program could access structured information, so that the Web works as one database. Provide useful information about what a name identifies when it is looked up using open standards When you open that page in a browser (by dereferencing the URI), all the data presented to you comes from the underlying RDF data that is rendered here as standard HTML. If you want to have a closer look at that RDF data, you can access it through http://dbpedia.org/data/Switzerland . Refer to other things using their HTTP URI-based names when publishing data on the Web. On Switzerland page of the DBPedia web site, you will find some related data from other data sources. For instance, look for the geodata:Suisse string, and click on it. You will be directed to the page of the same entity, Switzerland, on another well known Linked Data source: GeoNames . Thanks to the use of universal identifiers, these two different data sources were able to link their data. An end-user can now find a broad range of information about Switzerland in either of those sources. Explanation Be aware that those Web resources identified by dereferenceable URIs are not meant to be directly viewed by end-users, but really serve as a distributed data base from which software developers may create richer applications and functions, with user-friendly interfaces. RDF is a data model where each piece of information is a simple sentence made of three parts: a subject, a relation (or predicate), and an object, hence the name of triple . The relation is what allows the creation of connections amongst data (subjects and objects), in other words to link the data . With RDF a new kind of data base was created to store RDF triples, commonly called a triple store . To query the triples stored in a triple store, a query language was developed: SPARQL . All of those new technologies are defined by W3C standards and will be described in more details further on. Advantages Linked Data is shareable, extensible, and easily re-usable. It supports multilingual functionality for data and user services, such as the labeling of concepts identified by URIs. By using globally unique identifiers to designate works, places, people, events, subjects, and other objects or concepts of interest, resources can be referenced across a broad range of sources and thus make integration of different information much more feasible. Linked Data aims to break information out of silos where they are locked to specific data collections and formats, and makes data integration and data mining over complex data easier. Such technologies allow for easier updates and extensions to data models - as well as potential to infer new knowledge out of collections of facts. 5-star Deployment System for Open Data Tim Berners-Lee proposed a rating system for Open Data as shown in Figure 1. To get the maximum five stars, data must (1) be available on the Web under an open license, (2) be in the form of structured data, (3) be in a non-proprietary file format, (4) use URIs as its identifiers, (5) include links to other data sources. In the specific context of open data, Linked Open Data is given a 5 stars rating. Figure 1. 5-Star Deployment Scheme for Open Data (source: 5stardata.info ) Costs and Benefits As a consumer As a publisher ★ make your content available on the Web (whatever format) under an open license ✔ You can look at it. ✔ You can print it. ✔ You can store it locally (on your hard disk or on an USB stick). ✔ You can enter the data into any other system. ✔ You can change the data as you wish. ✔ You can share the data with anyone you like ✔ It's simple to publish. ✔ You do not have to explain repeatedly to others that they can use your data. ★ ★ make it available as structured data (e.g., Excel instead of image scan of a table) All you can do with ★ Web data and additionally: ✔ You can directly process it with proprietary software to aggregate it, perform calculations, visualise it, etc. ✔ You can export it into another (structured) format. ✔ It's still simple to publish. ★ ★ ★ make it available in a non-proprietary open format (e.g., CSV as well as of Excel) All you can do with ★★ Web data and additionally: ✔ You can manipulate the data in any way you like, without the need to own any proprietary software package. You might need converters or plug-ins to export the data from the proprietary format. ✔ It's still rather simple to publish. ★ ★ ★ ★ use URIs to denote things, so that people can point at your stuff All you can do with ★★★ Web data and additionally: ✔ You can link to it from any other place (on the Web or locally). ✔ You can bookmark it. ✔ You can reuse parts of the data. ✔ You may be able to reuse existing tools and libraries, even if they only understand parts of the pattern the publisher used. Understanding the structure of an RDF \"Graph\" of data can require more effort than tabular (Excel/CSV) or tree (XML/JSON) data. ✔ You can combine the data safely with other data. URIs are a global scheme so if two things have the same URI then it's intentional, and if so that's well on it's way to being 5-star data! ✔ You have fine-granular control over the data items and can optimise their access (load balancing, caching, etc.) ✔ Other data publishers can now link into your data, promoting it to 5 star! You typically invest some time slicing and dicing your data. You'll need to assign URIs to data items and think about how to represent the data. You need to either find existing patterns to reuse or create your own. ★ ★ ★ ★ ★ link your data to other data to provide context All you can do with ★★★★ Web data and additionally: ✔ You can discover more (related) data while consuming the data. ✔ You can directly learn about the data schema. You now have to deal with broken data links, just like 404 errors in web pages. Presenting data from an arbitrary link as fact is as risky as letting people include content from any website in your pages. Caution, trust and common sense are all still necessary. ✔ You make your data discoverable. ✔ You increase the value of your data. ✔ Your own organisation will gain the same benefits from the links as the consumers. You'll need to invest resources to link your data to other data on the Web. You may need to repair broken or incorrect links. Use case: libraries As an example, the final report of the W3C sample applications of Linked Data in library environment explains some of the advantages of Linked Open Data in this more specific context. 1. Richer data, better data integration and reuse Libraries assets will benefit from descriptions of a higher level of granularity, without requiring more investment. Linked Data enables different kinds of data about the same asset to be produced in a decentralized way by different actors. This is an alternative from the traditional approach where libraries have to produce stand-alone descriptions (as MARC records for instance). As a result data quality will be improved and this will help in the reduction of redundancy of metadata. This is made possible by the use of Web-based identifiers which will also help in different areas, as facilitating navigation across library and non-library information resources, making up-to-date resource descriptions directly citable by catalogers, or enhance citation management software for instance. 2. Improved search possibilities and SEO Information seekers benefit from improved federated search in new search applications, but also in existing search engines. Searching services will be richer, and libraries will improve their visibility through search engine optimization (SEO). 3. Long-lived meta-data The history of information technology shows that specific data formats are ephemeral. Linked Data do not rely on a particular data structure and is thus more durable and robust than other metadata formats bound to a specific format. 4. Easier data access Linked Data being published in the Web, accessing Linked Data is done in a uniform and trivial way consisting of HTTP requests. Data consumers do not need to learn different APIs or library-centric protocols. 5. Beneficiaries Those benefits are presented for different actors of the library environment regrouped in four categories: researchers, students, and patrons organizations librarians, archivists, and curators developers and vendors Implementation This section describes how the Linked Data approach could be implemented in the domain of Swiss Open Government Data. The proposed 10 steps are based on the W3C Best Practices for Publishing Linked Data document, adapted to the opendata.swiss context. Only the methodological guidelines of each step are presented here. For further details, please refer to the original document. First steps 1. Prepare Stakeholders The first step to successfully create a Linked Open Data publishing process starts by explaining to stakeholders the conceptual Linked Data approach and the main technical differences compared to other Open Data publication solutions (the 5 stars Open Data is a good resource here). Then a data modeling life cycle can be designed based on the following steps presented here or adapting existing workflows. 2. Select a Dataset In the public administration context, the first barrier to publish data as \"open data\" is to have a legal basis allowing it. We thus propose to start with an already published dataset for which the legal basis question is already solved. It could be either: An Excel document that is already made available on one of the web pages of your organization A database whose content is already available through a website, meaning that its content can be searched by a user but not by a machine (lack of API) Data sets published in reports (tables) that could have an added value to be published as row data on the web. Open Data not yet published: this would be a rare but very valuable case, where a newly open dataset is not published in any form yet Moreover, preference can be given to: Data based on international or national standards ( eCH standards , for instance) Popular data or data with a high re-use potential Data that can be easily combined with other open data, and thus provide greater value 3. Model the Data The particularity of Linked Data modeling is that it consists of a transformation: from the original data (relational database, CSV files, etc.) to the RDF model. Defining this target data model is the objective of this step. This can be only achieved by bringing together domain-specific competencies hold by the data owner and linked data competencies that must usually be hired somewhere else. The domain expert will explain the objects and their relationship (local relationship but also relationships to other data sources) as well as the standard vocabularies of the domain. The linked data expert will then look for existing RDF versions of those vocabularies (aka ontologies), and eventually define a new RDF vocabulary if needed. 4. Specify appropriate terms of use and legal basis The appropriate terms of use and legal basis should be explicitly defined along with the dataset, in accordance with the model defined in Terms of use for OpenData.swiss. 5. The Role of \"Good URIs\" for Linked Data URIs are at the core of the Linked Data architecture, as they provide world wide identifiers that promote a large scale \"network effects\". They identify the vocabularies (ontologies), the datasets themselves, the objects (resources) they contains as well as their relationships. The original document from W3C provides useful guidelines about: URI Design Principles Provide dereferenceable HTTP URIs (URL) that serve as machine-readable representation of the identified resource. Define a URI structure that will last as long as possible by not containing anything that could change. URI Policy for Persistence Define a persistent URI policy and implementation plan, which relies on the commitment from the URI owner. URI Construction Includes guidance coming from URI strategies applied successful by different organizations Internationalized Resource Identifiers (IRI) If necessary, the use of Unicode characters (non-ASCII characters) is possible as long as it follows existing standards. To clarify the notion of URL, URI and IRI: Figure 2. A URL is a specific kind of URI, a URI is a specific kind of IRI A URL is a specific kind of URI that is also a location as it is an HTTP URI and can be looked-up on the Web. In comparison, a URN is a Uniform Resource Name as an ISBN code for example. For more details about how to design persistent URIs, please refer to the original URI Construction section which cites references to different documents. We would like to point out that the Study on persistent URIs is a nice Web representation of the very complete 10 Rules for Persistent URIs , which is the result of a survey done by the SEMIC working group for the European Commission. 6. Standard Vocabularies To facilitate the reuse of the data, reuse of standard vocabularies is a key factor as end-users will need to understand a dataset's structure to quickly comprehend and assess it. Standard vocabularies for Linked Data have been developed, validated and made available, as for instance: data catalogs organizations multidimensional data Existing vocabularies can be found using search tools ( Falcons , Watson , Swoogle ) or directories ( LOV , the European Commission's Joinup platform , or domain specific portals as the Bioportal for the biological domain as an example). To evaluate a vocabulary, take into account if that vocabulary is published by a trusted group, is well documented and self-descriptive, is used by other datasets, has persistent URIs and is accessible for a long period, and if its provides a versioning policy. If there is a need for a new vocabulary we recommend to contact an ontology expert to fulfill this task properly. 7. Convert Data to Linked Data Once all the former preparation steps have been carried out, it is possible to perform the data conversion from the original format to Linked Data (RDF triples). There are many ways to do this using existing tools available for that mapping operation, see the W3C list for instance. The Linked Data expert will know which tool to use for the purpose and, if needed, will create a new one. This step should include the generation of metadata for that datasets (see the official documentation about DCAT-AP for Switzerland ), and also the links to other datasets, as for instance DBPedia (the Linked Data version of Wikipedia), to make the new dataset part of the Linked Data Cloud . 8. Provide Machine Access to Data Different methods can be used to provide data access for machines, as: Direct URI resolution a RESTful API , a SPARQL endpoint via file download The SPARQL Protocol and RDF Query Language (SPARQL) is the standard query language for RDF. The current version, SPARQL 1.1, is defined by a W3C recommandation . It is common practice for Linked Data to provide a service that accepts SPARQL queries: a SPARQL endpoint. The endpoint returns data in the requested format as XML or JSON for instance. We give further information about this in the technical section . 9. Announce to the Public One straight-forward channel for announcing the availability of a new dataset in Linked Data is to publish a reference to it on opendata.swiss. 10. Social Contract of a Linked Data Publisher Linked Data publishers implicitly promise to guarantee the published datasets availability according to the predefined URI strategy, as if signing a \"social contract\" with the end-users. This should be done in order to prevent third party applications to break when encountering an HTTP 404 \"Not Found\" error while accessing the data. Technical information The technical structure underlying the principles of Linked Data are often illustrated in the form of this \"layercake\": Figure 3. The layer cake for RDF technologies (Source: w3.org ) This model has evolved through time, as the standards and tools were further developed and tested. Here follows an introduction to the main technical bricks (highlighted in red here above): unambiguous names for resources (for everything): IRIs (URIs, URLs) a common data model to describe the resources: RDF schema for the data based on RDF (common vocabularies, ontologies): RDFS, OWL, SKOS a query language for RDF: SPARQL reasoning logic: OWL, Rules (RIF) Resource Description Framework (RDF) Linked Data is based on the Resource Description Framework (RDF, a W3C standard ), a framework to represent information in the Web, expressing information about any resource (people, things, anything). RDF is a data model for \"things\" (resources) and their \"relations\", where each piece of information is an RDF Statement (or RDF Triple) of the following structure: <subject> <predicate> <object> Such a statement composed of three elements describes how a resource (the subject ) is linked by a property (the predicate ) to another resource or a value (the object ) Example of triples: <Eduard> <has-parent> <Albert> <Albert> <has-spouse> <Mileva> <Eduard> <birth-date> \"1910-07-28\" Each triple can be represented visually as for instance: Figure 4. RDF triple As we can see, an RDF triple forms a graph where the subjects and objects make up the nodes and the predicates form the arcs. Here is a visual representation of the few triples here above: Figure 5. RDF Graph RDF data, and thus Linked Data, form a Graph Database, which is different from the more common Relational or Hierarchical Databases: Figure 6. Three different types of databases (Source: linkeddatatools.com ) So where do IRIs, the foundation of the layercake, come into play ? Everywhere! Everything is identified by a URL (a specific form of IRI), except literal values, as \"1910-07-28\" in our running example. We did not mention any URL in the former presentations to make things simple and more readable. Each resource is a URL, for example: <Albert> -> <http://dbpedia.org/resource/Albert_Einstein> <Eduard> -> <http://dbpedia.org/resource/Eduard_Einstein> Each property is also a resource, and so: <has-parent> -> <http://dbpedia.org/ontology/parent> <has-spouse> -> <http://dbpedia.org/ontology/spouse> Here is the real RDF graph, with fully qualified URIs: Figure 7. RDF graph with fully qualified URIs RDF documents There exist different specifications to write a RDF Graph (i.e. RDF Triples) to a file. This process is called \"serialization\" and the RDF 1.1 Primer gives the following list: TURTLE and TRIG JSON-LD (JSON based) RDFa (for HTML embedding) N-Triples and N-Quads (line-based exchange formats) RDF/XML (the original 2004 syntax, updated for RDF 1.1) The most common ones in 2016 are: Turtle to write down RDF Triples in a text file that will have a \".ttl\" extension (a format that is easily readable by a human and thus prefered to the RDF/XML version) JSON-LD to store RDF data in java objects, which is a popular and practical format for computer programmers RDFa to add RDF inside HTML pages, the RDF data being not visible to end-users but at disposal for crawlers. Turtle is a pretty simple format where each triple is written down. Our running example can be serialized in Turtle as follow: <http://dbpedia.org/resource/Eduard_Einstein> <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Albert_Einstein> . <http://dbpedia.org/resource/Albert_Einstein> <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Mileva_Mari%C4%87> . <http://dbpedia.org/resource/Eduard_Einstein> <http://dbpedia.org/property/birthDate> \"1910-07-28\"&#94;&#94;<http://www.w3.org/2001/XMLSchema#date> . In practice, some syntaxe shortcuts will be used and the final document will rather look like: @ prefix dbo : < http :// dbpedia . org / ontology /> @ prefix dbp : < http :// dbpedia . org / property /> @ prefix dbr : < http :// dbpedia . org / resource /> @ prefix xsd : < http :// www . w3 . org / 2001 / XMLSchema # > dbr : Eduard_Einstein dbo : parent dbr : Albert_Einstein ; dbp : birthDate \"1910-07-28\" &#94;&#94; xsd : date . dbr : Albert_Einstein dbo : spouse dbr : Mileva_Mari % C4 % 87 . Ontologies, RDFs and OWL RDF was designed to represent data in a machine-friendly way, but we are still missing an important part of Information Modeling: a Data Model or Schema. In term of Linked Data and RDF, the data model is called a \"vocabulary\" or \"ontology\". For that purpose, RDF has been extended by RDFSchema (RDFs) and the Ontology Web Language (OWL) . This is also where semantics is added to RDF. RDFs allows to define Classes and Properties. Classes are used to group similar resources together by giving one or more types to a resource. In our example above, Albert, Eduard and Mileva are instances of a class Person. RDFs can be used to add some semantics to the property \"spouse\" for instance, by saying that the object and subject of this property are instances of the class Person. This information could serve for further checking or reasoning. OWL goes one step further to define logical axioms and rules that can be further used by an inference engine to deduce new facts out of implicit knowledge. As a simple example, the \"spouse\" property can be defined as \"symmetric\", in which case an inference engine would deduce from the triple <Albert> <has-spouse> <Milena> a new triple <Milena> <has-spouse> <Albert> . Without that inference, querying for the spouse of Milena would give no result. The RDF data model is thus a common language for the schema and the data as well. Data Access - Triple store and SPARQL As described in the W3C's \"Best Practices for Publishing Linked Data\", there are different ways to provide machine access to data, and thus different ways for a end-user to access the data. We will conclude with our example by showing how an end-user can access or query that data which comes from the DBPedia site. Direct URI resolution: Any of the mentioned resources can be dereferenced by simply accessing the following URLs: http://dbpedia.org/resource/Albert_Einstein http://dbpedia.org/resource/Eduard_Einstein http://dbpedia.org/ontology/parent http://dbpedia.org/ontology/spouse File download: DBPedia datasets are available for download from wiki.dbpedia.org SPARQL endpoint: The databases for RDF are called Triple Stores, a specific kind of Graph Databases. RDF data in a triple store can be exposed for direct querying through a SPARQL endpoint. The SPARQL endpoint for DBPedia can be accessed here To give it a try, please copy/paste the following SPARQL query to ask for the spouse(s) of Albert Einstein (note that the SPARQL syntax is similar to the Turtle format), and hit the \"run query\" button to see the results: SELECT * {dbr:Albert_Einstein dbo:spouse ?spouse} Or just click here . See a list of SPARQL endpoints and their status as published by Open Knowledge. Additional resources Here are some more resources helpful to work with Linked Data. A W3C generic list of tools . Programming List of libraries for different programming languages A Semantic Web Primer for Object-Oriented Software Developers (2006): RDF Data The Linking Open Data cloud diagram RDF Converters W3C list of converters to RDF RDF Validators W3C validator SPARQL Tutorials Tutorial from Euclid Video introduction from Bob Ducharme (11 min.): Cambridge Semantics: Sparql by example A tutorial by running/completing queries, from the Coreses Project (INRIA): From SQL to SPARQL Wikidata page with examples and some prepared queries on the SPARQL endpoint UniProt SPARQL Endpoint with examples Tutorial from LinkedDataTools SPARQL Endpoints SPARQL EndPoints status W3C list (may be out of date) SPARQL validators http://sparql.org/query-validator.html http://sws.ifi.uio.no/sparqler/validator.html Triple Stores A W3C list of large triple stores Glossary W3C maintains a glossary for Linked Data . References [&#94;1] Jim Ericson. Net expectations - what a web data service economy implies for business. Information Management Magazine, Jan/Feb, 2010. [&#94;2] Tom Heath and Christian Bizer (2011) Linked Data: Evolving the Web into a Global Data Space (1st edition). Synthesis Lectures on the Semantic Web: Theory and Technology, 1:1, 1-136. Morgan & Claypool.","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/linked-open-data.html"},{"title":"Linked Open Data","text":"Questo articolo è disponibile in inglese .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/linked-open-data.html"},{"title":"Analysis of options for embedding datasets from opendata.swiss","text":"Dieses Dokument ist derzeit nur in englischer Sprache verfügbar .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/embed.html"},{"title":"Embedding datasets from opendata.swiss","text":"A range of technical options are described here for embedding content from the CKAN open data platform on third party websites. Some data publishers may like to present datasets they have published at opendata.swiss on their own website. Several of the publishing institutions even have data portals on which they may like to feature any datasets which they maintain on the central catalog, even integrating this with other information on the website. Why embed data from the portal instead of copy-pasting or just linking? In order that datasets are well presented, their descriptions accurate and up-to-date. To show a dynamic selection from the catalog, based on a tag or search query, or even to show all datasets belonging to an organization. We describe several options here - from linking to resources from the catalog, to embedding parts of the functionality from the portal on other websites. Our current recommendation at this time is to use the ckan-embed widget , which can be configured here. Widget Similar to the rich media widgets from Twitter and other websites, a script can be added to pages which loads remote content using JavaScript. It is possible to provide users with a code snippet that could be configured according to their needs. This provides a richer experience for users, but requires some technical knowledge of HTML, CSS and JavaScript. The ckan.js project from Open Knowledge is a JavaScript library that can be used to connect to CKAN from within the browser. In order to overcome Cross-origin resource sharing (CORS) restrictions, a backend service would ideally be hosted on the same machine as the scripts. This could just be a proxy to the data portal. We have developed a JavaScript widget based on ckan.js which displays the same information about datasets as the standard search. It uses the CKAN API to run search queries, and renders the result into the Web page. Our solution is similar to the CKAN Data Viewer , a feature that already has resource embedding built in, and the ability to white-list sites where this may be deployed using a resource proxy configuration option. Note that due to lack of CORS support, we provided an option to use JSONP to mitigate cross-site scripting restrictions. JSONP is not recommended in current best practices in Web development, and we advise that - if possible - developers should put in place a proxy service, as described further down . Here is an example of how a search result from opendata.swiss appears in this widget: This is made by adding the following code to the page, for example to query the portal for \"statistik\" as a search term: < div id = \"opendata-swiss\" > Loading datasets ... </ div > < script > ck . datasets ( '#opendata-swiss' , 'https://opendata.swiss/' , 'statistik' ); </ script > You may wish to link to the portal itself in the loading message, in case there are issues with connectivity or JavaScript in the browser. It is also possible to use filter queries to limit results to a specific facets - such as group ( groups:energy , for example), tags ( tags:energie ) or organization ( organization:schweizerische-nationalbibliothek-nb ). For example, this code fetches the top 3 datasets published by the National Library, linking to the german-language portal ( lang:'de' ): ck . datasets ( '#opendata-swiss' , 'https://opendata.swiss/' , { fq : 'organization:schweizerische-nationalbibliothek-nb' , lang : 'de' , rows : 3 }); In order to customize the presentation of the widget, you can use a custom template, for example like this code which fetches the most recently updated datasets: ck . datasets ( '#ckanEmbed' , 'https://opendata.swiss/de/' , { fq : ' ' , template : _ . template ( '<div class=\"ckan-dataset\">' + '<a href=\"<%= ds.url %>\"><h4 style=\"display:inline\"><%= ds.title %></h4></a>' + '<small class=\"ckan-fmt\"> (<%= ds.formats.toUpperCase() %>)</small>' + '<p><%= dso.publishers[0].label %></p>' + '</div>' ), rows : 5 }); Summary: we recommend the use of our JavaScript widget for embedding opendata.swiss datasets and search results. Full source code and deployment instructions are available on the ckan-embed project page . Cards It is possible to link directly to datasets and search results on opendata.swiss . For example: Link to a dataset: https://opendata.swiss/en/dataset/verbreitung-der-steinbockkolonien Link to a category (or group) page: https://opendata.swiss/en/group/agriculture Link to a datasets with one of the same tags: https://opendata.swiss/en/dataset?keywords_en=ibex Link to datasets from a specific organization: https://opendata.swiss/en/organization/schweizerische-nationalbibliothek-nb Link to a search result page: https://opendata.swiss/en/dataset?q=ibex Standards like the Open Graph protocol and oEmbed improve the way search engines and other machine 'users' access the platform, and also make it easy to bring in rich content from different sites through standard interfaces. Simply by pasting in the URL to a dataset on a platform with support for the protocol (like Discourse or Wordpress), visitors of your site see a \"card\" with the title and description and possibly an image of the page. If you see a plain link, then embedding is not supported or working - but visitors can still navigate to the target page. Here is an example of how a dataset renders through Open Graph support from two CKAN portals when the links are posted in a Discourse forum: This option would not allow search and other interactivity, but could provide a basis for it (further discussion in the next option). Initially, it would make it easy for content owners to use their own existing platforms to present the datasets in a nice way just by linking to the individual datasets. There are various open-source packages and libraries you can use as a developer to add support for reading Open Graph metadata in your Web project. Here are some examples: pelican-open_graph (Pelican is used in this Handbook), opengraph by erikriver , Drupal , JavaScript/Node.js , and a middleware API at Opengraph.io . Furthermore, category and search result pages could also be tagged using the same mechanisms, so third party websites get a summary view into the datasets simply by linking to the appropriate URL. For more in-depth discussion of metadata support see: Make consistent all forms of RDF output from CKAN #1890 . Summary: it is already possible to link directly to search pages and resources on opendata.swiss , however rich metadata in the page header is not yet supported. In a future release, pasting links from the portal into a Web platform that supports Web metadata protocols will enable a richer sharing experience. Until such time as Open Graph support is enabled on opendata.swiss , we recommend you to use the Widget option . Frames Using HTML IFRAMEs or EMBEDs, subsets or links from the portal can be placed directly into the page. It is actually essentially the same as if the user opens a link in a new tab, except the other web page is shown within a block on the current page, and scrolls along with the content. However, this method is not recommended due to challenges from an accessibility and usability perspective: The portal has its own page branding and navigation which, when stuck inside of an frame, will have the unintended consequence of confusing the user about what is actually being presented. It is difficult to navigate with the keyboard into an IFRAME and visitors who rely on text-to-speech will be impeded, and will not meet full accessibility requirements . Due to the security measures of the browser, no communication can happen between the sites. It is possible to track users of the IFRAME through advanced web analytics, but only on the destination site - the host site will get no data on user behavior. A possible compromise solution to the first two issues would be create an \"embed view\" template through a CKAN plugin which renders the requested page with alternative branding that is more conducive to usage in frames and reformatted content. As a workaround in case our recommended option is not possible to implement, the IFRAME source could be used with an anchor that makes the view skip directly to content. For example, a search result (with #field-order-by anchor) or to a dataset page ( #content anchor) would be embedded with code like this: <iframe width= \"100%\" height= \"600\" frameborder= \"0\" style= \"border:0;margin:0;padding:0\" src= \"https://opendata.swiss/en/dataset?q=RDF&res_format=HTML&sort=score+desc%2C+metadata_modified+desc#field-order-by\" ></iframe> Summary: we do NOT RECOMMEND or support the use of IFRAMES, for reasons of poor accessibility and usability. However, if installing JavaScript is not possible, we have shown a basic workaround above. Middleware For the JavaScript widget solution described above, it would be helpful to monitor the API calls of the proxying server to specific calls for security and performance. An intermediate service backend that uses something like the Python ckanapi client could be used to facilitate this, or a load balancing server. Open Graph support (as discussed in the Cards section) would make it possible to use a compatible client-side library (e.g.: Oembetter ). Furthermore, soon on the opendata.swiss roadmap there will be support for requesting DCAT-AP compatible RDF for any dataset. While this does not mean that the data itself is linked, it would also allow a more generic solution to displaying the metadata. Note that performance issues could potentially be compounded by availability and connectivity of the proxying server, so hosting this widget needs to be done with care. One straightforward option would be to add this functionality to CKAN itself, but there also may be reasons why platform owners may wish to separate the 'sharing' service from core functionality. Further options We investigated the possibility of supporting publishers of 'static sites', such as this handbook. The deployment of rich content could be extended with dynamic crawling and updating of content during the publication process without reliance on cross-site requests in the browser. This would however require technical effort for the specific publishing platforms, and come with the synchronicitiy issues of the Cards option - i.e. the embedded information will only be as recent as the latest publication. Such an approach is described in the govpack package . Access to regular exports from the portal's underlying database - in other words, federated or raw data access - would enable content providers to run their own mini-sites synchronised to the central port. It is currently not clear how prominently portal federation will feature on CKAN's roadmap, while third party extensions like ckanext-odn-ic2pc-sync promise this kind of functionality. For a more high level discussion of the advantages of hosting federated platforms for data discovery, see Zhang Haojie et al., 2015 . Access to the metadata of the portal itself would be a sound option for the most technical users of the open data platform. They would however most likely need to host CKAN, or at least be familiar with its schema, to make use of such data. A compromise option, such as static snapshots of the API, could be another strategy to pursue in the future. In the meantime, we recommend that opendata.swiss content is embedded externally using the JavaScript Widget .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/embed.html"},{"title":"Analysis of options for embedding datasets from opendata.swiss","text":"Questo articolo è disponibile in inglese .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/embed.html"},{"title":"Nutzung des APIs (Schnittstelle)","text":"Diese Seite ist in englischer Sprache verfügbar .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/ckan-api.html"},{"title":"Usage of the API","text":"Introduction The open data portal opendata.swiss is based on the open source project CKAN . CKAN provides an extensive API for the metadata of the open data catalogue. The API is HTTP based and uses GET and POST requests. All responses are provided as JSON. Please use the CKAN documentation for detailed information about the API . Important note about metadata: opendata.swiss uses the metadata standard DCAT-AP Switzerland . Therefore all metadata is returned using this standard. Where possible, a mapping to CKAN standard fields is provided by the API. Concepts CKAN uses internally a number of concepts, that are important to understand in order to use the API properly. Entities First of all, the following entities are used: Packages (also known as datasets): a container for metadata containing multiple resources Resource : a file or API, actual data you can use (NOTE: opendata.swiss does currently not host files, only URLs to files and APIs) Group (aslo known as categories or themes): a categorization of the datasets. A dataset may have multiple groups Organization : is a special kind of group, one dataset has exactly one owning organization Action API All API requests use the so called Action API . The URL of these requests is composed like that: https://opendata.swiss/api/{api_version}/action/{action_name} The currently used API version is 3, and a list of actions is available in the CKAN documentation . Example: https://opendata.swiss/api/3/action/group_list Authentication Most GET-able API function do not need authentication (i.e. everybody is allowed to read metadata). For all other actions POST requests are used (e.g. create new packages, update groups or delete resources), that require authentication. Please contact us if you have further questions regarding the advanced usage of the API. Examples Here are a couple of examples, how to use the API. Note the API always returns a JSON response. Find metadata of a specific dataset Datasets are called \"packages\" in the API, to list all packages, we use package_list : curl 'https://opendata.swiss/api/3/action/package_list' Here we get a list of all available datasets slugs, we can pick one, and get all metadata from it, e.g. studierende-fachhochschule-anz : curl 'https://opendata.swiss/api/3/action/package_show?id=studierende-fachhochschule-anz' Search for datasets The search functionality is provided by the API function package_search . A simple search for switzerland looks like this: curl 'https://opendata.swiss/api/3/action/package_search?q=switzerland' The search is based on Solr , and therefore provides a number of advanced parameters. To filter the search to only return results with a specific keyword ( geology ), fq (filter query) could be used: curl 'https://opendata.swiss/api/3/action/package_search?q=switzerland&fq=+keywords_en:geology'","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/ckan-api.html"},{"title":"Usage of the API","text":"Questo articolo è disponibile in inglese .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/ckan-api.html"},{"title":"Harvester","text":"Bei grösseren Mengen an Datensätzen (>= 100), können Harvester verwendet werden um die Datensätze regelmässig zu aktualisieren. Die Metadatan müssen dazu im DCAT-AP Switzerland format vorliegen. Sie müssen einen Katalog als RDF-Datei zur Verfügung stellen ( Beispiel RDF ). <rdf:RDF> <dcat:Catalog> <dcat:dataset> <dcat:Dataset> ... </dcat:Dataset> </dcat:dataset> <dcat:dataset> <dcat:Dataset> ... </dcat:Dataset> </dcat:dataset> <dcat:dataset> <dcat:Dataset> ... </dcat:Dataset> </dcat:dataset> ... </dcat:Catalog> </rdf:RDF> Der RDF XML Harvester basiert auf der CKAN-Extension ckanext-dcat . Als Datenlieferant müssen Sie einen gültigen \"catalog endpoint\" für alle Datensätze zur Verfügung stellen. Falls Sie so viele Datensätze anbieten, dass sich diese nicht mehr mit einer einzigen Anfrage holen lassen (z.B. mehr als 1'000 Datensätze), ist die Empfehlung Pagination mit dem Hydra Vocabulary zu implementieren. Beispiel: <hydra:PagedCollection rdf:about= \"http://opendata.swiss/catalog.xml?page=3\" > <hydra:lastPage> http://opendata.swiss/catalog.xml?page=4 </hydra:lastPage> <hydra:itemsPerPage rdf:datatype= \"http://www.w3.org/2001/XMLSchema#integer\" > 1000 </hydra:itemsPerPage> <hydra:totalItems rdf:datatype= \"http://www.w3.org/2001/XMLSchema#integer\" > 3479 </hydra:totalItems> <hydra:firstPage> http://opendata.swiss/catalog.xml?page=1 </hydra:firstPage> <hydra:previousPage> http://opendata.swiss/catalog.xml?page=2 </hydra:previousPage> </hydra:PagedCollection>","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/publish/harvester.html"},{"title":"Harvester","text":"All metadata must be available in the DCAT-AP Switzerland format . You must provide a catalog as an RDF file ( see the example for reference). <rdf:RDF> <dcat:Catalog> <dcat:dataset> <dcat:Dataset> ... </dcat:Dataset> </dcat:dataset> <dcat:dataset> <dcat:Dataset> ... </dcat:Dataset> </dcat:dataset> <dcat:dataset> <dcat:Dataset> ... </dcat:Dataset> </dcat:dataset> ... </dcat:Catalog> </rdf:RDF> The RDF XML harvester is based on ckanext-dcat . As a publisher you must provide a valid catalog endpoint to fetch all datasets. If the amount of datasets exeeds best practices to be fetched in one request (e.g. more than 1'000 datasets), it is recommend to implement pagination using the Hydra vocabulary . Example: <hydra:PagedCollection rdf:about= \"http://opendata.swiss/catalog.xml?page=3\" > <hydra:lastPage> http://opendata.swiss/catalog.xml?page=4 </hydra:lastPage> <hydra:itemsPerPage rdf:datatype= \"http://www.w3.org/2001/XMLSchema#integer\" > 1000 </hydra:itemsPerPage> <hydra:totalItems rdf:datatype= \"http://www.w3.org/2001/XMLSchema#integer\" > 3479 </hydra:totalItems> <hydra:firstPage> http://opendata.swiss/catalog.xml?page=1 </hydra:firstPage> <hydra:previousPage> http://opendata.swiss/catalog.xml?page=2 </hydra:previousPage> </hydra:PagedCollection>","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/publish/harvester.html"},{"title":"Harvester","text":"Questo articolo è disponibile in tedesco .","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/publish/harvester.html"},{"title":"Rechtliche Vorprüfungen","text":"Massgeblich für diese Entscheidung ist in der öffentlichen Verwaltung in aller Regel die gesetzliche Grundlage, also ein Gesetz oder die zugehörige Verordnung. Diese erlaubt die Publikation der OGD und legt allfällige Einschränkungen fest. Aus der gesetzlichen Grundlage leiten Sie anschliessend die Nutzungsbedingungen für Ihre Daten ab. Mehr dazu unter Nutzungsbedingungen auswählen . Das folgende Schema zeigt Schritt für Schritt auf, wie Sie bestimmen, ob ein Datensatz für OGD geeignet ist. Falls Sie weitergehende Erklärungen zu den einzelnen Schritten benötigen, finden Sie diese hier . Eine Übersicht über die verschiedenen für OGD relevanten rechtlichen Fragen finden Sie zudem im Konzept Rechtliche Rahmenbedingungen zur Publikation von Daten als Open Government Data (OGD)","tags":"Prepare","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/prepare/frameworks.html"},{"title":"Preliminary legal checks","text":"The following diagram explains step by step how you establish whether a dataset is suitable for OGD. Further guidance on the individual steps can be found in Decision basis - guidelines in respect to legal foundations for the publication of data as OGD . You can also find an overview of the various legal issues relevant to OGD in the concept Legal framework for the publication of data as Open Government Data (OGD) . For more information, see Choosing terms of use .","tags":"Prepare","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/prepare/frameworks.html"},{"title":"Verifiche giuridiche preliminari","text":"Nell'amministrazione pubblica fa solitamente stato la base legale, ossia una legge o una relativa ordinanza che ne consenta, con eventuali limitazioni, la pubblicazione. Le condizioni d'uso si fondano sulla base legale. Per maggiori dettagli si veda il capitolo Definizione delle condizioni d'uso . Lo schema seguente spiega passo dopo passo come stabilire se un set di dati è idoneo a essere pubblicato come OGD. Per maggiori dettagli sui singoli passi, cliccare qui . Il piano per le condizioni quadro legali per la pubblicazione di dati come OGD offre una panoramica delle questioni giuridiche rilevanti per gli OGD.","tags":"Prepare","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/prepare/frameworks.html"},{"title":"Publikationsvariante wählen","text":"Wenn Sie Ihre Daten auf opendata.swiss publizieren, können Sie zwischen vier technischen Optionen wählen. Die folgende Tabelle liefert Ihnen einen Anhaltspunkt, welche Variante für Ihre Organisation geeignet ist. Anzahl Datensätze und Aktualisierungsintervall Option für die Publikation wenig Datensätze, seltene Aktualisierung Option 1 – Metadaten manuell via Webformular erfassen mehr als 10 Datensätze, regelmässige Aktualisierung Option 2 – Metadaten via XML-Datei manuell hochladen (siehe auch DCAT-AP for Switzerland format ) grosse Anzahl Datensätze, häufige Aktualisierung Option 3 – Metadaten mit einem „Harvester\" automatisch hochladen Geodaten, die bereits oder bald auf geo.admin.ch / Bundes Geodaten-Infrastruktur (BGDI) publiziert werden. Option 4 – Metadaten via Geocat publizieren Der Prozess zur Datenpublikation hängt von der Variantenwahl ab. Bitte sprechen Sie Ihre Wahl mit dem Portal-Team ab. Dieses verfügt über das nötige Vorwissen, um gemeinsam die geeignete Option auszuwählen. Sobald Sie sich für eine Variante entschieden haben, müssen Sie die Metadaten im Standard DCAT-AP vorbereiten.","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/publish/options.html"},{"title":"Selecting your publication option","text":"Number of datasets and update frequency Option for publication small number of datasets, rarely updated Option 1 – Enter metadata manually using a web form (German) more than 10 datasets, updated regularly Option 2 – Upload metadata manually using an XML file (German), see also DCAT-AP for Switzerland format large number of datasets, updated frequently Option 3 – Upload metadata automatically using a harvester spatial data already published or soon to be published on geo.admin.ch / Federal Spatial Data Infrastructure Option 4 – Publish metadata via geocat The data publication process will depend on the option chosen. Please discuss your choice with the portal team, who will be happy to advise you on your selection. Once you have chosen your option, you must prepare the metadata in the DCAT-AP standard.","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/publish/options.html"},{"title":"Scelta dell'opzione di pubblicazione","text":"Per la pubblicazione su opendata.swiss esistono quattro varianti tecniche. La tabella seguente offre un orientamento per la scelta. Numero di set di dati e intervallo di aggiornamento Opzione per la pubblicazione Pochi set di dati, Aggiornamento sporadico Opzione 1: registrazione manuale dei metadati per mezzo del modulo web (tedesco) Più di 10 set di dati, Aggiornamento regolare Opzione 2: caricamento manuale dei metadati tramite file XML (tedesco), vedi anche DCAT-AP for Switzerland format Grande quantità di set di dati, Aggiornamento frequente Opzione 3: caricamento automatico dei metadati con un «raccoglitore» (harvester) Geodati già o presto pubblicati su geo.admin.ch, l'Infrastruttura federale di dati geografici (IFDG) Opzione 4: caricamento automatico dei metadati con geocat Il processo di pubblicazione dipende dall'opzione scelta. Prima di procedere, si prega di contattare i responsabili del portale per una consulenza. Una volta scelta l'opzione più appropriata, occorre preparare i metadati secondo lo standard DCAT-AP.","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/publish/options.html"},{"title":"Was ist Open Government Data (OGD)?","text":"Auf dem Schweizer OGD-Portal opendata.swiss finden sich unterschiedlichste Datensätze wie die Gemeindegrenzen der Schweiz, Bevölkerungsstatistiken, aktuelle Wetterdaten, historische Dokumente oder ein Verzeichnis der Schweizer Literatur. Häufig werden die Daten als gesamte Datensätze zur Verfügung gestellt, die anschliessend durch die Nutzerinnen und Nutzer visualisiert, weiterverarbeitet oder kombiniert werden können. So entstehen Anwendungen und Visualisierungen, die auf Basis bereits bestehender Daten neue Zusammenhänge sichtbar machen. Viele Daten stehen bereits heute kostenlos zur Verfügung, nur sind sie nicht als OGD gekennzeichnet. Für die Publikation auf opendata.swiss eigenen sich diese Datensätze besonders gut, da sie ohne grossen Zusatzaufwand auf opendata.swiss verlinkt werden können. Für weiterführende Informationen zu OGD ist der Besuch folgender Seite empfohlen: Die OGD-Strategie Schweiz 2014-2018 definiert Ziele und Massnahmen für die Umsetzung von OGD auf Bundesebene. Die Strategie dient zudem als Grundlage für die Zusammenarbeit mit Kantonen und Gemeinden. Ausführliche Informationen zum Thema OGD bietet die international anerkannte Open Knowledge International . Die Schweizer Sektion der Open Knowledge Foundation ist der Verein Opendata.ch , der Anlässe für OGD-Interessierte und -Anwender organisiert und die OGD-Community vertritt. Profitieren Sie von bereits vorhandenem Wissen Viele Organisationen publizieren bereits heute Daten als OGD. Von deren Erfahrungen können Sie profitieren oder sogar gemeinsame Lösungen nutzen. Das Bundesarchiv hilft Ihnen gerne weiter. Kontaktieren Sie uns . Suchen Sie zudem frühzeitig den Dialog mit potentiellen Datennutzern wie Journalisten, Programmierer oder dem Verein Opendata.ch . So finden Sie heraus, welche Datensätze besonders nachgefragt werden.","tags":"Identify","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/identify/opengovdata.html"},{"title":"What is Open Government Data (OGD)?","text":"Many data are already available free of charge, but are not identified as OGD. Such data are especially suitable for publication on opendata.swiss, as they can be linked on the portal without much additional effort being required. Further information on OGD can be found on the following sites: OGD Strategy for Switzerland 2014-2018 defines objectives and measures for implementing OGD at the federal level. The strategy also forms the basis for cooperation with cantons and communes. Detailed information on OGD is offered by the internationally recognized Open Knowledge International . The Foundation's Swiss section is the Opendata.ch association , which organizes events for users and those interested in OGD and represents the OGD community. Benefit from existing knowledge Many organizations already publish data as OGD. You can benefit from their experience or even work with them. The Federal Archives will be happy to assist you. Contact us . Be sure to consult potential data users, such as journalists, programmers or Opendata.ch , at an early stage. In this way you can find out which datasets are most in demand.","tags":"Identify","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/identify/opengovdata.html"},{"title":"Definizione di Open Government Data (OGD)","text":"Sul portale svizzero opendata.swiss si trovano per esempio set di dati molto diversi fra loro, come i confini dei Comuni svizzeri, statistiche demografiche, immagini fornite in tempo reale dalle webcam meteorologiche in Svizzera, documenti storici o un catalogo della letteratura svizzera. Spesso vengono caricati set di dati completi che l'utente può rielaborare o combinare. In questo modo è possibile sfruttare i dati disponibili per nuove applicazioni e visualizzazioni. Già oggi, sono messe a disposizione gratuitamente molte informazioni, che però sovente non vengono segnalate come OGD. Questi set di dati sono ideali per la pubblicazione su opendata.swiss, dato che possono essere collegati al portale senza grande dispendio di tempo. Maggiori ragguagli sugli OGD: la Strategia sul libero accesso ai dati pubblici in Svizzera 2014-2018 definisce gli obiettivi e le misure a livello federale e funge da base per la collaborazione con i Cantoni e i Comuni; chi vuole saperne di più sugli OGD può visitare il sito della Open Knowledge , una fondazione internazionalmente riconosciuta, o quello della sua sezione italiana . La sezione svizzera, l'associazione Opendata.ch , organizza incontri informativi per utenti o semplici interessati agli OGD e rappresenta la comunità OGD. Sfruttare le conoscenze disponibili Numerose organizzazioni pubblicano già oggi OGD e mettono a disposizione il loro know-how e la loro collaborazione. Per maggiori informazioni rivolgersi all'Archivio federale ( contatto ). Per scoprire quali set di dati sono più richiesti è importante cercare per tempo il dialogo con i potenziali utenti, ad esempio giornalisti, programmatori o l'associazione opendata.ch .","tags":"Identify","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/identify/opengovdata.html"},{"title":"Welche Daten gibt es in meiner Organisation?","text":"Identifizieren Sie zu Beginn nur die am häufigsten nachgefragten, eventuell bereits publizierten Datensätze. Falls Sie anschliessend ein komplettes Inventar Ihrer Datensammlungen erstellen möchten, finden sie hier weitere Informationen . OGD-identifizieren: Fragenkatalog Die folgenden Fragen helfen Ihnen, Daten zu identifizieren, die auf opendata.swiss publiziert werden können. Welche Daten sind bereits publiziert (Website, andere Portale etc.)? Welche Daten Ihrer Organisation werden am meisten nachgefragt? Wäre deren proaktive Publikation denkbar? Welche Daten Ihrer Organisation sollten aus Effizienzgründen publiziert werden (einmalige Publikation, statt wiederholte, individuelle Zustellung)? Verfügen Sie über eine Gesamtübersicht über die Datenbestände (=Inventar)? Sind im Rahmen anderer Erhebungen im IT-Bereich Informationen über Ihre Datensätze vorhanden? Sobald Sie geeignete Daten identifiziert haben, müssen Sie abklären, ob sie die Daten technisch und rechtlich freigeben können. Weitere Informationen zur Vorbereitung der Datenpublikation finden Sie im Kapitel Vorbereiten . Unterscheidung OGD und kundenspezifische Leistungen In der Regel werden jene Daten als OGD publiziert, für die eine breite Nachfrage besteht und die von mehreren Personen weitergenutzt werden können. Datensätze, die auf speziellen Kundenwunsch hergestellt worden sind, gelten jedoch meist nicht als OGD. Weitere Informationen zu dieser Abgrenzung finden Sie im Dokument Abgrenzung zwischen OGD und kundenspezifischen, individuellen Leistungen .","tags":"Identify","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/identify/identifying.html"},{"title":"What data does my organization hold?","text":"Identifying OGD: list of questions The following questions will help you to identify data that can be published on opendata.swiss: Which data have already been published (website, other portals, etc.)? Which data are most often requested within your organization? Would it be feasible to publish them proactively? Which data in your organization should be published for reasons of efficiency (one-off publication rather than repeated individual delivery)? Do you have a complete overview of your data collections (inventory)? Is information about your datasets available through other IT data gathering? Once you have identified suitable data, you must establish whether it is technically and legally possible to release them. Further information on preparing data for publication can be found in the \"Prepare\" section . Distinguishing between OGD and services for specific customers In general, the data published as OGD are those for which there is wide demand and which can be reused by a number of people. By contrast, datasets that were created in response to a specific customer request do not normally constitute OGD. Further information on this distinction can be found here .","tags":"Identify","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/identify/identifying.html"},{"title":"Determinazione dei dati disponibili","text":"Il primo passo consiste nell'identificare i set di dati richiesti più spesso ed eventualmente già pubblicati. Chi desiderasse in seguito allestire un inventario completo dei propri set di dati, trova qui utili ragguagli . Identificazione degli OGD Per identificare i dati da pubblicare su opendata.swiss è utile porsi le domande seguenti: Quali dati sono già pubblicati (sito Internet, altri portali ecc.)? Quali dati dell'organizzazione sono richiesti più spesso? Sarebbe ipotizzabile una loro pubblicazione proattiva? Quali dati dell'organizzazione dovrebbero essere pubblicati per ragioni di efficienza (pubblicazione unica invece di un invio individuale ripetuto)? L'organizzazione dispone di una panoramica dei suoi dati (=inventario)? Sono disponibili informazioni sui set di dati nel quadro di altre rilevazioni informatiche? Non appena identificati i dati appropriati, occorre accertarne la pubblicabilità dal punto di vista tecnico e legale. Maggiori informazioni sulla preparazione della pubblicazione sono riportate nell'apposito capitolo . Distinzione tra OGD e prestazioni per clienti specifici Di norma, vengono pubblicati quali OGD i dati richiesti da un'ampia fascia di pubblico e che possono essere riutilizzati da molte persone. I set di dati allestiti su richiesta in genere non sono considerati OGD. Maggiori informazioni su questa distinzione sono riportate qui .","tags":"Identify","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/identify/identifying.html"},{"title":"Publikation von Geodaten","text":"Im Folgenden ist das Vorgehen beschrieben, wie valide Datensätze in geocat.ch erstellt werden, um sie anschliessend auf dem opendata-Portal zu publizieren. Um Geodaten auf dem Portal opendata.swiss zu publizieren, müssen die Metadaten der betroffenen Daten zuerst im Katalog für Geometadaten geocat.ch publiziert werden. Von dort werden die benötigten Attribute dann durch einen automatisierten Prozess ins opendata-Portal überführt. 1. Anmeldung bei geocat.ch Um auf geocat Metadaten zu publizieren, müssen zwei Kriterien erfüllt sein, die der Benutzer nicht selber einrichten kann, und die er somit durch die Administratoren von geocat.ch beantragen muss: Gruppe , welche für die zu publizierenden Daten zuständig ist (z. Bsp. ein Kanton, ein Bundesamt etc.) Falls die Gruppe noch nicht in geocat.ch besteht, bitte Angaben zur Gruppe (genauer Name in den drei Landessprachen und Englisch, sowie ein Logo) per Mail an geocat@swisstopo.ch schicken. Benutzerkonto Um dies einzurichten, bitte eine E-Mail an geocat@swisstopo.ch senden und Kontaktangaben zur Person (Name, Vorname und E-Mail) nennen. Für jede Gruppe wird durch die Administratoren von geocat.ch ein Konto eingerichtet, welches die Rechte eines „Benutzeradministrators\" hat. Diese Rolle berechtigt dazu, selber neue Benutzerkonten in der eigenen Gruppe einzurichten. Ein Benutzeradmin kann wie folgt Benutzer einrichten: 1) Einloggen und unter „Metadatenmanagement\" auf „Admin Konsole\" klicken: 2) Auf der folgenden Seite „Users and groups\" anklicken: 3) Im folgenden Fenster „Manage users\", anschliessend „+ New user\" anklicken: Anschliessend müssen die Rechte zugeordnet werden. Folgende Benutzertypen bestehen in geocat.ch: „Registrierter Benutzer\": Benutzer kann Metadaten nicht bearbeiten/löschen, aber alle Metadaten der eigenen Gruppen sehen, auch die nicht publizierten „Editor\": Benutzer kann Metadaten der Gruppe bearbeiten, löschen, neu erstellen, jedoch nicht publizieren „Reviewer\": Benutzer kann Metadaten der Gruppe bearbeiten, löschen, neu erstellen und publizieren „Benutzeradministrator\": Benutzer kann neue Benutzerkontos einrichten und ist unsere Ansprechperson für betroffene Gruppe „Is an administrator\" bitte nicht anwählen. Sobald diese beiden Voraussetzungen erfüllt sind, kann der eingeloggte Benutzer selbständig Metadaten erfassen. 2. Gibt es schon ein Metadatensatz in geocat.ch oder nicht? JA: In vielen Fällen besteht bereits ein Metadatensatz in geocat.ch. Dieser muss einfach noch um die OGD-spezifischen Attribute angereichert werden. In diesem Fall bitte gleich zu Punkt 3 weitergehen. NEIN: Besteht noch kein Metadatensatz, muss dieser neu erfasst werden. Dazu muss der Benutzer eingeloggt sein und auf Metadatenmanagement > „Neue Metadaten\" klicken: Auf der folgenden Seite „Erstelle einen…\" Datensatz anklicken und das Template „opendata.swiss\" auswählen. Anschliessend müssen (mindestens) die für einen Metadateneintrag obligatorischen Elemente ausgefüllt werden, plus zusätzlich die in Punkt 3 beschriebenen OGD-spezifischen Attribute. Obligatorisch für einen validen Metadatensatz gemäss ISO-Standard sind: Titel Datumsangabe Sprache Kurzbeschreibung Thematik (Kategorie) Ausdehnung Metadatenkontakt 3. Ein Datensatz, der auf dem OGD-Portal publiziert wird, muss folgende Attribute enthalten: Name Attribut in geocat.ch Bemerkungen Metadatensatzidentifikator wird automatisch generiert Titel In deutsch und französisch Alternativtitel In deutsch und französisch Datum als Rolle \"Publikation\" wählen; es können mehrere Daten im Metadatensatz angegeben warden (Rollen: \"Erstellung\", „Überarbeitung\", „Publikation\"), für die Publikation in OGD wird jedoch nur das zuerst erfasste übernommen. Kontakt für die Ressource Als Rolle „Publisher\" wählen (korrekt? Im Moment häufig „Verantwortliche Stelle\"). Optional können weitere Kontakte erfasst werden. Thematik Es muss eine Thematik ausgewählt werden. Handelt es sich um einen Geobasisdatensatz, muss dieselbe Thematik vergeben werden wie in der Sammlung der Geobasisdatensätze vorgesehen. Sprache Sprache, in der die Dokumentation zum Datensatz vorliegen Digitale Transferoption Es muss ein Link auf eine „landing page\" erstellt werden (= Informationsseite zum Datensatz). Dies geschieht über das Protokoll: Webadresse URL: WWW:LINK-1.0-http--link Digitale Transferoption Es **muss** mindestens eine (es dürfen aber auch mehrere) digitale Transferoption ausgewählt werden mit mindestens einem der folgenden Protokolle: Datei via FTP zum Download: WWW:DOWNLOAD-1.0-ftp—download (Mapping: http..?) Datei via URL zum Download: WWW:DOWNLOAD-URL Spezialisiertes Geoportal: CHTOPO:specialised-geoportal OGC-Web Map Service: OGC:WMS-http-get-map OGC-WMS Capabilities Service: OGC:WMS-http-get-capabilities (falls Datensatz in WMS publiziert ist) OGC-Web Map Tile Service: OGC:WMTS-http-get-capabilities OGC-Web Feature Service: OGC:WFS-http-get-capabilities Schlüsselwörter opendata.swiss ist obligatorisch (löst das Harvesting des Metadatensatzes aus); weitere Schlüsselwörter sind fakultativ Ausdehnung > zeitliche Ausdehnung Falls der Datensatz zeitlich begrenzte Gültigkeit aufweist, kann dies über die Zeitliche Ausdehnung erfolten: Ausdehnung > „Nicht-geographischen Extent hinzufügen\" > zeitliche Ausdehnung > Zeitperiode > Beginn und Endzeitpunkt erfassen 4. Folgende Attribute sollten erfasst sein: : s. Mapping: alles, was optional! 5. Metadaten validieren Um den erstellten Metadatensatz zu validieren, muss dieser im Bearbeitungsmodus geöffnet werden. In der Menüzeile auf „Überprüfen\" klicken. Gibt es keine Fehlermeldung betreffend… XST ISO 19115 GM03 GeoNetwork …so ist der Metadatensatz valide. Ansonsten müssen angezeigte Fehler korrigiert werden. 6. Metadaten publizieren Ob ein Datensatz in geocat.ch publiziert ist, kann an dem kleinen Schloss abgelesen werden. Ist es offen, ist der Datensatz publiziert. Um einen Datensatz zu publizieren, entweder… auf das geschlossene Schloss klicken, oder… den kleinen Menüpfeil anwählen, dort „weitere\" und anschliessend „Berechtigungen\" anklicken: Anschliessend den Datensatz für „alle\" freigeben. 7. Anfrage machen für ein CSW-Endpoint geocat@swisstopo.ch 8. Anfrage machen, dass der CSW-Endpoint geharvestet sein soll @opendata.swiss","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/geodaten-publikation.html"},{"title":"Publication of Geodata","text":"This document is available in English .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/geodaten-publikation.html"},{"title":"Pubblicazione dei dati geografici","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/geodaten-publikation.html"},{"title":"Daten-Inventarisierung","text":"Ein Dateninventar gibt Ihnen eine Übersicht über die vorhandenen Daten und erleichtert die Auswahl der als OGD geeigneten Daten. Sie können jedoch problemlos einzelne Datensätze auf opendata.swiss publizieren. Situation auf Bundesebene Der Bund hat mit der OGD-Strategie Schweiz 2014-2018 folgenden Auftrag erhalten: M4 Inventarisierung der Datenbestände des Bundes Ein zentrales Verzeichnis der für OGD geeigneten Datenbestände der Bundesverwaltung soll schrittweise aufgebaut und publiziert werden. Dieses Inventar ist eine Grundlage für die weitere Entwicklung und Planung des OGD-Angebotes. Das Bundesarchiv koordiniert dieses zentrale Verzeichnis, das Informationen über: Datenbestände in Form von Datenbanken Registern, sogenannten Data-Warehouses ähnlichen Sammlungen strukturierter Datensätze enthalten soll. Das Bundesarchiv hat bereits eine erste Inventarisierungsrunde durchgeführt und ist im „ Bericht über Datenbestände des Bundes - Grundlagen für ein Inventar \" dokumentiert. Die 2. Inventarisierungsrunde ist für den Herbst 2016 geplant. Verschiedene Länder haben bereits weitergehende Erfahrungen als die Schweiz gesammelt: Grossbritannien USA Niederlanden","tags":"Identify","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/identify/inventory.html"},{"title":"Compiling a data inventory","text":"Situation at the federal level The OGD Strategy for Switzerland 2014-2018 gives the Confederation the following task: M4 Setting up an inventory of the Confederation's datasets A central directory of Federal Administration datasets which are appropriate for OGD should gradually be drawn up and published. This inventory is a basis for further development and planning of the OGD offering. The Federal Archives coordinate this central directory, which is to contain information about: data fonds in the form of databases registers (data warehouses) similar collections of structured datasets. The Federal Archives have already conducted a first round of inventorization and documented it here . The second round is scheduled for autumn 2016. A number of countries have already accumulated more experience with data inventorization: UK USA Netherlands","tags":"Identify","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/identify/inventory.html"},{"title":"Inventariazione dei dati","text":"Un inventario offre una panoramica dei dati disponibili e facilita la selezione di quelli che si prestano a essere OGD. Su opendata.swiss possono comunque essere pubblicati anche singoli set di dati. Situazione a livello federale Nell'ambito della Strategia sul libero accesso ai dati pubblici in Svizzera 2014-2018, alla Confederazione è assegnato il seguente mandato: M4 Inventariazione dei dati della Confederazione È allestito gradualmente e pubblicato un elenco centrale di tutti i dati dell'Amministrazione federale adatti a essere messi a disposizione in formato aperto. Questo inventario funge da base per lo sviluppo e la pianificazione ulteriori dell'offerta di tali dati. L'Archivio federale coordina quest'elenco centrale destinato a contenere informazioni su: banche dati; registri (i cosiddetti data warehouse); raccolte analoghe di set di dati strutturati. L'Archivio federale ha già svolto, e documentato qui , una prima tornata di inventariazione. La seconda è prevista per l'autunno 2016. Diversi Paesi hanno già esperienza nell'inventariazione dei dati: Gran Bretagna ; USA ; Paesi Bassi .","tags":"Identify","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/identify/inventory.html"},{"title":"Publikation","text":"Für publikation direkt auf opendata.swiss sind drei Schritte nötig: Vorbereitungen organisatorischer und technischer Art bei Ihnen (Datenlieferant). Upload in den Katalog von opendata.swiss. Live-Schaltung des aktualisierten Katalogs auf opendata.swiss. Im Benutzerhandbuch ist das System von opendata.swiss ausführlich dokumentiert. Vorbereitung Rollen vergeben: Datenbesitzer (oder „Data-Owner\") definieren: Wer ist in Ihrer Organisation verantwortlich für die Daten und deren Publikation? Datenlieferant definieren: Wer hat die technische Verantwortung (mögliche Aufgaben: Erfassung von Metadaten, Testing, Aktualisierungen)? Definieren wer die Qualität der Beschreibungen und der Metadaten prüft sowie auch wer fachliche/inhaltliche Fragen zu den Datenbeständen beantworten kann. Definieren wer der/die SPOC für den Portal-Betreiber sein wird. Daten und Metadaten vorbereiten: Die Referenz zur gesetzlichen Grundlage für die Publikation verifizieren. Auswahl der korrekten Nutzungsbedingung verifizieren. Prüfen in welchem Format diese Datensätze publiziert werden. Empfehlungen Dateiformate Grundsätzlich steht es Ihnen frei, in welchem Dateiformat Sie Ihre Daten auf opendata.swiss zur Verfügung stellen wollen. e ist jedoch empfohlen, sich an die im Dokument Empfehlung Dateiformate angegebenen Formate zu halten. Falls nötig, Qualitätssicherung der Daten durchführen Metadaten-Import durchführen Damit Sie die Metadaten auf opendata.swiss erfassen können, muss das Portalteam Ihre Organisation im System erstellen. Melden Sie sich , falls ihre Organisation bisher noch keine Daten auf dem Portal publiziert. Anschliessend sind insbesondere folgende Punkte zu beachten: Machen Sie sich mit der Benutzeroberfläche bzw. den DCAT-AP Felder vertraut. Ausführliche Informationen zum System liefert das Benutzerhandbuch von opendata.swiss . Erfassen Sie die Metadaten. Dafür sind die im DCAT-AP Standard definierte Felder auszufüllen (hier ist die ausgewählte Publikationsvariante massgebend). Schicken Sie uns ein Bild und eine Beschreibung Ihrer Organisation, wenn möglich bereits 4-sprachig (DE, FR, IT, EN). Beides wird auf Ihrer Organisationsseite aufgeschaltet ( zum Beispiel ). Live-Schaltung Das Portalteam und der Datenlieferant stellen gemeinsam sicher, dass alle Daten, Metadaten und Beschreibungen in der Test-Umgebung korrekt dargestellt werden. Nachdem Sie Ihr Einverständnis gegeben haben, werden die Daten online geschaltet. Publikation von Geodaten Mehr Ressourcen dazu befinden sich in unserem Bibliothek .","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/publish/swiss.html"},{"title":"Publication","text":"Uploading metadata to opendata.swiss This involves three steps: Organizational and technical preparations by you as data supplier Uploading to the opendata.swiss catalogue Updated catalogue online at opendata.swiss. The user handbook contains detailed information on the opendata.swiss system. Preparations Assign roles: Define the data owner: who in your organization is responsible for the data and for publishing them? Define the data supplier: who has technical responsibility? (tasks may include metadata entry, testing, updates) Define who assesses the quality of the descriptions and the metadata and who can answer technical/content questions on the data fonds. Define the single point of contact (SPOC) for the portal operator. Prepare the data and metadata: Verify the reference to the legal framework for publication . Check that the correct terms of use have been chosen. Check the format in which the datasets are to be published. Recommended data formats Essentially, you can make your data available on opendata.swiss in any data format you choose. We encourage using one of the formats listed in Recommendations for OGD Formats . If necessary, carry out a quality check of the data. MIME-Type Mapping To retrieve the format that is displayed on the portal, following values will be checked in following order: File Extension of dcat:downloadURL Value of dct:mediaType Value of dct:format The value retrieved will be mapped as follows: Retrieved Value Displayed Format text, txt TXT html HTML csv CSV xml XML json JSON geojson GeoJSON xls, xlsx XLS zip ZIP pdf PDF wms WMS wcs WCS wfs WFS wmts WMTS kmz KMZ geotiff GeoTIFF tiff TIFF png PNG other values N/A Resource Previews Whenever possible, a preview of the data is displayed on each resource pages. This helps users to evaluate whether the dataset fits their need without having to download it first. If a preview is not possible, an error message appears after 5 seconds. Supported Formats Tabular Data : see below Text : HTML, XML, JSON Other : PDF Restrictions File needs to be available The size of the file has to be smaller than 20MB Tabular data The Xloader will always try to load tabular data into the DataStore. Ressources will be queued and then uploaded into DataStore asynchronously. Following requirements and restrictions apply: The format of the resource has to be one of: csv application/csv xls xlsx tsv application/vnd.ms-excel application/vnd.openxmlformats-officedocument.spreadsheetml.sheet ods application/vnd.oasis.opendocument.spreadsheet Supported Delimiters: , The size of the file has to be smaller than 20MB Duplicate column-names are not supported Empty headers are not supported Invalid data is not supported, e.g. a numeric value that is out of range or that is inserted into a text field If the Xloader fails, a second attempt via MessyTables will be started: * messytables is more accepting and tries to guess types and can sometimes also import files with missing headers or empty columns Triggers for preview creation Automatic : when a dataset is updated (= updated via Harvester or Wordpress), all its resources are checked for changes. If all requirements are met (supported formats, file is available, etc.), the system tries to create views for all its resources Manual : it's possible to submit all or some datasets to the system to try to create views, contact the support for help. Importing the metadata Before you can import your metadata to opendata.swiss, the portal team must enter your organization in the system. If your organization has not previously published data on the portal, please register by contacting us . You should then do the following: Familiarize yourself with the user interface and the DCAT-AP fields. Detailed information on the system can be found in the opendata.swiss user handbook . Enter the metadata, completing the fields defined in the DCAT-AP standard (this will depend on the publication option chosen). Send us an image and a description of your organization, if possible in four languages (DE, FR, IT, EN). These will be published on your organization's page ( for example here ). Data online The Federal Archives and the data supplier together ensure that all the data, metadata and descriptions are displayed correctly in the test environment. Once you have given your consent, the Federal Archives will make the data available online. Publication via geo.admin.ch This chapter is available in our library .","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/publish/swiss.html"},{"title":"Pubblicazione","text":"Caricamento dei metadati su opendata.swiss preparazione organizzativa e tecnica da parte del fornitore dei dati; caricamento nel catalogo di opendata.swiss; attivazione del catalogo aggiornato su opendata.swiss. Il manuale illustra nel dettaglio il sistema del portale opendata.swiss. Preparazione Attribuzione dei ruoli Designazione del titolare dei dati (o data owner): in seno all'organizzazione, chi è responsabile per i dati e la loro pubblicazione? Designazione del fornitore dei dati: chi detiene la responsabilità tecnica (possibili compiti: registrazione di metadati, test, aggiornamento)? Designazione di un addetto alla verifica della qualità delle descrizioni e dei metadati e di una persona incaricata di rispondere alle domande tecniche/di contenuto sui dati. Designazione del single point of contact (SPOC) per il gestore del portale. Preparazione di dati e metadati Verifica delle basi legali per la pubblicazione . Scelta delle condizioni d'uso appropriate . Verifica del formato in cui i set di dati vengono pubblicati. Formato dei file: raccomandazioni In linea di principio vige la massima libertà in merito al formato in cui si desidera mettere a disposizione i dati su opendata.swiss. Si raccomanda tuttavia di attenersi ai formati riportati nel documento Raccomandazioni per OGD Formati . Se necessario, svolgimento di prove atte a garantire la qualità dei dati. Importazione dei metadati Per poter registrare metadati su opendata.swiss, è necessario avere uno spazio specifico nel sistema. Chi non avesse ancora pubblicato dati sul portale, deve annunciarsi all'indirizzo . Dopo di che, occorrerà in particolare: acquisire dimestichezza con l'interfaccia grafica e i campi DCAT-AP. Per informazioni dettagliate sul sistema, consultare il manuale di opendata.swiss ; registrare i metadati compilando i campi definiti nello standard DCAT-AP (fa stato l'opzione di pubblicazione scelta); Inviare un'immagine e una descrizione dell'organizzazione, se possibile in quattro lingue (DE, FR, IT, EN), affinché possano essere pubblicate sulla sua pagina ( esempio ). Attivazione I responsabili del portale e il fornitore dei dati provvedono insieme a che tutti i dati, i metadati e le descrizioni siano riportati correttamente nell'ambiente di test. Una volta ottenuto il consenso, i dati saranno attivati, che da quel momento sono consultabili in linea. Pubblicazione tramite geo.admin.ch Questo articolo è disponibile nella nostra libreria .","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/publish/swiss.html"},{"title":"Nutzungsbedingungen auswählen","text":"Für die Nutzenden dieser Daten, sind die Gesetze und Verordnungen jedoch häufig schwierig zu verstehen. Ausserdem ist es angesichts der Vielfalt an Gesetzen nicht einfach, die Übersicht zu bewahren. Aus diesem Grund werden bei jedem Datensatz auf opendata.swiss sogenannte „Nutzungsbedingungen\" angezeigt. Diese erklären mit wenigen Symbolen und Sätzen, wofür ein Datensatz verwendet werden darf. Sie übersetzen damit die weiterhin massgebliche gesetzliche Grundlage in eine einheitliche und für den Nutzenden verständliche Sprache. Als datenpublizierende Behörde müssen Sie deshalb vor der Publikation Ihrer Daten auf opendata.swiss zwingend eine Nutzungsbedingung auswählen, welche die Bestimmungen Ihrer gesetzlichen Grundlage korrekt wiedergibt. Eine Übersicht über die auf opendata.swiss zugelassenen Nutzungsbedingungen finden Sie hier . An Hand des Resultats der rechtlichen Vorprüfung können Sie nun einfach die richtigen Nutzungsbedingungen auswählen. Resultat Rechtliche Vorprüfung Nutzungsbedingung Der Datensatz kann ohne Nutzungseinschränkungen auf opendata.swiss publiziert werden Freie Nutzung Der Datensatz kann auf opendata.swiss publiziert werden, die Quellenangabe ist jedoch obligatorisch. Freie Nutzung. Quellenangabe ist Pflicht. Spezialfall: Alle Fragen im Schema bis auf die Frage nach der kommerziellen Nutzung oder allenfalls jene nach der Quellenangabe wurden mit „ja\" beantwortet. (siehe Erklärung unten) Freie Nutzung. Kommerzielle Nutzung nur mit Bewilligung des Datenlieferanten zulässig. Oder Freie Nutzung. Quellenangabe ist Pflicht. Kommerzielle Nutzung nur mit Bewilligung des Datenlieferanten zulässig. Kein OGD Keine Publikation auf opendata.swiss Der Spezialfall: Sollte Ihre gesetzliche Grundlage keine kommerzielle Nutzung erlauben, können Sie Ihre Daten momentan nicht auf opendata.swiss publizieren. Ist die kommerzielle Nutzung grundsätzlich erlaubt, dafür ist jedoch eine Bewilligung nötig, tritt der Spezialfall ein. Wenn Sie die Daten anschliessend auf opendata.swiss publizieren, sollten Sie im Voraus entscheiden, dass Sie die kommerzielle Nutzung in aller Regel bewilligen. Daten, für die restriktivere Bedingungen gelten, werden nicht auf opendata.swiss publiziert. Ihre Nutzungsbedingung und den Link auf die gesetzliche Grundlage benötigen Sie später, für die Metadaten des Katalogs auf opendata.swiss . Weitere Ausführungen zu rechtlichen Fragen rund um OGD sind im Konzept Rechtliche Rahmenbedingungen zur Publikation von Daten als Open Government Data (OGD) zu finden.","tags":"Prepare","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/prepare/terms.html"},{"title":"Choosing terms of use","text":"For this reason, \" terms of use \" are displayed for every dataset on opendata.swiss. Using a small number of symbols and sentences, these explain what a dataset can be used for. They translate the applicable legal framework into a standardized language that users can understand. As an authority publishing data, you must therefore select a set of terms of use that correctly reflects your legal framework before publishing your data on opendata.swiss. You can find an overview of the terms of use permitted on opendata.swiss here . Based on the results of the preliminary legal check you can now simply select the right terms of use. Result of preliminary legal check Terms of use The dataset may be published on opendata.swiss without restrictions on use. Open use. The dataset may be published on opendata.swiss but the source must be indicated. Open use. Must provide the source. Special case: you have answered \"yes\" to all the questions in the diagram up to the question regarding commercial use or the one regarding citing the source (see explanation below). Open use. Use for commercial purposes requires permission of the data owner. Or Open use. Must provide the source. Use for commercial purposes requires permission of the data owner. Not OGD Publication on opendata.swiss is not permitted. The special case: if your legal framework does not permit commercial use, you cannot currently publish your data on opendata.swiss. If commercial use is permitted in principle but permission is required, this corresponds to the special case. If you subsequently publish the data on opendata.swiss, you should decide in advance that you will normally permit commercial use. Data subject to more restrictive conditions are not published on opendata.swiss. You will need your terms of use and the link to the legal framework later for the catalogue metadata on opendata.swiss . Further details of legal issues related to OGD are contained in the concept Legal framework for the publication of data as open government data (OGD) .","tags":"Prepare","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/prepare/terms.html"},{"title":"Definizione delle condizioni d'uso","text":"I testi normativi sono tuttavia redatti in un linguaggio non sempre facilmente comprensibile per gli utenti, senza contare che è difficile avere una visione d'insieme delle molte leggi vigenti. Per questa ragione, su opendata.swiss per ogni set di dati sono indicate condizioni d'uso che con pochi simboli e frasi ne illustrano l'utilizzo ammesso. La base legale applicabile viene così espressa in una lingua unitaria e di facile comprensione. Prima della pubblicazione dei dati su opendata.swiss, le autorità sono pertanto tenute a scegliere le condizioni d'uso che rispecchiano correttamente le disposizioni della pertinente base legale. Qui è riportata una panoramica delle condizioni d'uso ammesse per opendata.swiss. In base all'esito della verifica giuridica preliminare è ora possibile selezionare le condizioni che fanno al caso. Esito della verifica giuridica preliminare Condizioni d'uso Il set di dati può essere pubblicato su opendata.swiss senza limitazioni d'uso. Libero utilizzo Il set di dati può essere pubblicato su opendata.swiss, ma l'indicazione della fonte è obbligatoria. Libero utilizzo. Indicazione della fonte obbligatoria. Caso speciale: a tutte le domande dello schema – tranne quella sull'uso commerciale o eventualmente quella sull'indicazione della fonte – è stato risposto affermativamente (cfr. spiegazione sottostante). Libero utilizzo. Utilizzo a fini commerciali ammesso soltanto previo consenso del titolare dei dati. Oppure Libero utilizzo. Indicazione della fonte obbligatoria. Utilizzo a fini commerciali ammesso soltanto previo consenso del titolare dei dati. Non si tratta di OGD Nessuna pubblicazione su opendata.swiss Caso speciale: se la base legale non ammette un uso commerciale, al momento i dati non possono essere pubblicati su opendata.swiss. Se l'uso commerciale è invece ammesso, ma richiede un consenso, ci si trova di fronte a un caso speciale. Se i dati vengono pubblicati su opendata.swiss, occorre stabilire in anticipo se consentirne l'uso commerciale. I dati soggetti a condizioni restrittive non vengono pubblicati su opendata.swiss. Le condizioni d'uso e il rimando alla base legale serviranno in un secondo tempo per il caricamento dei metadati nel catalogo di opendata.swiss . Per maggiori dettagli sulle questioni giuridiche rilevanti per gli OGD, consultare il piano per le condizioni quadro legali per la pubblicazione di dati come OGD .","tags":"Prepare","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/prepare/terms.html"},{"title":"Benutzerhandbuch opendata.swiss","text":"Benutzerprofil verwalten Persönliche Optionen Admin language Wählen Sie aus dem Dropdown-Menu die Sprache aus, in der Sie Ihr Administrations-Interface nutzen möchten. Name Benutzername, Spitzname, etc. (* Pflichtfeld) Bis auf den Benutzernamen können Sie alle Angaben selbst verwalten. Um diesen zu ändern oder weitere Benutzer zu erstellen , wenden Sie sich an den Application-Manager. Kontaktinfo E-Mail-Adresse (* Pflichtfeld) Benutzerkonten-Verwaltung Neues Passwort (* Pflichtfeld) Klicken Sie auf die Schaltfläche 'Passwort generieren', um ein E-Mail mit einem Link zum Passwort-Erstellen zu erhalten. Änderungen speichern Bestätigen Sie Ihre Änderungen mit einem Klick auf die Schalt- fläche ' Profil aktualisieren '. Hinweise zur Mehrsprachigkeit Metadaten von Datensätzen und Ressourcen, Organisations-Informationen Empfehlung: Wenn möglich sollten Sie versuchen, die Titel, Beschreibungen oder Schlagwörter in den vier Sprachen (EN/DE/FR/IT) zu erfassen. Das System gewährleistet über einen 'Fallback', dass die Texte einer verfügbaren Sprache angezeigt werden, falls sie nicht in der vom Nutzer ausgewählten Sprache erfasst sind. Die Reihenfolge des 'Fallback' ist: DE → FR → IT → EN Hinweise zu Umlauten, Accents, Leerzeichen Schlagwörter und Names (Slugs) Beim Erfassen normalisiert das System alle Angaben, welche für 'Slugs' (Elemente von Links) benötigt werden. Umlaute (ä, ö, ü) werden ersetzt durch a, o, u. Accents (à, â, ç, é, è, ô, ù) werden ersetzt durch a, c, e, o, u. Leerzeichen werden ersetzt durch Divis (-). Metadaten via Formular / XML-Import verwalten 1) Neuen Datensatz via Formular erstellen Klicken Sie auf die Schaltfläche 'Erstellen', um das Metadaten- Formular (→ S. 4) zu öffnen. 2) Datensatz via Formular bearbeiten Klicken Sie auf den Titel eines Datensatzes Ihrer Organisation, um die Metadaten im Formular (→ S. 4) zu bearbeiten. 3) Status des Datensatzes Wird kein Status (→ S. 11) angezeigt, ist der Datensatz publiziert. 4) Massenbearbeitungs-Aktionen Wählen Sie mittels Häkchen in der Checkbox jene Datensätze aus, für die Sie eine gemeinsame Aktion durchführen wollen. Wählen Sie aus dem Dropdown-Menu die Aktion aus: ' Bearbeiten ' Sie einzelne Metadaten mehrerer Datensätze. ' Exportieren ' Sie alle Metadaten ein oder mehrerer Datensätze als XML-Datei ( DCAT-AP Switzerland Standard ). Zum Ausführen klicken Sie auf die Schaltfläche 'Übernehmen'. 5) Metadaten via XML-Import verwalten Wählen Sie eine dem DCAT-AP Switzerland Standard entsprechende XML-Datei aus. Klicken Sie auf die Schaltfläche 'Importieren'. Neue Datensätze werden mit Status 'Entwurf' erstellt . Metadaten bestehender Datensätze werden aktualisiert . Aufbau des Metadaten-Formulars 1) Datensatz-Information 2a) Daten 2b) Publisher-Informationen 3) Weitere Informationen 4) Ressourcen 5) Sidebar Veröffentlichen und Aktualisieren Schlagwörter 1) Datensatz-Informationen Neuen Datensatz erstellen / bearbeiten Titel hier eingeben / bearbeiten Dieser Titel bezeichnet den Datensatz im Backend. Aus ihm wird der Permalink des Datensatzes gebildet. Verändern Sie diesen Titel und den Permalink nicht mehr, nachdem der Datensatz publiziert ist! Datensatz Datensatz-Identifier * Eindeutiger Identifier des Datensatzes verknüpft mit dem Publisher. Ein guter Weg, einen eindeutigen Identifier zu erhalten, ist es, wenn Sie die ID aus dem Quellsystem verwenden. Titel (EN/DE/FR/IT) * Geben Sie mindestens in einer Sprache einen Titel an. Beschreibung (EN/DE/FR/IT) * Geben Sie mindestens in einer Sprache eine Beschreibung an. Pflichtfelder 2a) Daten Daten Erstellt * Das Datum der ersten Publikation dieses Datensatzes. Falls dieses Datum nicht bekannt ist, verwenden Sie das Datum der ersten Publikation auf dem Portal opendata.swiss. Geändert Das Datum, an dem der Datensatz (seit der ersten Publikation auf dem Portal) zuletzt geändert wurde. Aktualisierungsintervall Wählen Sie aus dem Dropdown-Menu das Intervall, in dem dieser Datensatz aktualisiert wird. Zeitliche Abdeckung Geben Sie eine oder mehrere Zeitperioden an, welche dieser Datensatz abdeckt. (* Pflichtfeld) 2b) Publisher-Informationen Publisher-Informationen Publisher * Ein oder mehrere Publisher dieses Datensatzes. Dieser kann der Organisation entsprechen, welche den Datensatz veröffentlicht. Mindestens ein Publisher ist erforderlich. Kontaktstellen * Die Stelle, welche von den Daten-Nutzern kontaktiert wird, falls eine inhaltliche Frage zum Datensatz besteht. Mindestens eine Kontaktstelle mit E-Mail-Adresse ist erforderlich. (* Pflichtfelder) 3) Weitere Informationen Weitere Informationen Kategorien Wählen Sie eine oder mehrere thematische Kategorien aus, denen dieser Datensatz zugeordnet wird. Landing Page Geben Sie eine Webseite an, auf der weitere Informationen zum Datensatz verfügbar sind. Beziehungen Weitere Informationen mit Bezug zu diesem Datensatz. Verwenden Sie den Titel 'legal_basis', um bei Bedarf einen Link auf die gesetzliche Grundlage dieses Datensatzes anzugeben. Der Link wird im Frontend dem Titel ' Gesetzliche Grundlage ' hinterlegt. Verwandte Datensätze Wählen Sie mittels Dropdown-Menu andere auf dem Portal verfügbare Datensätze aus, die eine inhaltliche Beziehung zu diesem Datensatz haben. 4) Ressourcen Identifier Identifier der Ressource im Quellsystem des Publishers. Titel (EN/DE/FR/IT) Wird der Titel leer gelassen, wird der Titel des Datensatzes verwendet. Beschreibung (EN/DE/FR/IT) Wird die Beschreibung leer gelassen, wird die Beschreibung des Datensatzes verwendet. Sprache Sprachen, in denen diese Ressource vorliegt. Falls die Ressource sprachunabhängig ist, wählen Sie keine Sprache aus. Erstellt * Das Datum der ersten Publikation dieser Ressource. Geändert Das Datum der letzten Änderung dieser Ressource. (* Pflichtfeld) Nutzungsbedingungen Wählen Sie aus dem Dropdown-Menu eine der Nutzungsbedingungen aus. Alle Nutzungsbedingungen, die nicht mit einem Stern (*) markiert sind, gelten als 'Closed Data'. Zugangs-URL Die URL, über welche auf die Ressource zugegriffen werden kann. Dies kann entweder eine Download-URL, eine API-URL oder eine Landing-Page-URL sein. Falls die Ressource nur über eine Landing Page verfügbar ist, muss dieses Feld die URL der Landing Page beinhalten. Falls eine Download-URL (siehe unten) für diese Ressource angegeben wurde, muss diese ebenfalls in diesem Feld eingetragen werden. Download-URL URL der Datei, falls die Ressource heruntergeladen werden kann. Grösse (in Bytes) Format Wählen Sie aus dem Dropdown-Menu eines der Formate aus. (* Pflichtfelder) 5) Sidebar Veröffentlichen und Aktualisieren Status Geben Sie den Status des Datensatzes an: Entwurf : Sie bearbeiten die Metadaten des Datensatzes weiter. Veröffentlicht : Der Datensatz ist auf opendata.swiss publiziert. Veröffentlichen / Aktualisieren Sofort veröffentlichen : Publizieren Sie den Datensatz mit einem Klick auf die Schaltfläche 'Veröffentlichen'. Veröffentlichung planen : Nutzen Sie die Datums- und Zeitangabe, um die Veröffentlichung eines Datensatzes in der Zukunft zu festzulegen und klicken Sie auf die Schaltfläche 'Planen'. Die Veröffentlichung lässt sich verlässlich auf ein bestimmtes Datum planen; die Festlegung einer Uhrzeit kann um ± 1 Stunde von der effektiven Publikation abweichen. Aktualisieren : Haben Sie Metadaten eines Datensatzes bearbeitet, der bereits publiziert ist, publizieren Sie Ihre Änderungen mit einem Klick auf die Schaltfläche 'Aktualisieren'. Schlagwörter Schlagwörter (EN/DE/FR/IT) Geben Sie ein oder mehrere Schlagwörter zum Datensatz – getrennt durch Kommas – an oder wählen Sie per Klick ein oder mehrere häufig genutze Schlagwörter aus. Im Formular Begriffe suchen Wie öffnen Sie den Browser-Suchbalken? Drücken Sie den Tastaturbefehl Ctrl+F oder Wählen Sie im Browsermenu Edit > Find Geben Sie einen Begriff ins Textfeld des Suchbalkens ein und der Browser markiert den Begriff im Formular. Detailansicht eines Datensatzes Informationen Titel des Datensatzes Zuletzt aktualisiert Nutzungsbedingungen Datenpublizierende Organisation Thematische Kategorien Beschreibung des Datensatzes Schlagwörter Ressourcen / Formate Zusätzliche Informationen Verwandte Datensätze Detailansicht einer Ressource Informationen Titel der Ressource Zuletzt aktualisiert Nutzungsbedingungen Datenpublizierende Organisation Format der Ressource Beschreibung der Ressource Zusätzliche Informationen Organisations-Informationen verwalten 1) Titel / Name (Slug) Dieser Titel bezeichnet die Organisation im Backend. Aus ihm wird der 'Name (Slug)' der Organisation gebildet. Verändern Sie diesen Titel und den 'Name (Slug)' nicht mehr, nachdem die Organisation Datensätze publiziert hat! 2) Organisations-Informationen Titel (EN/DE/FR/IT) Geben Sie mindestens in einer Sprache einen Titel an. Dieser wird auf dem Portal angezeigt Beschreibung (EN/DE/FR/IT) Geben Sie mindestens in einer Sprache eine Beschreibung an(nur Text). Diese wird auf dem Portal angezeigt URL Eine URL, welche zu weiteren Informationen dieser Organisation führt 3) Bild Wählen Sie eine Bild-Datei aus und klicken Sie auf die Schaltfläche 'Datei hinzufügen oder hochladen'. 4) Veröffentlichen / Aktualisieren Nachdem Sie die Informationen angegeben oder Änderungen vorgenommen haben, publizieren bzw. aktualisieren Sie diese mit einem Klick auf die entsprechende Schaltfläche. Pflichtfelder Detailansicht einer Organisation Informationen Titel der Organisation Beschreibung der Organisation Link zu weiteren Informationen der Organisation Bild der Organisation","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/opendataswiss-userguide.html"},{"title":"User guide to opendata.swiss","text":"This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/opendataswiss-userguide.html"},{"title":"Manuale d'uso per opendata.swiss","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/opendataswiss-userguide.html"},{"title":"DCAT-AP for Switzerland format","text":"Dieses Dokument ist derzeit nur in englischer Sprache verfügbar .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/ch-dcat-ap.html"},{"title":"DCAT-AP for Switzerland format","text":"The ‹Open Government Data› project organisation have worked out a joint solution for metadata. The portal opendata.swiss implements these standards - see Publish on opendata.swiss . Have a look at the following file for a quickstart: full dataset example (RDF) Namespaces <rdf:RDF xmlns:dct= \"http://purl.org/dc/terms/\" xmlns:dc= \"http://purl.org/dc/elements/1.1/\" xmlns:dcat= \"http://www.w3.org/ns/dcat#\" xmlns:foaf= \"http://xmlns.com/foaf/0.1/\" xmlns:xsd= \"http://www.w3.org/2001/XMLSchema#\" xmlns:rdfs= \"http://www.w3.org/2000/01/rdf-schema#\" xmlns:rdf= \"http://www.w3.org/1999/02/22-rdf-syntax-ns#\" xmlns:vcard= \"http://www.w3.org/2006/vcard/ns#\" xmlns:odrs= \"http://schema.theodi.org/odrs#\" xmlns:schema= \"http://schema.org/\" > Internationalisation The DCAT-AP for Switzerland Standard expects that text elements of the datasets and their distributions be translated in the following four languages: French (fr) German (de) Italian (it) English (en) The multi-lingual elements have to contain the xml:lang attribute, as the following example show: <dct:title xml:lang= \"fr\" > FR Titre </dct:title> <dct:title xml:lang= \"de\" > DE Titel </dct:title> <dct:title xml:lang= \"it\" > IT Titolo </dct:title> <dct:title xml:lang= \"en\" > EN Title </dct:title> DCAT-AP reference documentation Definition of dcat:Catalog Content Contains nested elements of type <dcat:dataset> Mandatory yes Cardinality 1..1 Attributes Description Catalog with datasets Example: <dcat:Catalog> <dcat:dataset> [...] </dcat:dataset> [further dcat:dataset] </dcat:Catalog> dcat:dataset Content Contains single nested element of type dcat:Dataset . See Definition of dcat:Dataset . Mandatory yes Cardinality 1..n Attributes Description Wrapper for a dataset of the catalog Example: <dcat:dataset> <dcat:Dataset rdf:about= \"http://swisstopo/325\" > [Content of dataset] </dcat:Dataset> </dcat:dataset> [further dcat:dataset] Definition of dcat:Dataset Mandatory yes Cardinality 1..1 Attributes Name rdf:about Content Unique identifier for dataset Mandatory yes Description A single dataset of the catalog Example: <dcat:Dataset rdf:about= \"http://swisstopo/325\" > [Content of dataset] </dcat:Dataset> dct:identifier Type rdfs:Literal http://www.w3.org/TR/rdf-schema/#ch_literal Mandatory yes Cardinality 1..1 Description Unique identifier of the dataset across all publishers. A good way to make sure this identifier is unique is to link the source system ID with the ID of the publisher: [Source-Dataset-ID]@[Source-Organisation-ID] . It is recommended that the identifier consists out of the following characters: A-Za-z , 0-9 without special characters, except - and _ Example: <dct:identifier> 325@swisstopo </dct:identifier> dct:title Type rdfs:Literal http://www.w3.org/TR/rdf-schema/#ch_literal Mandatory yes Cardinality 1..n (one for each language) Attributes Name xml:lang Content en , de , fr , it Description Language of the element Mandatory yes Description Title of the dataset in the language defined by the xml:lang attribute Example: <dct:title xml:lang= \"de\" > Eisenbahnlärm Nacht </dct:title> dct:description Type rdfs:Literal http://www.w3.org/TR/rdf-schema/#ch_literal Mandatory yes - in all the languages in which distributions are available Cardinality 1..n (one for each language) Attributes Name xml:lang Content en , de , fr , it Description Language of the element Mandatory yes Description Description of the dataset in the language defined by the xml:lang attribute Example: <dct:description xml:lang= \"de\" > Die Karte zeigt, welcher Lärmbelastung die Bevölkerung durch den Schienenverkehr ausgesetzt ist. </dct:description> dct:issued Type Date and time in ISO-8601 format Mandatory Can be left out if there is no distribution Cardinality 0..1 Attributes Name rdf:datatype Content http://www.w3.org/2001/XMLSchema#dateTime Description Type of the field Mandatory yes Description Date of the first publication of this dataset. If this date is unknown, the date of the first publication on opendata.swiss can be used. If that date is in the future, the dataset is not displayed. Example: <dct:issued rdf:datatype= \"http://www.w3.org/2001/XMLSchema#dateTime\" > 2013-04-26T01:00:00Z </dct:issued> dct:modified Type Date and time in ISO-8601 format Mandatory Only when the dataset has changed since the first publication Cardinality 0..1 Attributes Name rdf:datatype Content http://www.w3.org/2001/XMLSchema#dateTime Description Type of the field Mandatory yes Description Date of the last change (since the first publication on opendata.swiss) Example: <dct:modified rdf:datatype= \"http://www.w3.org/2001/XMLSchema#dateTime\" > 2013-04-26T01:00:00Z </dct:modified> dct:publisher Elements rdf:Description Type Nested element Mandatory yes Cardinality 1..n Description The publishers of the dataset. rdf:about is an optional attribute. Example: <dct:publisher> <rdf:Description rdf:about= \"https://www.bafu.admin.ch/\" > <rdfs:label> Bundesamt für Landestopografie swisstopo </rdfs:label> </rdf:Description> </dct:publisher> dct:contactPoint Elements vcard:Organization Type vcard:Kind Mandatory yes Cardinality 1..n Description One or more contact email addresses for this dataset vcard:fn . Description of the point of contact vcard:hasEmail has an attribute rdf:resource which contains the email of the point of contact (including mailto:) Example: <dcat:contactPoint> <vcard:Organization> <vcard:fn> Abteilung Lärm BAFU </vcard:fn> <vcard:hasEmail rdf:resource= \"mailto:noise@bafu.admin.ch\" /> </vcard:Organization> </dcat:contactPoint> <dcat:contactPoint> <vcard:Individual> <vcard:fn> Sekretariat BAFU </vcard:fn> <vcard:hasEmail rdf:resource= \"mailto:sekretariat@bafu.admin.ch\" /> </vcard:Individual> </dcat:contactPoint> dct:theme Type skos:Concept http://www.w3.org/2009/08/skos-reference/skos.html#Concept Mandatory yes Cardinality 1..n Attributes Name rdf:resource Description URI to the category Mandatory yes Description Categorisation of the data. In the rdf:resource attribute, the unique URI of the category from SKOS-RDF (RDF) must be given. The following values are accepted from Themes: http://opendata.swiss/themes/work http://opendata.swiss/themes/construction http://opendata.swiss/themes/population http://opendata.swiss/themes/education http://opendata.swiss/themes/energy http://opendata.swiss/themes/finances http://opendata.swiss/themes/geography http://opendata.swiss/themes/legislation http://opendata.swiss/themes/health http://opendata.swiss/themes/trade http://opendata.swiss/themes/industry http://opendata.swiss/themes/crime http://opendata.swiss/themes/culture http://opendata.swiss/themes/agriculture http://opendata.swiss/themes/mobility http://opendata.swiss/themes/public-order http://opendata.swiss/themes/politics http://opendata.swiss/themes/prices http://opendata.swiss/themes/territory http://opendata.swiss/themes/social-security http://opendata.swiss/themes/statistical-basis http://opendata.swiss/themes/tourism http://opendata.swiss/themes/administration http://opendata.swiss/themes/national-economy Example: <dcat:theme rdf:resource= \"http://opendata.swiss/themes/population\" /> dct:language Type rdfs:Literal ISO 639-1 two-letter code Content en , de , fr , it Mandatory no Cardinality 0..n (for each language) Attributes Description Should contain all languages for which a distribution is available. This field is not validated and is used for display purposes. If all distributions are language-independant, this field can be left out. Example: <dct:language> de </dct:language> dct:relation Elements rdf:Description Type Nested element Mandatory no Cardinality 0..n Description A relation to a document. The rdf:about must link to a related document. Example: <dct:relation> <rdf:Description rdf:about= \"http://www.bafu.admin.ch/laerm/index.html?lang=de\" > <rdfs:label> Webseite des BAFU </rdfs:label> </rdf:Description> </dct:relation> dcat:keyword Type rdfs:Literal http://www.w3.org/TR/rdf-schema/#ch_literal Mandatory no Cardinality 0..n Attributes Name xml:lang Content en , de , fr , it Description Language of the element Mandatory yes Description Keyword who describes this dataset Example: <dcat:keyword xml:lang= \"de\" > Nacht </dcat:keyword> <dcat:keyword xml:lang= \"fr\" > Nuit </dcat:keyword> <dcat:keyword xml:lang= \"it\" > Noche </dcat:keyword> <dcat:keyword xml:lang= \"en\" > Night </dcat:keyword> dcat:landingPage Type foaf:Document http://xmlns.com/foaf/spec/#term_Document Mandatory no Cardinality 0..1 Attributes Description Website of the dataset with related information Example: <dcat:landingPage> http://www.bafu.admin.ch/laerm/index.html?lang=de </dcat:landingPage> dcat:spatial Type dct:Location http://dublincore.org/documents/2012/06/14/dcmi-terms/?v=terms#Location Mandatory no Cardinality 0..n Attributes Description Geographical classification of the dataset. Can be a description, coordinates, a bounding-box or a polygon. This field currently supports GeoJSON with the LOCN extension . Example: <dct:spatial rdf:resource= \"http://publications.europa.eu/mdr/authority/country/ZWE\" /> <dct:spatial> Bern </dct:spatial> <dct:spatial> <dct:Location> <locn:geometry rdf:datatype= \"https://www.iana.org/assignments/media-types/application/vnd.geo+json\" > <![CDATA[ { \"type\":\"Polygon\", \"crs\":{\"type\":\"name\",\"properties\":{\"name\":\"urn:ogc:def:crs:OGC:1.3:CRS84\"}}, \"coordinates\":[[[-6.41736,55.7447],[2.05827,55.7447],[2.05827,49.8625],[-6.41736,49.8625],[-6.41736,55.7447]]] } ]]> </locn:geometry> </dct:Location> </dct.spatial> See also: How should dct:spatial and dct:Location be used? dcat:coverage Type dct:LocationPeriodOrJurisdiction http://dublincore.org/documents/2012/06/14/dcmi-terms/?v=terms#LocationPeriodOrJurisdiction Mandatory no Cardinality 0..n Attributes Description This field is currently not used, use dcat:spatial instead. Example: <dct:coverage/> dcat:temporal Type dct:PeriodOfTime http://dublincore.org/documents/2012/06/14/dcmi-terms/?v=terms#terms-PeriodOfTime Mandatory no Cardinality 0..n Attributes Description One or more time period(s) that cover the dataset. <schema:startDate> contains the start date, <schema:endDate> contains the end date format for dates: http://www.w3.org/2001/XMLSchema#date Example: <dct:temporal> <dct:PeriodOfTime> <schema:startDate rdf:datatype= \"http://www.w3.org/2001/XMLSchema#date\" > 1905-03-01 </schema:startDate> <schema:endDate rdf:datatype= \"http://www.w3.org/2001/XMLSchema#date\" > 2013-01-05 </schema:endDate> </dct:PeriodOfTime> </dct:temporal> dct:accrualPeriodicity Mandatory no Cardinality 0..n Attributes Name rdf:resource Type dct:Frequency Mandatory yes Description The frequency in which this dataset is updated. Values for dct:Frequency : http://dublincore.org/groups/collections/frequency/ Example: <dct:accrualPeriodicity rdf:resource= \"http://purl.org/cld/freq/daily\" /> rdfs:seeAlso Type rdfs:Literal http://www.w3.org/TR/rdf-schema/#ch_literal Mandatory no Cardinality 0..n Attributes Description Link to related datasets. Contains the identifier of the linked dataset. Example: <rdfs:seeAlso> 326@swisstopo </rdfs:seeAlso> dcat:distribution Content Contains single nested element of type dcat:Distribution . See Definition of dcat:Distribution . Mandatory yes Cardinality 1..n Attributes Description Wrapper for a distribution of the dataset Example: <dcat:distribution> <dcat:Distribution rdf:about= \"http://swisstopo/325/ch.bafu.laerm-bahnlaerm_nacht\" > [Content of distribution] </dcat:Distribution> </dcat:distribution> [further distributions] Definition of dcat:Distribution Mandatory yes Cardinality 1..1 Attributes Name rdf:about Content Unique identifier for distribution Mandatory yes Description A single distribution of the dataset Example: <dcat:Distribution rdf:about= \"http://swisstopo/325/ch.bafu.laerm-bahnlaerm_nacht\" > [Content of distribution] </dcat:Distribution> dcat:identifier Type rdfs:Literal http://www.w3.org/TR/rdf-schema/#ch_literal Mandatory no Cardinality 0..1 Attributes Description Identifier of the distribution in the source system Example: <dct:identifier> ch.bafu.laerm-bahnlaerm_nacht </dct:identifier> dcat:title Type rdfs:Literal http://www.w3.org/TR/rdf-schema/#ch_literal Mandatory no - except if the distribution does not contain all the content of the dataset. Cardinality 0..n (one for each language) Attributes Name xml:lang Content en , de , fr , it Description Language of the element Mandatory yes Description The title of the distribution in the language defined by the xml:lang? attribute. If this element is left out, the dct:title of the dataset is used instead. Example: <dct:title xml:lang= \"de\" > WMS (ch.bafu.laerm-bahnlaerm_nacht) </dct:title> dct:description Type rdfs:Literal http://www.w3.org/TR/rdf-schema/#ch_literal Mandatory no - except if the distribution does not contain all the content of the dataset. Cardinality 0..n (one for each language) Attributes Name xml:lang Content en , de , fr , it Description Language of the element Mandatory yes Description Description of the distribution in the language defined by the xml:lang attribute Example: <dct:title xml:lang= \"de\" > WMS (ch.bafu.laerm-bahnlaerm_nacht) </dct:title> dct:issued Type Date and time in ISO-8601 format Mandatory yes Cardinality 1..1 Attributes Name rdf:datatype Content http://www.w3.org/2001/XMLSchema#dateTime Description Type of the field Mandatory yes Description Date of the publication of this distribution Example: <dct:issued rdf:datatype= \"http://www.w3.org/2001/XMLSchema#dateTime\" > 2013-05-11T00:00:00Z </dct:issued> dct:modified Type Date and time in ISO-8601 format Mandatory Only when the distribution has changed since the first publication. If this distribution was changed several times, this corresponds to the date of the latest change. Cardinality 0..1 Attributes Name rdf:datatype Content http://www.w3.org/2001/XMLSchema#dateTime Description Type of the field Mandatory yes Description Date of the last change of the distribution Example: <dct:modified rdf:datatype= \"http://www.w3.org/2001/XMLSchema#dateTime\" > 2015-04-26T00:00:00Z </dct:modified> dct:language Type rdfs:Literal ISO 639-1 two-letter code Content en , de , fr , it Mandatory no Cardinality 0..n (for each language) Attributes Description Languages in which this distribution is available. If the distribution is language-independant, this can be left out. Example: <dct:language> de </dct:language> dcat:accessURL Type http://www.w3.org/2001/XMLSchema#anyURI Mandatory yes Cardinality 1..n Attributes Name rdf:datatype Content http://www.w3.org/2001/XMLSchema#anyURI Description Type of the field Mandatory yes Description URL where the distribution can be found. This could be either a download URL, an API URL or a landing page URL. If the distribution is only available through a landing page, this field must contain the URL of the landing page. If a download URL was given for this distribution, this field has to contain the same value. Example: <dcat:accessURL rdf:datatype= \"http://www.w3.org/2001/XMLSchema#anyURI\" > http://wms.geo.admin.ch/ </dcat:accessURL> dct:downloadURL Type http://www.w3.org/2001/XMLSchema#anyURI Mandatory no Cardinality 0..n Attributes Name rdf:datatype Content http://www.w3.org/2001/XMLSchema#anyURI Description Type of the field Mandatory yes Description URL of a data file, if the distribution can be downloaded. For each of these, a dcat:accessURL has to exist. Example: <dcat:downloadURL rdf:datatype= \"http://www.w3.org/2001/XMLSchema#anyURI\" > http://data.geo.admin.ch.s3.amazonaws.com/ch.fill/data.zip </dcat:downloadURL> dct:rights Type rdfs:Literal http://www.w3.org/TR/rdf-schema/#ch_literal Content Possible values: NonCommercialAllowed-CommercialAllowed-ReferenceNotRequired (acceptable for opendata.swiss, Open Definition compliant) NonCommercialAllowed-CommercialAllowed-ReferenceRequired (acceptable for opendata.swiss, Open Definition compliant) NonCommercialAllowed-CommercialWithPermission-ReferenceNotRequired (acceptable for opendata.swiss) NonCommercialAllowed-CommercialWithPermission-ReferenceRequired (acceptable for opendata.swiss) NonCommercialAllowed-CommercialNotAllowed-ReferenceNotRequired (not acceptable for opendata.swiss) NonCommercialAllowed-CommercialNotAllowed-ReferenceRequired (not acceptable for opendata.swiss) NonCommercialNotAllowed-CommercialNotAllowed-ReferenceNotRequired (not acceptable for opendata.swiss) NonCommercialNotAllowed-CommercialNotAllowed-ReferenceRequired (not acceptable for opendata.swiss) NonCommercialNotAllowed-CommercialAllowed-ReferenceNotRequired (not acceptable for opendata.swiss) NonCommercialNotAllowed-CommercialAllowed-ReferenceRequired (not acceptable for opendata.swiss) NonCommercialNotAllowed-CommercialWithPermission-ReferenceNotRequired (not acceptable for opendata.swiss) NonCommercialNotAllowed-CommercialWithPermission-ReferenceRequired (not acceptable for opendata.swiss) Mandatory yes Cardinality 1..1 Description Rights statement of this distribution. This is composed of 3 elements that can be summarized in a string literal: - Non-commercial use: allowed or not allowed - Commercial use: allowed, allowed with permission and not allowed - Reference: required or not required Example: <dct:rights> NonCommercialAllowed-CommercialAllowed-ReferenceNotRequired </dct:rights> dct:license Type dct:LicenseDocument Mandatory no Cardinality 0..1 Attributes Description Not used, see dct:rights . This field ensures compatibility to other metadata standards. Example: <dct:license/> dct:byteSize Type rdfs:Literal http://www.w3.org/TR/rdf-schema/#ch_literal Mandatory no - except if the distribution is available as a data download (see downloadURL ). Cardinality 0..1 Attributes Description Size of the data in bytes Example: <dcat:byteSize> 1024 </dcat:byteSize> dct:mediaType Type dct:MediaTypeOrExtent http://www.iana.org/assignments/media-types/media-types.xhtml Mandatory no - except if the distribution is available as a data download (see downloadURL ). Cardinality 0..1 Attributes Description This value will be used to display the ressource-format if the downloadURL is empty. Only values from the list of IANA MIME types http://www.iana.org/assignments/media-types/media-types.xhtml Example: <dcat:mediaType> text/html </dcat:mediaType> dct:format Type dct:MediaTypeOrExtent Mandatory no Cardinality 0..1 Attributes Description If neither the downloadURL nor the mediaType provide a valid format this value is used to display the format of the ressource. Example: <dct:format/> dct:coverage Type dct:LocationPeriodOrJurisdiction http://dublincore.org/documents/2012/06/14/dcmi-terms/?v=terms#LocationPeriodOrJurisdiction Mandatory no Cardinality 0..n Attributes Description Distributions can be classified by their location or time period (for example, one for each canton, one for each year, etc.) Example: <dct:coverage/> Common fields rdf:Description Type rdfs:label Mandatory yes Cardinality 1..1 Attributes Name rdf:about Mandatory no Description The description of the dataset/distribution The following documents on the selection and definition of OGD standards for metadata are available in the Library: CH DCAT AP Reference DCAT Application Profile DCAT: Catalog DCAT: Dataset DCAT: Distribution","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/ch-dcat-ap.html"},{"title":"DCAT-AP for Switzerland format","text":"Questo articolo è disponibile in inglese .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/ch-dcat-ap.html"},{"title":"Daten-Hosting","text":"Daten-Hosting ist heute relativ günstig und einfach zu betreiben, selbst wenn Sie innerhalb Ihrer Organisation noch keine bestehende Lösung haben. Einige Aspekte sollten jedoch vor der Publikation berücksichtigt werden. Dieses Dokument ist derzeit nur in englischer Sprache verfügbar .","tags":"Prepare","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/prepare/hosting.html"},{"title":"Data hosting","text":"Data hosting is now relatively cheap and simple to manage, even if you do not yet have a solution in place within your organization. However, there are some issues you should consider before publication: Cloud vs. data center? Here we refer to the way your content is serviced on the Internet. In a data center, your organization would typically be responsible for running a \"full stack\", or entire collection, of applications required for web hosting. This means providing support for DNS , HTTP , SMTP and other critical protocols using specialized \"server\" programs. You often have the ability to decide on each of these components and pick the best combination. In a cloud environment, there is sometimes considerably less flexibility, however by centralizing administration and maintenance, the overall costs per site can be much lower. How accessible are backups? Preparing for disasters, and ensuring that data does not get lost during updates or changes, are extremely important tasks in setting up for long-term hosting. Ensure that you know how to get duplicates of your data, which are ideally being versioned for selective restoration, find out how much time and effort this process takes - and test it in advance, to be calm and prepared for any eventuality. Are there bandwidth restrictions? As every smartphone user knows, access to data comes at a cost. Whether it is uploading large datasets, or potentially being restricted from sharing your data to a large number of users, check with your hosting provider on what are the financial and technical aspects of this question. For instance, some providers can put special measures in place to \"scale up\" the rate at which your content is being distributed ahead of a marketing campaign or publicity - ensuring that none of your visitors get to see error messages or outages. Is there a redundancy measure in place? Redundancy is the concept of having alternative copies of the same information. In the case of web hosting, this often means having multiple servers in multiple locations provisioning the exact same content. This is useful for maximing performance across the world, or having a \"safe failover\" - in case one of the copies (for example, of an e-commerce web site) is for some reason inaccessible, one of the others immediately/automatically take over, and no business is lost.","tags":"Prepare","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/prepare/hosting.html"},{"title":"Hosting di dati","text":"L'hosting di dati è oggi relativamente economico e semplice da gestire, anche in seno alle organizzazioni che non dispongono ancora di apposite soluzioni. È però importante tenere conto di alcuni aspetti prima della pubblicazione. Questo articolo è disponibile in inglese .","tags":"Prepare","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/prepare/hosting.html"},{"title":"Auf opendata.swiss veröffentlichen","text":"Diese Seite ist in englischer Sprache verfügbar .","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/publish/opendata-swiss.html"},{"title":"Publish on opendata.swiss","text":"If you would like to add data to opendata.swiss and your agency or organisation is not yet publishing on opendata.swiss , please continue reading and contact us for assistance . opendata.swiss is the production portal, which replaced the pilot portal ‹opendata.admin.ch› by February 2, 2016, implementing the decisions taken by the ‹Open Government Data› project organisation under the leadership of the Swiss Federal Archives SFA in the pilot phase. opendata.swiss does not host data directly, but rather aggregates metadata about open data resources in one centralised location. How can I publish my data on opendata.swiss? You need to publish standardised information about your data, so-called metadata. When we say ‹data›, we mean ‹datasets› and ‹resources› . For publishers, opendata.swiss offers the following ways to add their data to the metadata catalogue: Use case Solution Get ready I want to publish certain datasets, which are updated at rare intervals. I manually submit my metadata through a web page on opendata.swiss. For assistance, please contact us I want to publish several data and/or data which are updated regularly. I manually import my metadata by uploading an XML file – in the DCAT-AP for Switzerland format (documentation see below) – on opendata.swiss. For assistance, please contact us I want to publish a large number of datasets and/or datasets which are updated frequently. I automatically import my metadata running a metadata harvester. For assistance, please contact us I have open geodata, already published or intended to be published via geo.admin.ch / Federal Spatial Data Infrastructure FSDI I configure corresponding metadata entries in www.geocat.ch , so it will be published automatically on opendata.swiss. For www.geocat.ch support, please contact geocat@swisstopo.ch How can I test if I am ready? Get the example XML file . Fill the XML file for your metadata following the documentation of the DCAT-AP for Switzerland format . Send your XML-file for validation to the portal team: contact us The portal team gets back to you with feedback. What is the DCAT-AP for Switzerland format? The ‹Open Government Data› project organisation have worked out a joint solution for standardising on metadata publishing. See documentation in the library for full details: DCAT-AP for Switzerland","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/publish/opendata-swiss.html"},{"title":"Guida per l'utente opendata.swiss","text":"Questo articolo è disponibile in inglese .","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/publish/opendata-swiss.html"},{"title":"Daten zur Veröffentlichung vorbereiten","text":"Diese Seite ist in englischer Sprache verfügbar .","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/publish/prepare.html"},{"title":"Prepare data for publication","text":"A number of open data formats are available that are accessible on all platforms, without the restrictions of proprietary standards. Factors when considering data formats include the structure and portability of the container for your data. A well structured spreadsheet, for instance, is easy to read and managed. It has appropriate and helpful metadata, and when the data is expanded or updated, it is clear where new information needs to go. Portable data formats are non-proprietary, so the files can be opened with generally available or free software on any computer platform, and part of a widely accepted standard . Making sure that you are providing machine-readable formats allows for greatest re-use. To illustrate this, consider statistics published as PDF (Portable Document Format) documents, often used for high quality printing. While these statistics can be read by humans, they are very hard for a computer to use. This greatly limits the ability for others to re-use that data. Open Data Handbook Guidelines for data publishers SIARD eCH-0165 is a set of recommendations for the Archiving of Databases developed by the Swiss association eCH. There are many tools that are used in migrating (or converting) from one format to another. One needs to consider both how well the metadata and the actual data is preserved when it is moved from one format or environment to another, potentially reducing longer term costs of maintenance and reuse. Standards like the Open Archives Initiative Protocol for Metadata Harvesting (OAI-PMH) and those of OASIS with newer initiatives like Data Pipies and Bubbles , are technical and logistical initiatives for making migrations happen more efficiently.","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/publish/prepare.html"},{"title":"Preparare i dati per la pubblicazione","text":"Questo articolo è disponibile in inglese .","tags":"Publish","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/publish/prepare.html"},{"title":"Empfehlungen für OGD Formate","text":"1 Einleitung Um das Potential von offenen Behördendaten nutzen zu können, müssen diese in Formaten 1 bereitgestellt werden, welche möglichst einfach zu verwenden sind. Unter offenen Behördendaten versteht man Datensätze, die kostenfrei und im Idealfall in maschinenlesbarer Form zur Sekundärnutzung allen Interessierten zur Verfügung stehen 2 . Das vorliegende Dokument definiert Kriterien für die Publikation von Datensätzen im OGD Portal und gibt Empfehlungen zu spezifischen Formaten und Schnittstellen ab. Die OGD-Strategie Schweiz definiert die drei Ziele „Freigabe von Behördendaten\", „Koordinierte Publikation und Bereitstellung der Behördendaten\" und „Etablierung einer Open-Data-Kultur\" (siehe #1, OGD Strategie Schweiz 2014 – 2018 ). Für die zu verwendenden Formate werden im Ziel „Freigabe von Behördendaten\" klare Vorgaben gemacht: „Der Bund stellt der Öffentlichkeit seine für OGD geeigneten Daten in maschinenlesbaren und offenen Formaten zur freien Weiterverwendung zur Verfügung.\" (#1, S. 3499) Diese Kriterien finden ihre Entsprechung im Grundsatz 2 „Offene und wiederverwendbare Behördendaten\": „Die Daten werden in maschinenlesbarer Form angeboten, verständlich und zweckmässig beschrieben und dauerhaft zur Verfügung gestellt. Es sollen möglichst offene Formate angewandt werden.\" (#1, S. 3502) Im vorliegenden Dokument werden die Kriterien „maschinenlesbar\" und „offen\" genauer beschrieben sowie die Bedeutung von \"verständlich und zweckmässig beschrieben\" erläutert. Davon abgeleitet werden Empfehlungen zur Publikation von Datensätzen abgegeben. 2 Ziel des Dokuments & Zielpublikum Ziel des Dokuments Dieses Dokument beschreibt die Kriterien für Formate und Austauschformen, in denen die Daten auf der OGD-Plattform zugänglich sein sollen, und gibt Empfehlungen bezüglich der zu verwendenden Formate ab. Die Liste der empfohlenen Formate ist nicht abschliessend. Es gilt der Grundsatz, dass eine Datenpublikation in irgendeinem Format wünschenswerter ist als keine Publikation. Zielpublikum Das Dokument richtet sich an Datenproduzenten und Datenlieferanten bzw. die Institutionen, die Daten als OGD zur Verfügung stellen wollen. 3 Grundlagen & Auswahlkriterien Üblicherweise wird zur Illustration in der Diskussion um Open Data und Linked Data auf das Fünf-Sterne-Modell von Tim Berners-Lee verwiesen (siehe #4, Berners Lee, Tim, Linked Data ). Gemäss diesem Modell lassen sich Open Data in fünf Stufen unterteilen, wobei die ersten drei Stufen im Wesentlichen Open Data und die zwei letzten Linked Open Data beschreiben. Das Sterne-Modell hat aber Schwächen, so sind darin beispielsweise Webservices oder Application Programming Interfaces (APIs) nur ungenügend abgedeckt. Die OGD Strategie Schweiz konzentriert sich zurzeit darauf, die Kategorie ★★★ zu erreichen, d.h. die Publikation der Daten in offenen Formaten sicherzustellen. Datensätze, die nicht der Kategorie ★★★ entsprechen, sollen dennoch auf dem OGD Portal publiziert werden können. Das OGD-Portal wird mit den entsprechenden Datenlieferanten Migrationspläne erarbeiten, um langfristig die Kategorie ★★★ zu erreichen. ★ Datenpublikation mit offener Lizenz in irgendeinem Format ------- ------------------------------------------------------------------------------------ ★★ Datenpublikation in einem strukturierten Format (bspw. Excel statt Tabelle in PDF) ★★★ Datenpublikation in einem offenen Format (bspw. CSV statt Excel) ★★★★ Verwendung von eindeutigen Identifikatoren (URI) für Entitäten ★★★★★ Verlinkung der publizierten Daten mit anderen Daten, um Kontext zu schaffen Tabelle 1: Aus #2, Open Government Data – Grundlagenstudie Schweiz, S. 86 ; #5, 5 ★ Open Data (Webseite) Am wichtigsten ist, dass die Datensätze mit offener Lizenz publiziert werden. Für verschiedene Nutzer können hingegen verschiedene Formate angeboten werden, um den spezifischen Anforderungen der Nutzer gerecht zu werden. Die zentralen Kriterien für die Datenpublikation im OGD-Portal sind Maschinenlesbarkeit und Offenheit (siehe #1 OGD Strategie Schweiz ). Diese Kriterien Maschinenlesbarkeit und Offenheit sind im Folgenden rot gekennzeichnet. (1) Maschinenlesbarkeit Maschinenlesbarkeit Das Format und die enthaltenen Daten können von einem Programm automatisiert verarbeitet werden. \"Maschinenlesbar ist ein [...] Format, das so strukturiert ist, dass Softwareanwendungen konkrete Daten, einschließlich einzelner Sachverhaltsdarstellungen und deren interner Struktur, leicht identifizieren, erkennen und extrahieren können\" 3 . Mit dieser Definition ist beispielsweise eine Textdatei erst dann maschinenlesbar, wenn die darin enthaltenen Daten so strukturiert dargestellt sind, dass sie mit einem passenden Algorithmus (Programm) korrekt interpretiert und verarbeitet werden können. Ein (X)HTML-Text (eine Webseite) ist demnach nicht maschinenlesbar - ein Browser kann die Inhalte nur für Menschen lesbar auf dem Bildschirm darstellen. Erst wenn die Inhalte der Webseite semantisch strukturiert ausgezeichnet werden (z.B. unter Verwendung des Vokabulars schema.org), können die Inhalte von einem Programm als Datenstrukturen erkannt und entsprechend verarbeitet werden. Ausserdem ist bei textbasierten Formaten eine standardisierte Zeichenkodierung notwendig (wenn möglich UTF-8), um auch spezielle Zeichen (z.B. Umlaute) korrekt interpretieren zu können. Um einen passenden Algorithmus zur Verarbeitung der strukturierten Daten programmieren zu können, ist das maschinenlesbare Format noch nicht ausreichend. Die Daten müssen zusätzlich \"verständlich und zweckmässig beschrieben\" sein. Falls die Struktur der Daten einem Standard folgt, genügt die Angabe des betreffenden Standards (z.B. schema.org). Andernfalls muss die Beschreibung der Datenstruktur in die Metadaten integriert werden. (2) Offenheit Offenheit 4 Die Spezifikation des Formats ist offen gelegt und öffentlich zugänglich. \"Offen ist ein Dateiformat, das plattformunabhängig ist und der Öffentlichkeit ohne Einschränkungen, die der Weiterverwendung von Dokumenten hinderlich wären, zugänglich gemacht wird\" 5 . Die Offenheit bzw. die Zugänglichkeit der Spezifikation ist für die lückenlose Interpretierbarkeit der durch das Format kodierten Information entscheidend. Dazu gehört auch, dass der Standard verständlich, überschaubar und eindeutig sein soll; dass dieser Standard lizenzfrei ist und weit verbreitet ist.\\ Dieses Kriterium muss erfüllt sein, damit ein Format als offen gelten kann. Beide Kriterien Maschinenlesbarkeit und Offenheit weisen mehrere Dimensionen auf, die im Folgenden beschrieben werden. Die nachfolgenden, blau gekennzeichneten Dimensionen, sollen von den Datenlieferanten bei der Auswahl geeigneter Formate, bzw. Austauschformen für ihre Datensätze mitberücksichtigt werden. Standard Das Format wird durch ein Standardgremium periodisch überprüft und aktualisiert (international, national). Die Standards von (inter-)nationalen Organisationen sind langlebiger und weniger revisionsanfällig, verleihen einem Format also Stabilität. Ein Standardgremium ist grundsätzlich unabhängiger und glaubwürdiger als eine einzelne Firma, welche die Rechte an einem Format besitzt. Lizenzfrei Formate sind nicht durch auferlegte Lizenzen in der Herstellung oder Benutzung limitiert. Verhinderung einer Herstellerabhängigkeit. Verminderung bzw. Ausschaltung des potentiellen Risikos, dass der Lizenzinhaber jederzeit Änderungen vornehmen und durchsetzen kann. Verbreitung Das Format ist weit verbreitet. Grosse Verbreitung bedeutet eine zum heutigen Zeitpunkt abschätzbare relativ grosse Benutzerzahl wie auch eine gewisse Diversität der Benutzer, eine grosse Anzahl existierender Dateien im entsprechenden Format, Unterstützung des Formats durch viele voneinander unabhängige Applikationen und Programmbibliotheken. Ebenso ist die geografische Verbreitung gemeint. 4 Anwendungsfälle und Formate Je nach Anwendungsfall können offene Daten ganz unterschiedliche Formate aufweisen. Häufig werden die Daten in Tabellenform vorliegen. Aber auch Bilder, Tonaufnahmen oder Videos können Datensätze oder Bestandteile von Datensätzen darstellen. Entsprechend gross ist die Vielfalt von Formaten, in denen Daten auf dem OGD Portal veröffentlicht werden können. Die folgende Tabelle listet die wichtigsten, für die Publikation auf dem OGD Portal in Frage kommenden offenen Formate zusammen mit dem Verweis auf den jeweiligen Standard auf. Anwendungsfälle und Datenformate Verweis auf Standard / Quasi-Standard (wenn verfügbar) Strukturierte Daten Comma Separated Values (CSV) RFC 4180 JavaScript Object Notation (JSON) RFC 4627 Extensible Markup Language (XML) W3C REC Resource Description Framework (RDF) W3C REC Office Open XML Spreadsheet (XLSX) ISO/IEC 29500 Open Document Spreadsheet (ODS) ISO/IEC 26300-1:2015 Textdokumente / Berichte Text (TXT) ISO Latin-1 ( ISO 8859-1 ) und ISO Latin-9 ( ISO 8859-15 ) Universal Coded Character Set (UCS) ( ISO 10646 ) US-ASCII (ANSI X3.4-1986, bzw. ISO/IEC 646-US oder ISO/IEC 646:1991-IRV ): ISO/IEC 646:1991 Extensible Hypertext Markup Language (XHTML) W3C REC Portable Document Format (PDF) ISO 32000-1:2008 (nur PDF 1.7), ISO 19005 (PDF/A) Office Open XML Document (DOCX) ISO/IEC 29500 Open Document Text (ODT) ISO/IEC 26300-1:2015 Geodaten GeoJSON (JSON) http://geojson.org KML (XML) OGC KML GML (Geography Markup Language) OGC GML INTERLIS http://www.interlis.ch INTERLIS/GML (gemäss eCH-0118) eCH-0118 ESRI Shapefile 6 ESRI Shapefile Technical Description GeoPackage OGC GeoPackage GeoTIFF http://trac.osgeo.org/geotiff Bild-/Grafikformate TIFF (Tagged Image File Format) TIFF Revision 6.0 JPEG2000 ISO/IEC 15444-1 :2004 PNG ISO/IEC 15948:2004 SVG W3C REC Audio-/Videodaten FLAC FLAC Format Spezifikation WebM Web M Documentation Ogg Vorbis Vorbis I specification MPEG4 ISO/IEC 14496-10 Coding of audio-visual objects -- Part 10: Advanced Video Coding ISO/IEC 14496-3 Coding of audio-visual objects -- Part 3: Audio ISO/IEC 14496-14 Coding of audio-visual objects -- Part 14: MP4 file format ISO/IEC 14496-17 Coding of audio-visual objects -- Part 17: Timed Text subtitle format Wave 7 Multimedia Programming Interface and Data Specifications 1.0 Weitere Austauschformen WMS (Web Map Service) - nur eine Darstellung der Geodaten WMS-Beschreibung des OGS (Open Geospatial Consortium) WFS (Web Feature Service) für Geodaten OGC WFS SPARQL (Protokoll und Abfragesprache) W3C SPARQL ODATA (Open Data Protocol) http://www.odata.org Tabelle 3: Quelle: #2, Open Government Data – Grundlagenstudie Schweiz , S. 88; Eigene Ergänzungen Gepackte Dateien im ZIP Format sind grundsätzlich erwünscht, sofern der Inhalt in einem geeigneten offenen Format vorliegt. Bei grösseren Datensätzen im CSV oder JSON Format ist eine ZIP-Komprimierung zu empfehlen. 5 Empfehlungen Grundsätzlich sind im OGD-Portal strukturierte Daten zu verwenden. Textdokumente und Berichte dienen der Erläuterung der strukturierten Daten. Es sind Formate zu verwenden, welche für den Inhalt der Daten angemessen sind und die der Benutzer sinnvoll weiterverwenden kann. 8 Es ist erlaubt, den gleichen Datensatz in mehreren Datenformaten auf dem OGD Portal zu publizieren. Für strukturierte Daten sind „einfache\" Formate wie CSV, XML oder JSON komplexeren Formaten wie ODS und XSLX vorzuziehen. Bei regelmässiger Publikation kann die Bereitstellung einer programmierbaren Schnittstelle (API)/eines Webdienstes erheblichen Zusatznutzen stiften.\\ Proprietäre, nicht-offene Formate (wie XLS) sind zu vermeiden. Dies auch, weil nicht davon ausgegangen werden kann, dass der Benutzer eine entsprechende Applikation zur Anzeige oder Weiterverarbeitung der Daten besitzt. Für Textdokumente und Berichte sind (X)HTML, XML, ODT vorzuziehen. Falls eine maschinelle Weiterverarbeitung des Texts angestrebt wird („Natural Language Processing\"), ist HTML/XML vorzuziehen. Dokumentationen zu angebotenen Datensätzen (Datenmodelle, Codelisten etc.) können als ODT, PDF oder DOCX publiziert werden. Falls es sich um einen Bericht handelt, der strukturierte Daten interpretiert und darstellt, sollten die zugrunde liegenden strukturierten Daten in angemessenen Formaten ebenfalls publiziert werden. Zu vermeiden sind ältere, proprietäre Formate wie DOC. Für vektorielle Geodaten wird idealerweise ein modellkonformer Austausch vorgesehen, der mit INTERLIS oder INTERLIS/GML (gemäss eCH-0118) sichergestellt werden kann. Zusätzlich kann für einen vereinfachten Zugang zu den Geodaten ein anderes Format des Kapitels 4 zur Verfügung gestellt werden. Für Raster-Geodaten wird GeoTIFF empfohlen. 6 Referenzen # Titel Quelle, Link 1 OGD Strategie Schweiz 2014 – 2018 http://www.egovernment.ch/umsetzung/00881/00883/index.html?lang=de 2 Open Government Data – Grundlagenstudie Schweiz http://www.egovernment.ch/umsetzung/00881/00883/index.html?lang=de 3 G8 Open Data Charter (Englisch) https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/207772/Open_Data_Charter.pdf 4 Berners Lee, Tim, Linked Data http://www.w3.org/DesignIssues/LinkedData.html 5 5 ★ Open Data (Webseite) http://5stardata.info/ 6 Choosing appropriate formats https://www.gov.uk/service-manual/user-centred-design/choosing-appropriate-formats.html 7 Konzeptbericht Ellipse – Archivierung von Geodaten http://www.bar.admin.ch/themen/00876/00939/index.html?lang=de 7 Anhang 7.1 Formate in der OGD Praxis Die folgende Tabelle zeigt die am meisten bereitgestellten Formate in den nationalen OGD-Portalen in den USA, UK, D, A und CH: Portal Format 9 US UK EU DE CH Summe html 29 ' 877 1'747 2'335 5'204 11 39'174 xml 27 ' 255 338 3'409 438 1 31'441 csv 9'302 3'797 10'899 7'177 17 31'192 pdf 15'379 1'041 1'527 1'917 16 19'880 zip 13'309 193 1'263 265 19 15'049 xls 4'463 1'835 6'211 510 2 13'021 json 8'418 0 2'567 132 0 11'117 wms 5'077 1'453 595 3'811 95 11'031 rdf 5'849 278 2'032 5 0 8'164 xlsx 165 0 54 5'944 6 6'169 Weitere 63'824 292 6'426 7'597 1'738 79'877 Gesamtdaten 182'918 10'974 37'318 33'000 1'905 266'115 Tabelle 2: Anzahl Formate in div. Portalen, sortiert nach Gesamtsumme mit Stichtag 23.04.2015 Das Containerformat ZIP wird vor allem im US-Portal verwendet. Betrachtet man nur diese fünf ausgewählten europäischen Portale, tritt an die Stelle von ZIP die deutsche Eigenheit „Kartenviewer\", was im wesentlichen Links auf Darstellungsdienste für Geoinformationen sind. Ein wichtiges Format in der Schweiz ist das Open Document Spreadsheet (ODS) mit 1'701 Datensätzen, mehrheitlich vom Bundesamt für Statistik. Der Begriff „Format\" bezieht sich auf das Element dcat:mediaType in der Metadatenformat-Definition von DCAT:Distribution im Projekt „OGD Schweiz\" ( Projektergebnisse ) ↩ FAQ Open Government Data, http://www.opendata.admin.ch/de/faq#was-ist-open-government-data ↩ RICHTLINIE 2013/37/EU DES EUROPÄISCHEN PARLAMENTS UND DES RATES vom 26. Juni 2013 zur Änderung der Richtlinie 2003/98/EG über die Weiterverwendung von Informationen des öffentlichen Sektors (http://eur-lex.europa.eu/legal-content/DE/TXT/PDF/?uri=CELEX:32013L0037&from=DE) ↩ Die Kriterien zur Offenheit stammen aus dem Konzeptbericht Ellipse, siehe #9, Konzeptbericht Ellipse zur Archivierung von Geodaten . ↩ RICHTLINIE 2013/37/EU DES EUROPÄISCHEN PARLAMENTS UND DES RATES vom 26. Juni 2013 zur Änderung der Richtlinie 2003/98/EG über die Weiterverwendung von Informationen des öffentlichen Sektors (http://eur-lex.europa.eu/legal-content/DE/TXT/PDF/?uri=CELEX:32013L0037&from=DE) ↩ Weit verbreitetes Format, jedoch proprietär (ESRI ArcGIS-Software). Es existieren Programmbibliotheken. ↩ Es existiert kein publizierter Standard für WAVE Dateien. Das WAVE-Format ist eine Implementierung des Ressource Interchange Formats (RIFF). Dieses ist als gemeinsame Publikation von IBM Corporation und Microsoft Corporation, August 1991 freigegeben (http://www-mmsp.ece.mcgill.ca/documents/audioformats/wave/Docs/riffmci.pdf). ↩ Dieser Abschnitt wurde stark von der britischen Lösung inspiriert, siehe #6, Choosing appropriate formats ↩ Wo möglich und sinnvoll wurden verschiedene Formatbezeichnungen zusammengefasst. So kennt beispielsweise das US Portal die Bezeichnungen „xls\", „xlsx\" und „excel\". Das deutsche Portal kennt sowohl die MIME Typen „application/csv\" wie auch die Kurzbezeichnung „csv\".\\ Im US Portal an zweiter Stelle steht das binäre Format „Originator Data Format\" mit 27‘793 Datensätzen, welches auschliesslich von der National Oceanic and Atmospheric Administration (NOAA) produziert wird. Dieses Format wurde hier nicht berücksichtigt. ↩","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/empfehlungen-formate.html"},{"title":"Recommendations for OGD Formats","text":"This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/empfehlungen-formate.html"},{"title":"Raccomandazioni per OGD Formati","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/empfehlungen-formate.html"},{"title":"DCAT Distribution","text":"Ein Metadaten-Record der Klasse dcat:Distribution (Distribution-Metadaten-Record) beschreibt eine Publikationsform des betreffenden Datensatzes. Das vorliegende Dokument erläutert die dcat:Distribution.","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/dcat-distribution.html"},{"title":"DCAT Distribution","text":"This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/dcat-distribution.html"},{"title":"DCAT Distribution","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/dcat-distribution.html"},{"title":"DCAT Application Profile for Swiss data portals","text":"Die vorliegende Präsentation erklärt das DCAT Application Profile, welches für opendata.swiss verwendet wird.","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/dcat-application.html"},{"title":"DCAT Application Profile","text":"Classes and elements of the DCAT Application Profile for Swiss data portals Metadata records and data Relations between datasets Usage of the dct:seeAlso element for linking metadata records Categories: the skos:ConceptScheme of the DCAT Application Profile This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/dcat-application.html"},{"title":"DCAT Application Profile","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/dcat-application.html"},{"title":"DCAT Catalog","text":"Ein Katalog, der dem DCAT Application Profile for Swiss data portals entspricht, ist eine kuratierte Sammlung von Metadaten-Records über offene Daten. Das vorliegende Dokument erklärt diesen Katalog.","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/dcat-catalog.html"},{"title":"DCAT Catalog","text":"This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/dcat-catalog.html"},{"title":"DCAT Catalog","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/dcat-catalog.html"},{"title":"DCAT Dataset","text":"Ein Metadaten-Eintrag der Klasse dcat:Dataset (Dataset-Metadaten-Record) beschreibt eine einzelne, thematisch geschlossene Datensammlung. Das vorliegende Dokument erklärt diesen Metadaten-Eintrag.","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/dcat-dataset.html"},{"title":"DCAT Dataset","text":"This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/dcat-dataset.html"},{"title":"DCAT Dataset","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/dcat-dataset.html"},{"title":"Bericht über Datenbestände des Bundes","text":"Ein Dateninventar gibt eine Übersicht über die vorhandenen Daten und erleichtert die Auswahl der als OGD geeigneten Daten. Der Bericht über die Datenbestände des Bundes wurde 2015 erstellt. Er liefert einen ersten Überblick über die Daten beim Bund, zeigt Schwierigkeiten auf und schlägt Varianten für das weitere Vorgehen vor.","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/bericht-datenbestaende-bund.html"},{"title":"Report on Databases of the Confederation","text":"This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/bericht-datenbestaende-bund.html"},{"title":"Report on Databases of the Confederation","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/bericht-datenbestaende-bund.html"},{"title":"Arbeitshilfe für Behörden zur Publikation von Daten als OGD","text":"Die vorliegende Arbeitshilfe soll Behörden bei der Publikation von Datensätzen auf OGD unterstützen. Das darin enthaltene Schema zeigt auf, welche Prüfschritte von den Behörden vorzunehmen sind, bevor ein Datenbestand im Rahmen von OGD publiziert werden kann.","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/arbeitshilfe-publikation.html"},{"title":"Worksheet for government authorities to publish data as OGD","text":"The worksheet is intended to serve as an aid agencies for publication of records, showing test steps to be carried out by the authorities before a dataset under OGD is published. This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/arbeitshilfe-publikation.html"},{"title":"Arbeitshilfe für Behörden zur Publikation von Daten als OGD","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/arbeitshilfe-publikation.html"},{"title":"Entscheidgrundlage - Weiteres Vorgehen bezüglich Rechtsgrundlagen für die Publikation von Daten als OGD","text":"Die OGD-Strategie sieht vor, dass die rechtlichen Rahmenbedingungen dort angepasst werden sollen, wo sie eine Publikation von an sich geeigneten Daten als OGD verhindern. Die Strategie lässt jedoch offen, wie diese Anpassungen erfolgen sollen. Folgende zwei Dimensionen sind für die Anpassungen wichtig: Erstens kann die Anpassung entweder zentral oder dezentral erfolgen. Zweitens besteht einerseits die Möglichkeit, ein einheitliches Gesetz zu schaffen sowie andererseits, die einzelnen Spezialgesetze anzupassen.","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/entscheid-rechtsgrundlagen.html"},{"title":"Decision basis - guidelines in respect to legal foundations for the publication of data as OGD","text":"This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/entscheid-rechtsgrundlagen.html"},{"title":"Entscheidgrundlage - Weiteres Vorgehen bezüglich Rechtsgrundlagen für die Publikation von Daten als OGD","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/entscheid-rechtsgrundlagen.html"},{"title":"Entscheidgrundlage - Nutzungsbedingungen","text":"Die OGD-Strategie sieht vor, dass OGD aller föderalen Ebenen unter möglichst einheitlichen Nutzungsbedingungen publiziert werden. Die nachfolgende Entscheidgrundlage fasst die Ergebnisse der Arbeiten der Arbeitsgruppe Recht OGD (AG Recht OGD) zur Frage der Nutzungsbedingungen für OGD zusammen. Sie zeigt bestehende gesetzliche Beschränkungen für die Nutzung von Behördendaten und ihre Konsequenzen auf. Basierend auf der Entscheidgrundlage hat der Projektausschuss des Projektes OGD-Schweiz über die in Kapitel 4 aufgeführten Punkte entschieden. Er hat damit definiert, welche Kriterien Daten erfüllen müssen, damit sie als OGD gelten.","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/entscheidgrundlage-nutzungsbedingungen.html"},{"title":"Entscheidgrundlage - Nutzungsbedingungen","text":"This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/entscheidgrundlage-nutzungsbedingungen.html"},{"title":"Entscheidgrundlage - Nutzungsbedingungen","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/entscheidgrundlage-nutzungsbedingungen.html"},{"title":"Konzept - Rechtliche Rahmenbedingungen zur Publikation von Daten als Open Government Data (OGD)","text":"Das nachfolgende Konzept fasst die Ergebnisse der Arbeiten der Arbeitsgruppe Recht OGD (AG Recht OGD) zusammen und zeigt die rechtlichen Rahmenbedingungen auf, innerhalb derer die OGD Strategie umgesetzt werden soll. Weitere Lieferobjekte der AG Recht OGD sind Textbausteine für Standardformulierungen zur Nutzung der OGD Datensätze, ein Entwurfstext für die Rubrik \"rechtliche Grundlagen\" auf der Internetseite (\"Disclaimer\"), sowie eine Arbeitshilfe für Behörden, die Datensätze auf OGD publizieren möchten.","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/konzept-rechtliche-rahmen.html"},{"title":"Legal framework for the publication of data as Open Government Data","text":"This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/konzept-rechtliche-rahmen.html"},{"title":"Konzept - Rechtliche Rahmenbedingungen zur Publikation von Daten als Open Government Data (OGD)","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/konzept-rechtliche-rahmen.html"},{"title":"Rechtliche Grundlagen OGD (Disclaimer)","text":"Dieses Dokument enthält den Disclaimer, der für im Projekt OGD Schweiz 2015 für das Portal opendata.swiss entworfen worden ist. Die aktuellen rechtlichen Hinweise für opendata.swiss sind hier zu finden .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/rechtliche-grundlagen-disclaimer.html"},{"title":"Rechtliche Grundlagen OGD (Disclaimer)","text":"This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/rechtliche-grundlagen-disclaimer.html"},{"title":"Rechtliche Grundlagen OGD (Disclaimer)","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/rechtliche-grundlagen-disclaimer.html"},{"title":"Textbausteine für Standardformulierungen","text":"Das vorliegende Dokument liefert Textbausteine für Standardformulierungen auf dem OGD-Portal. Die Nutzungsbedingungen für die OGD werden durch die jeweiligen gesetzlichen Grundlagen vorgegeben. Diese sind für die Nutzerinnen und Nutzer von OGD jedoch häufig schwierig verständlich. Deshalb sollen die für die Datennutzung relevanten Bestimmungen auf dem OGD-Portal in einfachen Standardformulierungen wiedergegeben werden. Die heute gültigen Nutzungsbedingungen auf opendata.swiss sind hier zu finden .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/textbausteine-standardformulierungen.html"},{"title":"Textbausteine für Standardformulierungen","text":"This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/textbausteine-standardformulierungen.html"},{"title":"Textbausteine für Standardformulierungen","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/textbausteine-standardformulierungen.html"},{"title":"Abgrenzung zwischen OGD und kundenspezifischen, individuellen Leistungen","text":"Nicht alle Daten, welche die Verwaltung produziert, sind als OGD zu veröffentlichen. Insbesondere Leistungen die spezifisch für einen Kunden erbracht werden, müssen nicht als Open Data veröffentlicht werden. Der vorliegende Bericht liefert Kriterien zur Abgrenzung zwischen OGD und kundenspezifischen Leistungen.","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/bericht-abgrenzung-leistungen.html"},{"title":"Boundaries between OGD and client specific, individual services","text":"This report by defines in more detail the concept of OGD, explains economic fundamentals of the production and use of open data in government, and provides a decision tree for use in evaluating publication criteria. It defines general demarcation criteria so that individual administrations can identify \"their\" authority's data in the context of specific legal basis as OGD, or otherwise classify them. For further information and decision support tools, see the full report (available in German only).","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/bericht-abgrenzung-leistungen.html"},{"title":"Abgrenzung zwischen OGD und kundenspezifischen, individuellen Leistungen","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/bericht-abgrenzung-leistungen.html"},{"title":"Für die Gebührenproblematik relevante offene Fragen","text":"Die nachfolgenden Fragen entstanden im Zusammenhang mit der Erstellung und Kommentierung des Lieferobjekts L5.2 „Abgrenzung zwischen OGD und kundenspezifischen, individuellen Leistungen\". In einer ersten Version enthielt Kapitel 7 von L5.2 offene Fragen, die über den Fokus von L5.2 hinausgingen. Diese über die eigentlichen Abgrenzungsfragen hinausgehend identifizierten Fragenstellungen wurden als Grundlage für die Diskussion der weiteren Umsetzung von OGD ausgegliedert und im vorliegenden Dokument zusammengefasst.","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../de/library/fragen-gebuehrenproblematik.html"},{"title":"Für die Gebührenproblematik relevante offene Fragen","text":"This document is available in German .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../en/library/fragen-gebuehrenproblematik.html"},{"title":"Für die Gebührenproblematik relevante offene Fragen","text":"Questo articolo è disponibile in tedesco .","tags":"Library","url":"//opendata-swiss.github.io/ogd-handbook-site/fr/../it/library/fragen-gebuehrenproblematik.html"}]}