Repository: opendata-swiss/ogd-handbook-site
Catalog: theme/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: This topic has not yet been translated. Please contact us if you need this content in your language.
fr: Ce sujet n’a pas encore été traduit; veuillez nous signaler si vous avez besoin du contenu dans votre langue.

source: Please consider adding your expertise to this topic.
fr: Brouillon: N’hésitez pas à apporter votre expertise à ce sujet.

source: Topic enquiry
fr: Question sur le sujet

source: Library
fr: Bibliothèque

source: Start here...
fr: Démarrer ici...

source: Search topics...
fr: Rechercher des sujets...

source: Glossary
fr: Glossaire

source: Latest updates
fr: Actualités

source: Published
fr: Publié

source: Modified
fr: Modifié

source: Series
fr: Séries

source: Author(s)
fr: Auteur(s)

source: Category
fr: Categorie

source: Translations
fr: Traductions

source: Edit
fr: Traiter

source: Instructions
fr: Mode d'emploi

source: Annotate
fr: Annoter

source: The ability to annotate and comment on this content is provided using an external, third party service. The maintainers of this website take no responsibility for any content that appears therein. You must review and accept the applicable Terms and Conditions of Use.
fr: La capacité d'annoter et commenter ce contenu est fourni à l'aide d'un service de partie externe, troisième. Les responsables de ce site prennent aucune responsabilité pour tout contenu qui y figure. Vous devez lire et accepter les Conditions d'utilisation applicables.

source: Please mark your annotations and comments as public if you wish for any other people to see them.
fr: S'il vous plaît marquez vos annotations et commentaires 'public' si vous souhaitez que toutes les autres personnes peuvent les voir.

source: Cancel
fr: Annuler

source: Accept and continue
fr: Accepter et continuer

source: Open Government Data Switzerland
fr: Projet Open Government Data Suisse

source: Paper
fr: Dossier

source: Presentation
fr: Présentation

source: Metadata
fr: Métadonnées

source: The OGD Handbook provides support for individuals and organizations wishing to publish open government data. It is designed as a wiki: contributions from organizations and individuals that have experience with open data are explicitly welcomed. handbook.opendata.swiss is operated by the Federal Statistical Office.
fr: Le manuel OGD apporte une aide aux personnes et aux organisations souhaitant publier en libre accès des données de l’administration publique. Il est conçu comme un Wiki: les contributions d’organisations et de personnes expérimentées dans le domaine des OGD sont expressément recherchées. handbook.opendata.swiss est administré par l'Office fédéral de la statistique.

source: About us
fr: A propos du manuel

source: Legal notice
fr: Mention juridique

source: is currently available as a beta version. Click here to report problems.
fr: est disponible en version bêta. Cliquez ici pour signaler un problème.

source: Identify
fr: Sélection

source: Prepare
fr: Établir

source: Publish
fr: Publier

source: Support
fr: Soutenir

source: data for opening
fr: des données pour l'ouverture

source: legal foundations
fr: les fondements juridiques

source: as open data
fr: en tant que données ouvertes

source: and promote usage
fr: et promouvoir l'utilisation

source: In order to publish OGD, you need to know which data are suitable. This chapter will help you select the right datasets and advise you on what you need to check.
fr: Avant de publier des données publiques, vous devez déterminer les jeux de données adéquats. Le présent chapitre vous guidera dans la sélection et vous livrera des pistes quant aux travaux à effectuer avant une publication.

source: During the first phase, you identified the data that you want to publish as OGD. Before preparing the data technically for publication, you must establish under what conditions the datasets can be used. This chapter contains a simple diagram to help you select the right conditions of use.
fr: Vous avez identifié les données que vous souhaitez publier comme données publiques en libre accès. Avant de pouvoir les préparer à la publication sur le plan technique, vous devez déterminer à quelles conditions les jeux de données peuvent être utilisés. Le présent chapitre contient un schéma simple qui vous aidera à choisir les conditions d’utilisation adéquates.

source: opendata.swiss is the central point of access to Swiss Open Government Data (OGD). This section explains how to publish your data on opendata.swiss.
fr: opendata.swiss est le portail centralisé pour le libre accès aux données publiques (OGD) en Suisse. Dans le présent chapitre, nous vous expliquons comment publier vos données sur opendata.swiss.

source: By publishing your data on opendata.swiss you’ve completed the most important step. However, users will have questions about the data and require support. Here you will find an overview of the most frequently asked questions about published OGD. Please note: This chapter is still a work in progress. Contact us if you would like to suggest content.
fr: Avec la publication de vos données sur opendata.swiss vous avez réussi l’étape la plus importante. Cependant, les utilisateurs pouvent avoir des questions au sujet des données et avoir besoin d’aide. Vous trouverez ici une vue d’ensemble des questions courantes autour des données publiées. Remarque : ce chapitre est encore en construction. Si vous souhaitez proposer du contenu, veuillez vous incrire.
